	.глоб   чисти
	.глоб   внеш
	.глоб   экстры
	.глоб   внутрь
	.глоб   эк50
СМ      =       0112312
:       пб      чисти

:       ост     2
	пб      внеш
:       зч      СМ
	пб      экстры
:       ост     4

:       ост     5

:       зч      СМ
	пб      внутрь
:       ост     7
	вд
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	пб      эк50
:       зч      СМ
	ост     040
