#!/usr/bin/env python3
#
# Decode text from Baška tablet.
# https://en.wikipedia.org/wiki/Ba%C5%A1ka_tablet
#
input = """
ⰰⰸⱏ–––––ⱌⰰⰻⱄⱀⰰ––ⱅⰰⰳⱁⰴⱆⱈⰰⰰⰸⱏ
ⱁⱂⰰⱅ–ⰴⱃⱏⰶⰻⱈⱝⱂⰻⱄⰰⱈⱏⱄⰵⱁⰾⰵⰴⰻⱑⱓⰶⰵ
ⰴⰰⰸⱏⰲⱏⱀⰻⰿⱃⱏⰽⱃⰰⰾⱏⱈⱃⱏⰲⱝⱅⱏⱄⰽⱏ–––
ⰴⱀⰻⱄⰲⱁⱗⰲⱏⱄⰲⰵⱅⱆⱓⰾⱆⱌⰻⱓⰻⱄⰲⰵ––
ⰿⰻⰶⱆⱂⱝⱀⱏⰴⰵⱄⰻ–ⱃⱝⰽⱃⱏⰱⱝⰲⱑⰿⱃⱝ–––ⱏⰲ––
ⱌⱑⱂⱃⰱⱏⱀⰵⰱⰳⰰ–ⱏⱂⱁⱄⰾ–ⰲⰻⱀⱁⰴⰾⱑ––ⰲⰰⰲⱁ
ⱅⱁⱌⱑⰴⰰⰻⰶⰵⱅⱉⱂⱁⱃⱒⰵⰽⰾⱏⱀⰻⰻⰱⱁⰻⰱ–ⰰⱀⰾⰰⰻⰳⰵ
ⰲⰰⰼⰾⰻⱄⱅ҃ⰻⰻⱄⱅ҃ⰰⱑⰾⱆⱌⰻⱑⰰⱞⱀⱏⰴⰰⰻⰾⰵⱄⰴⱑⰶⰻⰲⰵ
ⱅⱏⱞⱉⰾⰻⰸⱝⱀⰵⰱ҃ⱁⰳⰰⰰⰸⱏⱁⱀⱝⱅⱏⰴⰱⱃⱉⰲⱜⱅⱏⰸⱏ
ⰴⱝⱈⱏⱌⱃ꙯ⱑⰽⱏⰲⱏⱄⰻⱅⰻⱄⰲⱉⰵⱓⰱⱃⱝⰰⱜⱓⱄⱏⰴⰵⰲ
ⰵⱅⰻⱓⰲⱏⰴⱀⰻⰽⱏⱀⰵⰸⰰⰽⱉⱄⱏⱞⱏⱅⱝⱉⰱⰾⰰⰾ
ⰰⱓⱋⱝⰳⱉⰲⱏⱄⱆⰽⱏⱃⱝⰻⱀⱆⰻⰱⱑⱎⰵⰲⱏⱅⱏⰾNⱜⱞ
ⱜⰽⱆⰾⱝⰲⱏⱉтⱉⱒⱍ–––ⰲⰵт꙯ⱆⱓⰾⱆⱌ꙯ⱜⱓⰲⱏⰵⰾⰻNⱉ
"""
glag_to_ukr = {
'Ⰰ': 'А', 'ⰰ': 'А',
'Ⰱ': 'Б', 'ⰱ': 'Б',
'Ⰲ': 'В', 'ⰲ': 'В',
'Ⰳ': 'Ґ', 'ⰳ': 'Ґ',
'Ⱒ': 'Г', 'ⱒ': 'Г',
'Ⰴ': 'Д', 'ⰴ': 'Д',
'Ⱖ': 'Ё', 'ⱖ': 'Ё',
'Ⰵ': 'Е', 'ⰵ': 'Е',
'Ⱗ': 'Є', 'ⱗ': 'Є',
'Ⰶ': 'Ж', 'ⰶ': 'Ж',
'Ⰸ': 'З', 'ⰸ': 'З',
'Ⰹ': 'И', 'ⰹ': 'И',
'Ⰻ': 'І', 'ⰻ': 'І',
'Ⱛ': 'Й', 'ⱛ': 'Й',
'Ⰽ': 'К', 'ⰽ': 'К',
'Ⰾ': 'Л', 'ⰾ': 'Л',
'Ⰿ': 'М', 'ⰿ': 'М',
'Ⱀ': 'Н', 'ⱀ': 'Н',
'Ⱁ': 'О', 'ⱁ': 'О',
'Ⱂ': 'П', 'ⱂ': 'П',
'Ⱃ': 'Р', 'ⱃ': 'Р',
'Ⱄ': 'С', 'ⱄ': 'С',
'Ⱅ': 'Т', 'ⱅ': 'Т',
'Ⱆ': 'У', 'ⱆ': 'У',
'Ⱇ': 'Ф', 'ⱇ': 'Ф',
'Ⱈ': 'Х', 'ⱈ': 'Х',
'Ⱌ': 'Ц', 'ⱌ': 'Ц',
'Ⱍ': 'Ч', 'ⱍ': 'Ч',
'Ⱎ': 'Ш', 'ⱎ': 'Ш',
'Ⱋ': 'Щ', 'ⱋ': 'Щ',
'Ⱏ': 'Ъ', 'ⱏ': 'Ъ',
'Ⱐ': 'Ь', 'ⱐ': 'Ь',
'Ⱓ': 'Ю', 'ⱓ': 'Ю',
'Ⱑ': 'Я', 'ⱑ': 'Я',
}

for ch_glag in input:
    ch_ukr = glag_to_ukr.get(ch_glag, ch_glag)
    print(ch_ukr, end=' ')
print("\n")

# A[ZЪ VЪ IME O]TCA I S(I)NA [I S](VE)TAGO DUHA AZЪ
# OPAT[Ъ] DRŽIHA PISAHЪ SE O LEDI[N]Ě JuŽE
# DA ZЪVЪNIM[I]RЪ KRALЪ HRЪVATЪSKЪÏ [VЪ]
# DNI SVOJĘ VЪ SVETUJu LUCIJu I S[VEDO]-
# MI ŽUPANЪ DESIMRA KRЪ[BA]VĚ MRA[TIN]Ъ VЪ L(I)-
# CĚ PR(I)BЪNEBŽA [S]Ъ POSL[Ъ] VIN[OD](O)LĚ [ĚK](O)VЪ V(Ъ) O-
# TOCĚ DA IŽE TO POREČE KLЪNI I BO(G) I BÏ(=12) AP(OSTO)LA I G(=4) E-
# VA(N)J(E)LISTI I S(VE)TAĚ LUCIĚ AM(E)NЪ DA IŽE SDĚ ŽIVE-
# TЪ MOLI ZA NE BOGA AZЪ OPATЪ D(O)BROVITЪ ZЪ-
# DAH CRĚKЪVЪ SIJu I SVOEJu BRATIJu SЪ DEV-
# ETIJu VЪ DNI KЪNEZA KOSЪМЪTA OBLAD-
# AJuĆAGO VЪSU KЪRAINU I BĚŠE VЪ TЪ DNI M-
# IKULA VЪ OTOČЪCI [SЪ S]VETUJu LUCIJu VЪ EDINO

# АЗЪ – – – – – ЦА І СНА – – ТАҐО ДУХА АЗЪ
# ОПАТ – ДРЪЖІХⱝ ПІСАХЪ СЕ О ЛЕДІЯ ЮЖЕ
# ДА ЗЪВЪНІМРЪ КРАЛЪ ХРЪВⱝТЪСКЪ – – –
# ДНІ СВОЄ ВЪ СВЕТУЮ ЛУЦІЮ І СВЕ – –
# МІ ЖУПⱝНЪ ДЕСІ–Рⱝ КРЪБⱝВЯ МРⱝ – – –Ъ В – –
# ЦЯ ПРБЪНЕБҐА –Ъ ПОСЛ – ВІНОДЛЯ – – ВАВО
# ТОЦЯ ДА ІЖЕ Тⱉ ПОРГЕ КЛЪНІ І БО І 12 АНЛА І 4 Е
# ВАⰼЛІСТ~І І СТ~АЯ ЛУЦІЯ АⱞНЪ ДА ІЛЕ СДЯ ЖІВЕ
# ТЪ ⱞⱉЛІ Зⱝ НЕ Б~ОҐА АЗЪ ОНⱝТЪ ДБРⱉВⱜТЪ ЗЪ
# ДⱝХЪ ЦР ꙯ЯКЪВЪ СІТ І СВⱉЕЮ БРⱝАⱜЮ СЪ ДЕВ
# ЕТІЮ ВЪ ДНІ КЪНЕЗА КⱉСЪⱞЪТⱝ ⱉБЛАЛ
# АЮЩⱝҐⱉ ВЪСУ КЪРⱝІНУ І БЯШЕ ВЪ ТЪ ЛNⱜ ⱞ
# ⱜКУЛⱝ ВЪ ⱉтⱉГЧ – – – ВЕт ꙯УЮ ЛУЦ ꙯ⱜЮ ВЪ ЕЛІNⱉ 
