КАС2.01/19.06.89/ Файл ACDN : Лист 1. Дата 08.07.89 (00:17)


Тг   Адрес Код:8		Строка	Текст

				1		.ОБЛ	ТЕСТАЦД(32)
				3	; *			ХОРОШИЙ ОСТАНОВ
00 0000040 17 074 0000017	4	СТП	ПА	15,15		;НОМЕР ТЕСТА
	   17 077007 0040	5		ОСТ	040,15
00 0000041 00 030 0000051	6		ПБ	НАЧТ2		;ПРИ ПРОТАЛКИВАНИИ ПОВТОР ТЕСТА
	  =00000000001		7	НАЧТ	.ЭКВ	1
	   00 072 0000000
00 0000042 00 064 0001422	8	НАЧТ1	ЗН	ЯЧКС
	   13 074 3776364	9		ПА	НАЧТ-КСУМТ+1,11 ;И11= 1- ДЛИНА ОБЛАСТИ ТЕСТА
				10	
				11	; *		    КОНТРОЛЬНОЕ СУММИРОВАНИЕ
				12	
00 0000043 13 060 0001415	13	КСУМ	СТ	КСУМТ-1,11
	   00 013 0001422	14		ЦС	ЯЧКС
00 0000044 00 000 0001422	15		ЗЧ	ЯЧКС		;СУММИРУЕМ ОЧЕРЕДНОЕ СЛОВО
	   00 077030 2760	16		ВР	02760
00 0000045 00 077026 2071	17		СД	1024+57
	   00 013 0001422	18		ЦС	ЯЧКС
00 0000046 00 000 0001422	19		ЗЧ	ЯЧКС		;СУММИРУЕМ ЕГО ТЕГ
	   13 033 0000043	20		КЦ	КСУМ,11		;ЦИКЛ СУММИРОВАНИЯ
00 0000047 00 012 0001416	21		СР	КСУМТ		;СРАВНЕНИЕ С ЭТАЛОННОЙ
	   00 050 0000051	22		УР	НАЧТ2		;  СУММОЙ
				23	
				24	; *			    СТОП 1
				25	; *		НЕ СОВПАЛА КОНТРОЛЬНАЯ СУММА ТЕСТА
				26	; *   ИНДИКАЦИЯ:
				27	; *		ВР  - ЭТАЛОННАЯ КОНТРОЛЬНАЯ СУММА
				28	; *		РМР - ПОДСЧИТАННАЯ СУММА
				29	; *		СМ  - КОД НЕСРАВНЕНИЯ
				30	; * ПРИ ПРОТАЛКИВАНИИ ВЫПОЛНЯЕТСЯ ПЕРЕХОД НА ПОДСЧЕТ КОНТРОЛЬ-
				31	; * НОЙ СУММЫ
				32	
00 0000050 00 077007 0001	33		ОСТ	1
	   00 030 0000042	34		ПБ	НАЧТ1
				35	
				36	; *		    НАЧАЛЬНАЯ НАСТРОЙКА ТЕСТА
   0000051			37	НАЧТ2	.ВХОД
00 0000051 00 010 0001162	38		СЧ	ТТ
	   00 077050 0011	39		ИУ	011		;ПРИЗНАК ТТ - В ИС1
00 0000052 00 010 0000000	40		СЧ
	   00 000 0001677	41		ЗЧ	ГРМ		;0 - В ГРМ
00 0000053 00 077006 0046	42		ЗР	046
	   00 110 0000001	43		СЧЛ	1
00 0000054 00 000 0001421	44		ЗЧ	ФЛРЕЖ		;ФЛРЕЖ=1 - ВЫПОЛНЯЕТСЯ МАЛЫЙ ТЕСТ
	   04 074 3777771	45		ПА	-7,4		;СЧЕТЧИК ЦИКЛА ПО ДИСПЛЕЯМ
00 0000055 04 010 0001246	46		СЧ	ТНВУ,4
	   00 000 0001674	47		ЗЧ	НВУ		;СТАНДАРТНЫЙ НОМЕР АЦД (100)
00 0000056 00 010 0000000	48		СЧ
	   00 000 0001423	49		ЗЧ	РЕЖИМ		;ОБЕ ЧАСТИ ТЕСТА
00 0000057 01 074 0000000	50		ПА	,1		;НОМЕР У-КАНАЛА = 0
	   03 074 0000000	51		ПА	,3		;ТИП КОДИРОВКИ - КОИ-8
00 0000060 00 010 0777777	52		СЧ	ФПАРТ		;ЕСЛИ 0 - ПАРАМЕТРОВ НЕТ 
	   00 077040 0005	53		УИ	5
00 0000061 00 050 0000105	54		УР	ТАЦД
	   05 075 3777777	55		СА	-1,5
00 0000062 00 010 0777776	56		СЧ	ФНКАН		;ЕСЛИ 0 - НОМЕР КАНАЛА
	   00 050 0000065	57		УР	ДАЙНВУ		;  НЕ ЗАДАН
00 0000063 00 010 0777775	58		СЧ	НКАН
	   00 111 0000003	59		ЛУЛ	3
00 0000064 00 077040 0001	60		УИ	1		;НОМЕР У-КАНАЛА
	   00 072 0000000
00 0000065 05 040 0000105	61	ДАЙНВУ	ИР	ТАЦД,5
КАС2.01/19.06.89/ Файл ACDN : Лист 2. Дата 08.07.89 (00:17)


Тг   Адрес Код:8		Строка	Текст

	   05 075 3777777	62		СА	-1,5
00 0000066 00 010 0777774	63		СЧ	ФНАЦД		;ЕСЛИ 0 - НОМЕР АЦД НЕ ЗАДАН
	   00 050 0000075	64		УР	ДАЙРЕЖ
00 0000067 00 010 0777773	65		СЧ	НАЦД
	   00 050 0000075	66		УР	ДАЙРЕЖ		;ИДИ НА МАЛЫЙ ТЕСТ
00 0000070 00 111 0000377	67		ЛУЛ	0377
	   00 000 0001674	68		ЗЧ	НВУ
00 0000071 00 022 0000000	69		ВЧ
	   00 111 0000001	70		ЛУЛ	1
00 0000072 00 112 0000001	71		СРЛ	1
	   00 077026 1770	72		СД	1024-8
00 0000073 00 015 0001674	73		ЛС	НВУ
	   00 000 0001674	74		ЗЧ	НВУ		;ДОПОЛНИМ НВУ ДО НЕЧЕТА
00 0000074 00 064 0001421	75		ЗН	ФЛРЕЖ		;ФЛРЕЖ=0 - ВЫП. БОЛЬШОЙ ТЕСТ
	   00 072 0000000
00 0000075 05 040 0000105	76	ДАЙРЕЖ	ИР	ТАЦД,5
	   05 075 3777777	77		СА	-1,5
00 0000076 00 010 0777772	78		СЧ	ФРЕЖТ		;ЕСЛИ 0 - РЕЖИМ НЕ ЗАДАН
	   00 050 0000101	79		УР	ДАЙКОД
00 0000077 00 010 0777771	80		СЧ	РЕЖТ
	   00 111 0000007	81		ЛУЛ	7
00 0000100 00 000 0001423	82		ЗЧ	РЕЖИМ		;РЕЖИМ ПРОХОЖДЕНИЯ
	   00 072 0000000
00 0000101 05 040 0000105	83	ДАЙКОД	ИР	ТАЦД,5
	   05 075 3777777	84		СА	-1,5
00 0000102 00 010 0777770	85		СЧ	ФКДК		;0 - КОДИРОВКА КОИ-8
	   00 050 0000105	86		УР	ТАЦД
00 0000103 00 010 0777767	87		СЧ	ТКДК
	   00 111 0000001	88		ЛУЛ	1
00 0000104 00 077040 0003	89		УИ	3		;ТИП КОДИРОВКИ
				90	
	   00 072 0000000
00 0000105 00 010 0001172	91	ТАЦД	СЧ	РАБК
	   01 077006 0070	92		ЗР	070,1		;РАБ-К В КАНАЛ
00 0000106 12 074 2000000	93		ПА	02000000,10	;ВРЕМЯ ВЫДЕРЖКИ
	   00 072 0000000
00 0000107 00 074 0000000	94	ЖДУ1	ПА
	   12 033 0000107	95		КЦ	ЖДУ1,10		;ВЫДЕРЖКА ПОСЛЕ ВЫДАЧИ РАБ-К
00 0000110 00 064 0001417	96	СЛЕД	ЗН	ФЛСЧТ
	   07 074 0000000	97		ПА	,7
00 0000111 00 010 0001367	98		СЧ	АЦД-3
	   00 015 0001170	99		ЛС	МАСКНОМ
00 0000112 00 012 0001170	100		СР	МАСКНОМ
	   00 000 0001367	101		ЗЧ	АЦД-3
00 0000113 00 010 0001674	102		СЧ	НВУ
	   00 077026 1722	103		СД	1024-46
00 0000114 00 015 0001367	104		ЛС	АЦД-3
	   00 000 0001367	105		ЗЧ	АЦД-3		;ЗАНЕСЕНИЕ НОМЕРА ВУ В ДИАГРАММУ
00 0000115 12 074 3777776	106		ПА	-2,10
	   00 072 0000000
00 0000116 12 010 0001372	107	ЗАПНВУ	СЧ	АЦД,10
	   00 115 0000777	108		ЛСЛ	0777
00 0000117 00 112 0000777	109		СРЛ	0777
	   00 015 0001674	110		ЛС	НВУ
00 0000120 12 000 0001372	111		ЗЧ	АЦД,10
	   12 033 0000116	112		КЦ	ЗАПНВУ,10
				113	
				114	; *		    БЛОК ПРОВЕРКИ ИНТЕРФЕЙСА
				115	; *		   ВЫДАЕТСЯ КОМАНДА 'СЧИТАТЬ'
				116	
00 0000121 05 074 3777777	117		ПА	-1,5
	   00 072 0000000
КАС2.01/19.06.89/ Файл ACDN : Лист 3. Дата 08.07.89 (00:17)


Тг   Адрес Код:8		Строка	Текст

00 0000122 05 010 0001366	118	ЦЗКОП1	СЧ	АЦД-4,5
	   00 115 0000777	119		ЛСЛ	0777
00 0000123 00 112 0000777	120		СРЛ	0777
	   00 015 0001247	121		ЛС	СЧТ		;КОД ОПЕРАЦИИ СЧТ
00 0000124 05 000 0001366	122		ЗЧ	АЦД-4,5		;  В ДИАГРАММУ
	   05 033 0000122	123		КЦ	ЦЗКОП1,5
00 0000125 16 031 0001043	124		ПВ	ОТРВН,14	;ПРОВЕРКА НА 'ВНИМАНИЕ'
	   00 072 0000000
00 0000126 15 074 3777772	125	ВНИМ	ПА	-6,13
	   07 074 0000000	126		ПА	,7
00 0000127 17 074 0001373	127		ПА	АЦД+1,15	;НАЧАЛЬНАЯ ВЫБОРКА
	   16 031 0001047	128		ПВ	ДИАГР,14
00 0000130 07 074 0000001	129	ОПЧТЕН	ПА	1,7
	   17 074 0001402	130		ПА	ЧТЕНИЕ+1,15
00 0000131 15 074 3777776	131		ПА	-2,13
	   16 031 0001047	132		ПВ	ДИАГР,14
00 0000132 07 074 0000000	133	ЗАВОП	ПА	,7
	   15 074 0000000	134		ПА	,13
00 0000133 17 074 0001357	135		ПА	ИНФ-1,15	;ЗАВЕРШЕНИЕ ОПЕРАЦИИ
	   16 031 0001047	136		ПВ	ДИАГР,14
00 0000134 15 074 3777776	137	ЗАВОП1	ПА	-2,13
	   17 074 0001376	138		ПА	КЧТ,15
00 0000135 16 031 0001047	139		ПВ	ДИАГР,14
	   00 072 0000000
00 0000136 00 110 0000001	140	ЗВОП	СЧЛ	1
	   00 000 0001417	141		ЗЧ	ФЛСЧТ
				142	
   0000137			143	ТАЦД1
	  =00000000001		144	К	.ЭКВ	1
				145		.ВСТ:К	-T1-
				146	; *			     ЧАСТЬ 1
				147	; *
				148	; *    В 1-Й ЧАСТИ ТЕСТА ПРОВЕРЯЮТСЯ КОМАНДЫ 'СЧИТАТЬ'(02) И
				149	; * 'ЗАПИСАТЬ' (01). ДЛЯ ПРОВЕРКИ ВЫПОЛНЯЕТСЯ ЦИКЛ, ЧИСЛО ШАГОВ
				150	; * КОТОРОГО РАВНО 2 (ДЛЯ ЦИКЛИЧЕСКОГО ВАРИАНТА РАБОТЫ ТЕСТА)
				151	; * ЛИБО РАВНО ЧИСЛУ СИМВОЛОВ ЗАДАННОЙ КОДИРОВКИ (153 ШАГА ДЛЯ
				152	; * КОИ-8 И 135 ШАГОВ ДЛЯ ДКОИ). КАЖДЫЙ	 ШАГ СОСТОИТ ИЗ ЗАПИСИ
				153	; * ТЕКСТА НА ЭКРАН, СЧИТЫВАНИЯ ЭКРАНА И ПОСИМВОЛЬНОГО СРАВНЕ-
				154	; * НИЯ. ПРИ ОБНАРУЖЕНИИ НЕСРАВНЕНИЯ ТЕКСТОВ ВЫПОЛНЯЕТСЯ ОСТА-
				155	; * НОВ С АДРЕСОМ 51(8-ЫМ).
				156	; *    НА ПЕРВОМ  ШАГЕ	ТЕКСТ ФОРМИРУЕТСЯ  ТАК, ЧТОБЫ ВО  ВСЕХ
				157	; * СТРОКАХ ЭКРАНА ВЫСВЕЧИВАЛИСЬ ПЕРВЫЕ 80 СИМВОЛОВ КОДИРОВКИ,
				158	; * НА КАЖДОМ СЛЕДУЮЩЕМ ШАГЕ МАССИВ СИМВОЛОВ ПРЕОБРАЗУЕТСЯ ПО
				159	; * ПРАВИЛУ 'КОСОГО' ТЕСТА: 2-Й СИМВОЛ СТАНОВИТСЯ 1-М, ..., ПО-
				160	; * СЛЕДНИЙ - ПРЕДПОСЛЕДНИМ, 1-Й - ПОСЛЕДНИМ. ПОСЛЕ ЭТОГО ТЕКСТ
				161	; * ФОРМИРУЕТСЯ ТАК, ЧТОБЫ ВО ВСЕХ СТРОКАХ ВЫСВЕЧИВАЛИСЬ ПЕРВЫЕ
				162	; * 80 СИМВОЛОВ ПРЕОБРАЗОВАННОГО МАССИВА.
				163	; *
				164	; *		РАСПРЕДЕЛЕНИЕ РЕГИСТРОВ:
				165	; *	И9  - НОМЕР СИМВОЛА В ПОТОКЕ ДАННЫХ ЧТЕНИЯ
				166	; *	И10 - ЧИСЛО ШАГОВ ЧАСТИ
				167	; *	И11 - ЧИСЛО СТРОК ЭКРАНА
				168	; *	И12 - ЧИСЛО СИМВОЛОВ В СТРОКЕ
				169	
00 0000137 00 010 0001421	170		СЧ	ФЛРЕЖ
	   00 050 0000142	171		УР	Ч1Б		;НА БОЛЬШОЙ ТЕСТ
00 0000140 00 010 0001423	172		СЧ	РЕЖИМ		;ПРОВЕРИМ НА БЛОКИРОВКУ
	   00 011 0001163	173		ЛУ	БТАЦД1
00 0000141 00 051 0000257	174		УН	ТАЦД2
	   00 030 0000144	175		ПБ	Ч1
00 0000142 00 010 0001423	176	Ч1Б	СЧ	РЕЖИМ
	   00 011 0001176	177		ЛУ	БТАЦД1Б
КАС2.01/19.06.89/ Файл ACDN : Лист 4. Дата 08.07.89 (00:17)


Тг   Адрес Код:8		Строка	Текст

00 0000143 00 051 0000257	178		УН	ТАЦД2
	   00 072 0000000
00 0000144 16 031 0000772	179	Ч1	ПВ	ГЕНМАС,14	;ГЕНЕРАЦИЯ МАССИВА СИМВОЛОВ
	   00 072 0000000
00 0000145 06 074 0000000	180	КШАГ1	ПА	,6		;ПЕРВЫЙ РАЗ - СТРЗПС
	   12 074 3777777	181		ПА	-1,10		;КОЛИЧЕСТВО ШАГОВ = 2
00 0000146 00 010 0001421	182		СЧ	ФЛРЕЖ
	   00 051 0000151	183		УН	ЦТАЦД1
00 0000147 12 074 3777540	184		ПА	-160,10		;КОЛИЧЕСТВО ШАГОВ
	   03 040 0000151	185		ИР	ЦТАЦД1,3	;   ДЛЯ КОИ-8 =161
00 0000150 12 074 3777572	186		ПА	-134,10		;   ДЛЯ ДКОИ  =135
	   00 072 0000000
00 0000151 05 074 3777777	187	ЦТАЦД1	ПА	-1,5
	   00 072 0000000
00 0000152 05 010 0001366	188	ЦЗКОП2	СЧ	АЦД-4,5
	   00 115 0000777	189		ЛСЛ	0777
00 0000153 00 112 0000777	190		СРЛ	0777
	   06 015 0001251	191		ЛС	СТРЗПС,6	;КОД ОПЕРАЦИИ СТРЗПС
00 0000154 05 000 0001366	192		ЗЧ	АЦД-4,5		;  ИЛИ ЗПС - В ДИАГРАММУ
	   05 033 0000152	193		КЦ	ЦЗКОП2,5
00 0000155 06 074 0000001	194		ПА	1,6		;ДАЛЕЕ - ТОЛЬКО ЗПС
	   16 031 0001043	195		ПВ	ОТРВН,14	;ПРОВЕРКА НА 'ВНИМАНИЕ'
00 0000156 17 074 0001373	196	ВНИМ1	ПА	АЦД+1,15
	   15 074 3777771	197		ПА	-7,13
00 0000157 07 074 0000000	198		ПА	,7
	   16 031 0001047	199		ПВ	ДИАГР,14	;НАЧАЛЬНАЯ ВЫБОРКА
00 0000160 03 041 0000167	200	ВЗАГ	ИН	ВСУЗ,3		;НА РЕЖИМ ЕС 7920
	   00 010 0001212	201		СЧ	ЗБЛОК1
00 0000161 00 000 0001424	202		ЗЧ	БУФ		;ЗАГОЛОВОК БЛОКА ДЛЯ ЧТЕНИЯ
	   00 010 0001214	203		СЧ	ЗСООБ1
00 0000162 00 000 0001425	204		ЗЧ	БУФ+1		;ЗАГОЛОВОК СООБЩЕНИЯ
	   00 010 0001200	205		СЧ	СУЗ8
00 0000163 00 077026 1740	206		СД	1024-32
	   00 015 0001425	207		ЛС	БУФ+1		;СУЗ В БУФЕР
00 0000164 00 000 0001425	208		ЗЧ	БУФ+1
	   14 074 3777767	209		ПА	-9,12		;ДЛИНА ШАПКИ
00 0000165 13 074 3777750	210		ПА	-24,11		;24 СТРОКИ + ШАПКА
	   02 074 0001424	211		ПА	БУФ,2
00 0000166 10 074 0000060	212		ПА	48,8		;НАЧ. СДВИГ
	   00 030 0000176	213		ПБ	ЗАПСТР		;НА ВЫДАЧУ (В ОСНОВНОМ РЕЖИМЕ)
00 0000167 14 074 0000000	214	ВСУЗ	ПА	,12		;СНАЧАЛА ТОЛЬКО ВЫДАЧА СУЗ
	   13 074 3777750	215		ПА	-24,11		;24 СТРОКИ + СУЗ
00 0000170 00 010 0001201	216		СЧ	СУЗ
	   00 022 0000000	217		ВЧ
00 0000171 00 111 0000001	218		ЛУЛ	1
	   00 112 0000001	219		СРЛ	1
00 0000172 00 077026 1770	220		СД	1024-8
	   00 015 0001201	221		ЛС	СУЗ		;ДОПОЛНИМ СУЗ ДО НЕЧЕТА
00 0000173 00 000 0001675	222		ЗЧ	СИМВОЛ
	   00 030 0000177	223		ПБ	ЗАПСИМ		;ВЫДАЕМ СУЗ
00 0000174 02 074 0001426	224	ЗАПЭКР	ПА	БУФ+2,2		;АДРЕС БУФЕРА ДЛЯ П/П ДАЙСИМ
	   10 074 0000100	225		ПА	64,8		;НАЧ.СДВИГ ДЛЯ П/П ДАЙСИМ
00 0000175 14 074 3777661	226		ПА	-79,12		;СЛЕД.СТРОКИ БЕЗ СУЗ
	   00 072 0000000
00 0000176 16 031 0001016	227	ЗАПСТР	ПВ	ДАЙСИМ,14	;СИМВОЛ ИЗ БУФЕРА
	   00 072 0000000
00 0000177 05 074 3777777	228	ЗАПСИМ	ПА	-1,5
	   00 072 0000000
00 0000200 05 010 0001361	229	ЦЗДАН2	СЧ	ИНФ+1,5
	   00 115 0000777	230		ЛСЛ	0777
00 0000201 00 112 0000777	231		СРЛ	0777
	   00 015 0001675	232		ЛС	СИМВОЛ
КАС2.01/19.06.89/ Файл ACDN : Лист 5. Дата 08.07.89 (00:17)


Тг   Адрес Код:8		Строка	Текст

00 0000202 05 000 0001361	233		ЗЧ	ИНФ+1,5		;КОД СИМВОЛА В ДИАГРАММУ
	   05 033 0000200	234		КЦ	ЦЗДАН2,5
00 0000203 17 074 0001363	235		ПА	ИНФ+3,15
	   15 074 3777776	236		ПА	-2,13
00 0000204 16 031 0001047	237		ПВ	ДИАГР,14	;ВЫДАЧА СИМВОЛА
	   00 072 0000000
00 0000205 14 033 0000176	238	СТР	КЦ	ЗАПСТР,12	;ЦИКЛ ПО СИМВОЛАМ В СТРОКЕ
	   13 033 0000174	239		КЦ	ЗАПЭКР,11	;ЦИКЛ ПО СТРОКАМ
00 0000206 17 074 0001360	240		ПА	ИНФ,15
	   15 074 3777772	241		ПА	-6,13
00 0000207 16 031 0001047	242		ПВ	ДИАГР,14	;ВЫДАЧА ЭКРАНА
	   00 072 0000000
00 0000210 11 074 0000001	243	ЧТЕН1	ПА	1,9		;ИНИЦИАЦИЯ НОМЕРА СИМВОЛА
	   13 074 3777751	244		ПА	-23,11		;ИНИЦИИРУЕМ СЧЕТЧИК СТРОК
00 0000211 05 074 3777777	245		ПА	-1,5
	   00 072 0000000
00 0000212 05 010 0001366	246	ЦЗКОП3	СЧ	АЦД-4,5
	   00 115 0000777	247		ЛСЛ	0777
00 0000213 00 112 0000777	248		СРЛ	0777
	   00 015 0001247	249		ЛС	СЧТ		;КОД ОПЕРАЦИИ СЧТ
00 0000214 05 000 0001366	250		ЗЧ	АЦД-4,5		;  В ДИАГРАММУ
	   05 033 0000212	251		КЦ	ЦЗКОП3,5
00 0000215 16 031 0001043	252		ПВ	ОТРВН,14	;ПРОВЕРКА НА 'ВНИМАНИЕ'
	   00 072 0000000
00 0000216 17 074 0001373	253	ВНИМ2	ПА	АЦД+1,15
	   15 074 3777772	254		ПА	-6,13
00 0000217 07 074 0000000	255		ПА	,7
	   16 031 0001047	256		ПВ	ДИАГР,14	;НАЧАЛЬНАЯ ВЫБОРКА
00 0000220 00 064 0001424	257	ШАП8	ЗН	БУФ
	   00 064 0001425	258		ЗН	БУФ+1
00 0000221 07 074 0000001	259		ПА	1,7
	   03 010 0001216	260		СЧ	ШАПКА18,3	;ЗАГОЛОВОК ПОТОКА ДАННЫХ
00 0000222 00 077026 2050	261		СД	1024+40
	   00 000 0001425	262		ЗЧ	БУФ+1
00 0000223 03 041 0000232	263		ИН	ШАП,3		;= 0 - РЕЖИМ ЕС 7970
	   00 010 0001215	264		СЧ	ЗСООБ2		;ЗАГОЛОВОК СООБЩЕНИЯ ДЛЯ ЧТЕНИЯ
00 0000224 00 077026 2020	265		СД	1024+16
	   00 015 0001425	266		ЛС	БУФ+1
00 0000225 00 000 0001425	267		ЗЧ	БУФ+1
	   00 010 0001213	268		СЧ	ЗБЛОК2		;ЗАГОЛОВОК БЛОКА ДЛЯ ЧТЕНИЯ
00 0000226 00 077026 2020	269		СД	1024+16
	   00 000 0001424	270		ЗЧ	БУФ
00 0000227 02 074 0001424	271		ПА	БУФ,2		;АДРЕС БУФЕРА  И СДВИГ
	   10 074 0000040	272		ПА	32,8		;  ДЛЯ П/П ДАЙСИМ
00 0000230 14 074 3777645	273		ПА	-91,12		;80 СИМВ. + ЗАГОЛОВОК(12 СИМВ.)
	   00 077001 0000	274		ВТ
00 0000231 00 030 0000234	275		ПБ	ЧИТСИМ
	   00 072 0000000
00 0000232 02 074 0001425	276	ШАП	ПА	БУФ+1,2		;АДРЕС БУФЕРА ДЛЯ П/П ДАЙСИМ
	   10 074 0000030	277		ПА	24,8		;СДВИГ ПО СЛОВУ БУФЕРА
00 0000233 14 074 3777656	278		ПА	-82,12		;80 СИМВ. + ЗАГОЛОВОК
	   00 077001 0000	279		ВТ
00 0000234 16 031 0001016	280	ЧИТСИМ	ПВ	ДАЙСИМ,14	;СИМВОЛ ИЗ БУФЕРА
	   00 072 0000000
00 0000235 17 074 0001402	281	ЧТСИМ	ПА	ЧТЕНИЕ+1,15	;ЧИТАЕМ ОЧЕРЕДНОЙ СИМВОЛ
	   15 074 3777776	282		ПА	-2,13
00 0000236 16 031 0001047	283		ПВ	ДИАГР,14
	   00 072 0000000
00 0000237 00 010 0001707	284	СРАВН	СЧ	СИГНАЛЫ
	   00 111 0000777	285		ЛУЛ	0777		;СРАВНИМ ОЧЕРЕДНОЙ СИМВОЛ
00 0000240 00 012 0001675	286		СР	СИМВОЛ
	   00 050 0000242	287		УР	ЦЧИТ1
КАС2.01/19.06.89/ Файл ACDN : Лист 6. Дата 08.07.89 (00:17)


Тг   Адрес Код:8		Строка	Текст

				288	
				289	; *			  СТОП 51
				290	; *		ЗАФИКСИРОВАНА ОШИБКА НЕСРАВНЕНИЯ
				291	; *	ИНДИКАЦИЯ:
				292	; *		  ВР  - ОЖИДАЕМЫЙ СИМВОЛ
				293	; *		  РМР - ПРИНЯТЫЙ СИМВОЛ
				294	; *		  СМ  - КОД НЕСРАВНЕНИЯ
				295	; *		  И9  - НОМЕР СИМВОЛА В ПОТОКЕ ДАННЫХ
				296	; *	ПРИ ПРОТАЛКИВАНИИ ПРОДОЛЖИМ ВЫПОЛНЕНИЕ ЧТЕНИЯ
				297	
00 0000241 00 073 0001675	298		ИК	СИМВОЛ
	   11 077007 0051	299		ОСТ	41,9		;ПРОТАЛКИВАЕМЫЙ СТОП
				300	
00 0000242 11 075 0000001	301	ЦЧИТ1	СА	1,9		;1 К СЧЕТЧИКУ СИМВОЛОВ
	   14 033 0000234	302		КЦ	ЧИТСИМ,12	;ЦИКЛ ПО СИМВОЛАМ СТРОКИ
00 0000243 02 074 0001426	303		ПА	БУФ+2,2		;АДРЕС БУФЕРА ДЛЯ П/П ДАЙСИМ
	   10 074 0000100	304		ПА	64,8		;СДВИГ ПО СЛОВУ
00 0000244 14 074 3777661	305		ПА	-79,12		;80 СИМВ. В СТРОКЕ
	   13 033 0000234	306		КЦ	ЧИТСИМ,11	;ЦИКЛ ПО СТРОКАМ
00 0000245 07 074 0000000	307		ПА	,7
	   03 041 0000253	308		ИН	ОКЧИТ,3		;РЕЖИМ ЕС 7970 ИЛИ ЕС 7920?
00 0000246 17 074 0001357	309		ПА	ИНФ-1,15
	   15 074 0000000	310		ПА	,13		;ЗАВЕРШЕНИЕ ЧТЕНИЯ В РЕЖИМЕ ЕС
00 0000247 16 031 0001047	311		ПВ	ДИАГР,14	;  7970 - ПО ИНИЦИАТИВЕ КАНАЛА
	   00 072 0000000
00 0000250 17 074 0001376	312		ПА	КЧТ,15
	   15 074 3777776	313		ПА	-2,13
00 0000251 16 031 0001047	314		ПВ	ДИАГР,14	;ОКОНЧАНИЕ ОПЕРАЦИИ
	   00 072 0000000
00 0000252 00 030 0000255	315		ПБ	ПРЕОБРМ
	   00 072 0000000
00 0000253 17 074 0001377	316	ОКЧИТ	ПА	КЧТ+1,15	;В РЕЖИМЕ ЕС 7920
	   15 074 3777775	317		ПА	-3,13
00 0000254 16 031 0001047	318		ПВ	ДИАГР,14	;ЗАВЕРШИМ ЧТЕНИЕ
	   00 072 0000000
00 0000255 16 031 0001001	319	ПРЕОБРМ ПВ	КОСОЙТ,14	;ПРЕОБРАЗУЕМ МАССИВ
	   00 072 0000000
00 0000256 12 033 0000151	320	КОН	КЦ	ЦТАЦД1,10	;ЦИКЛ 1-Й ЧАСТИ.
				321	
	   00 072 0000000
   0000257			322	ТАЦД2
				323		.ВСТ:К	-T2-
				324	;*			ЧАСТЬ 2
				325	; *	ВО ВТОРОЙ ЧАСТИ ТЕСТА ПРОВЕРЯЮТСЯ КОМАНДЫ 'СЧИТАТЬ МО-
				326	; * ДИФИЦИРОВАННОЕ'(06) И 'ЗАПИСАТЬ'(01) СОВМЕСТНО С ПРИКАЗАМИ
				327	; * 'УСТАНОВИТЬ АДРЕС БУФЕРНОЙ ПАМЯТИ'(11) И 'НАЧАЛО ПОЛЯ'(1д),
				328	; * ДЛЯ ЭТОГО ВЫПОЛНЯЕТСЯ ЦИКЛ ИЗ 24 ШАГОВ. НА КАЖДОМ ШАГЕ ЦИК-
				329	; * ЛА ПРИ ПОМОЩИ ПРИКАЗА 'УСТАНОВИТЬ АДРЕС БУФЕРНОЙ ПАМЯТИ' В
				330	; * ОЧЕРЕДНУЮ СТРОКУ ЭКРАНА ВЫДАЕТСЯ ТЕКСТ ИЗ 79 СИМВОЛОВ ЗА-
				331	; * ДАННОЙ КОДИРОВКИ, ЗАТЕМ ТЕКСТ ЧИТАЕТСЯ В ОП КОМАНДОЙ 'СЧИ-
				332	; * ТАТЬ МОДИФИЦИРОВАННОЕ' И ВЫПОЛНЯЕТСЯ СРАВНЕНИЕ. ПРИ НЕСРАВ-
				333	; * НЕНИИ ПРОИСХОДИТ ОСТАНОВ С АДРЕСОМ 52.
				334	; *	КАЖДАЯ СТРОКА ЭКРАНА ОБ'ЯВЛЯЕТСЯ МОДИФИЦИРОВАННЫМ ПОЛЕМ
				335	; * ПРИ ПОМОЩИ ПРИКАЗА 'НАЧАЛО ПОЛЯ' С СООТВЕТСТВУЮЩИМ СИМВО-
				336	; * ЛОМ-АТРИБУТОМ (ОТОБРАЖАЕТСЯ СИМВОЛОМ '.'). ПРИ ВЫДАЧЕ ОЧЕ-
				337	; * РЕДНОЙ СТРОКИ  СНИМАЕТСЯ  ПРИЗНАК МОДИФИКАЦИИ, ПОЭТОМУ ПРИ
				338	; * СЧИТЫВАНИИ ДОЛЖНА СЧИТАТЬСЯ ТОЛЬКО СТРОКА, ВЫДАННАЯ ПОСЛЕД-
				339	; * НЕЙ. ПЕРЕД ВЫДАЧЕЙ ОЧЕРЕДНОЙ СТРОКИ ВЫПОЛНЯЕТСЯ ПРЕОБРАЗО-
				340	; * ВАНИЕ МАССИВА СИМВОЛОВ ПО ПРАВИЛУ 'КОСОГО' ТЕСТА.
				341	; *
				342	; *		РАСПРЕДЕЛЕНИЕ РЕГИСТРОВ:
				343	; *	И9  - НОМЕР СИМВОЛА В ПОТОКЕ ДАННЫХ ЧТЕНИЯ
КАС2.01/19.06.89/ Файл ACDN : Лист 7. Дата 08.07.89 (00:18)


Тг   Адрес Код:8		Строка	Текст

				344	; *	И10 - ЧИСЛО ШАГОВ ЧАСТИ
				345	; *	И11 - ЧИСЛО СИМВОЛОВ СТРОКИ
				346	
00 0000257 00 010 0001421	347		СЧ	ФЛРЕЖ
	   00 050 0000262	348		УР	Ч2Б
00 0000260 00 010 0001423	349		СЧ	РЕЖИМ
	   00 011 0001164	350		ЛУ	БТАЦД2
00 0000261 00 051 0000401	351		УН	СЛАЦД		;ПРОВЕРКА НА БЛОКИРОВКУ
	   00 030 0000264	352		ПБ	Ч2
00 0000262 00 010 0001423	353	Ч2Б	СЧ	РЕЖИМ
	   00 011 0001163	354		ЛУ	БТАЦД2Б
00 0000263 00 051 0000405	355		УН	ТАЦД3
	   00 072 0000000
00 0000264 16 031 0000772	356	Ч2	ПВ	ГЕНМАС,14	;ГЕНЕРАЦИЯ МАССИВА СИМВОЛОВ
	   00 072 0000000
00 0000265 14 074 0000000	357	КШАГ2	ПА	,12		;ПЕРВЫЙ РАЗ - СТРЗПС
	   12 074 3777751	358		ПА	-23,10		;КОЛ-ВО ШАГОВ ЧАСТИ = 24
00 0000266 00 010 0000000	359		СЧ
				360	
	   00 072 0000000
00 0000267 16 031 0000747	361	ЦТАЦД2	ПВ	АДРЕС,14	;ФОРМИРУЕМ АДРЕСА ДЛЯ ЗАПИСИ
	   00 072 0000000
00 0000270 00 077026 1740	362	ЗАГЗАП	СД	1024-32
	   03 015 0001202	363		ЛС	СУЗНП8,3	;ЗАГОЛОВОК ПОТОКА ДАННЫХ
00 0000271 00 077026 2020	364		СД	1024+16
	   00 000 0001425	365		ЗЧ	БУФ+1
00 0000272 03 041 0000300	366		ИН	ЗАГДКОИ,3	;РЕЖИМ ЕС 7970 ИЛИ ЕС 7920?
	   00 010 0001214	367		СЧ	ЗСООБ1		;ЗАГОЛОВОК СООБЩЕНИЯ ДЛЯ ЗАПИСИ
00 0000273 00 077026 2070	368		СД	1024+56
	   00 000 0001424	369		ЗЧ	БУФ
00 0000274 00 010 0001212	370		СЧ	ЗБЛОК1		;ЗАГОЛОВОК БЛОКА ДЛЯ ЗАПИСИ
	   00 077026 1770	371		СД	1024-8
00 0000275 00 015 0001424	372		ЛС	БУФ
	   00 000 0001424	373		ЗЧ	БУФ
00 0000276 02 074 0001424	374		ПА	БУФ,2		;АДРЕС БУФЕРА И СДВИГ
	   10 074 0000070	375		ПА	56,8		;  ДЛЯ П/П ДАЙСИМ
00 0000277 13 074 3777643	376		ПА	-93,11		;79 СИМВ. + ЗАГОЛОВКИ (15 СИМВ.)
	   00 030 0000302	377		ПБ	ГОТКОД
00 0000300 13 074 3777654	378	ЗАГДКОИ ПА	-84,11		;В СТРОКЕ 79 СИМВ.+ЗАГОЛОВОК
	   02 074 0001425	379		ПА	БУФ+1,2		;АДРЕС БУФЕРА ДЛЯ П/П ДАЙСИМ
00 0000301 10 074 0000060	380		ПА	48,8		;СДВИГ ДЛЯ П/П ДАЙСИМ
	   00 072 0000000
00 0000302 05 074 3777777	381	ГОТКОД	ПА	-1,5
	   00 072 0000000
00 0000303 05 010 0001366	382	ЦЗКОП4	СЧ	АЦД-4,5
	   00 115 0000777	383		ЛСЛ	0777
00 0000304 00 112 0000777	384		СРЛ	0777
	   14 015 0001251	385		ЛС	СТРЗПС,12	;КОД ОПЕРАЦИИ ЗПС ИЛИ СТРЗПС В
00 0000305 05 000 0001366	386		ЗЧ	АЦД-4,5		;  ДИАГРАММУ
	   05 033 0000303	387		КЦ	ЦЗКОП4,5
00 0000306 14 074 0000001	388		ПА	1,12		;ДАЛЬШЕ ТОЛЬКО ЗПС
	   16 031 0001043	389		ПВ	ОТРВН,14	;ПРОВЕРКА НА 'ВНИМАНИЕ'
00 0000307 17 074 0001373	390	ВНИМ3	ПА	АЦД+1,15
	   15 074 3777771	391		ПА	-7,13
00 0000310 07 074 0000000	392		ПА	,7
	   16 031 0001047	393		ПВ	ДИАГР,14	;НАЧАЛЬНАЯ ВЫБОРКА
00 0000311 16 031 0001016	394	ЗПСТР	ПВ	ДАЙСИМ,14	;СИМВОЛ ИЗ БУФЕРА
	   00 072 0000000
00 0000312 05 074 3777777	395	СИМ	ПА	-1,5
	   00 072 0000000
00 0000313 05 010 0001361	396	ЦЗДАН3	СЧ	ИНФ+1,5
	   00 115 0000777	397		ЛСЛ	0777
КАС2.01/19.06.89/ Файл ACDN : Лист 8. Дата 08.07.89 (00:18)


Тг   Адрес Код:8		Строка	Текст

00 0000314 00 112 0000777	398		СРЛ	0777
	   00 015 0001675	399		ЛС	СИМВОЛ
00 0000315 05 000 0001361	400		ЗЧ	ИНФ+1,5		;КОД СИМВОЛА В ДИАГРАММУ
	   05 033 0000313	401		КЦ	ЦЗДАН3,5
00 0000316 17 074 0001363	402		ПА	ИНФ+3,15
	   15 074 3777776	403		ПА	-2,13
00 0000317 16 031 0001047	404		ПВ	ДИАГР,14	;ВЫДАЧА СИМВОЛА
	   00 072 0000000
00 0000320 13 033 0000311	405	ВСИМ	КЦ	ЗПСТР,11
	   17 074 0001360	406		ПА	ИНФ,15
00 0000321 15 074 3777772	407		ПА	-6,13
	   16 031 0001047	408		ПВ	ДИАГР,14	;ВЫДАЧА СТРОКИ
00 0000322 05 074 3777777	409	СТРОКА	ПА	-1,5
	   00 072 0000000
00 0000323 05 010 0001366	410	ЦЗКОП5	СЧ	АЦД-4,5
	   00 115 0000777	411		ЛСЛ	0777
00 0000324 00 112 0000777	412		СРЛ	0777
	   00 015 0001250	413		ЛС	СЧТМ		;КОД ОПЕРАЦИИ СЧТМ В
00 0000325 05 000 0001366	414		ЗЧ	АЦД-4,5		;  ДИАГРАММУ
	   05 033 0000323	415		КЦ	ЦЗКОП5,5
00 0000326 16 031 0001043	416		ПВ	ОТРВН,14	;ПРОВЕРКА НА 'ВНИМАНИЕ'
	   00 072 0000000
00 0000327 17 074 0001373	417	ВНИМ4	ПА	АЦД+1,15
	   15 074 3777772	418		ПА	-6,13
00 0000330 07 074 0000000	419		ПА	,7
	   16 031 0001047	420		ПВ	ДИАГР,14	;НАЧАЛЬНАЯ ВЫБОРКА
00 0000331 00 064 0001424	421	ШАДР	ЗН	БУФ
	   00 064 0001425	422		ЗН	БУФ+1
00 0000332 00 010 0001701	423		СЧ	НАЧПОЗ
	   00 111 0000077	424		ЛУЛ	077
00 0000333 00 113 0000001	425		ЦСЛ	1
	   03 041 0000336	426		ИН	МЛБА,3		;РЕЖИМ?
00 0000334 16 031 0001031	427		ПВ	ВКОИ86,14	;ДЛЯ ЕС 7970
	   00 072 0000000
00 0000335 00 030 0000337	428		ПБ	МЛБАД
	   00 072 0000000
00 0000336 16 031 0001026	429	МЛБА	ПВ	ВДКОИ6,14	;ДЛЯ ЕС 7920
	   00 072 0000000
00 0000337 00 000 0001675	430	МЛБАД	ЗЧ	СИМВОЛ		;МЛ. БАЙТ АДРЕСА АТР. + 1
	   00 010 0001702	431		СЧ	АДР
00 0000340 00 111 0177400	432		ЛУЛ	0177400
	   00 015 0001675	433		ЛС	СИМВОЛ
00 0000341 00 077026 1760	434		СД	1024-16
	   03 015 0001220	435		ЛС	ШАПКА28,3	;ЗАГОЛОВОК ПОТОКА ДАННЫХ
00 0000342 00 077026 2020	436		СД	1024+16
	   00 000 0001425	437		ЗЧ	БУФ+1
00 0000343 03 041 0000353	438		ИН	ШАПДКОИ,3	;РЕЖИМ ЕС 7970 ИЛИ ЕС 7920?
	   00 010 0001215	439		СЧ	ЗСООБ2		;ЗАГОЛОВОК СООБЩЕНИЯ ДЛЯ ЧТЕНИЯ
00 0000344 00 077026 1770	440		СД	1024-8
	   00 015 0001425	441		ЛС	БУФ+1
00 0000345 00 000 0001425	442		ЗЧ	БУФ+1
	   00 077031 0000	443		МР
00 0000346 00 000 0001424	444		ЗЧ	БУФ
	   00 010 0001213	445		СЧ	ЗБЛОК2		;ЗАГОЛОВОК БЛОКА ДЛЯ ЧТЕНИЯ
00 0000347 00 077026 1770	446		СД	1024-8
	   00 015 0001424	447		ЛС	БУФ
00 0000350 00 000 0001424	448		ЗЧ	БУФ
	   02 074 0001424	449		ПА	БУФ,2		;АДРЕС БУФЕРА И СДВИГ
00 0000351 10 074 0000070	450		ПА	56,8		;  ДЛЯ П/П ДАЙСИМ
	   13 074 3777643	451		ПА	-93,11		;ЧИСЛО СИМВОЛОВ СТРОКИ
00 0000352 00 030 0000355	452		ПБ	ГОТЗАГ
	   00 072 0000000
КАС2.01/19.06.89/ Файл ACDN : Лист 9. Дата 08.07.89 (00:18)


Тг   Адрес Код:8		Строка	Текст

00 0000353 02 074 0001425	453	ШАПДКОИ ПА	БУФ+1,2		;АДРЕС БУФЕРА ДЛЯ П/П ДАЙСИМ
	   10 074 0000060	454		ПА	48,8		;СДВИГ ПО СЛОВУ БУФЕРА
00 0000354 13 074 3777654	455		ПА	-84,11		;ЧИСЛО СИМВОЛОВ СТРОКИ
	   00 072 0000000
00 0000355 11 074 0000001	456	ГОТЗАГ	ПА	1,9		;СЧЕТЧИК СИМВОЛОВ
	   07 074 0000001	457		ПА	1,7
00 0000356 16 031 0001016	458	ЧТСТР	ПВ	ДАЙСИМ,14	;СИМВОЛ ИЗ БУФЕРА
	   00 072 0000000
00 0000357 17 074 0001402	459	СИМБУФ	ПА	ЧТЕНИЕ+1,15
	   15 074 3777776	460		ПА	-2,13
00 0000360 16 031 0001047	461		ПВ	ДИАГР,14	;ЧИТАЕМ ОЧЕРЕДНОЙ СИМВОЛ
	   00 072 0000000
00 0000361 00 010 0001707	462	СРСИМ	СЧ	СИГНАЛЫ
	   00 111 0000777	463		ЛУЛ	0777
00 0000362 00 012 0001675	464		СР	СИМВОЛ		;СРАВНИМ ОЧЕРЕДНОЙ СИМВОЛ
	   00 050 0000364	465		УР	ЦЧИТ2
				466	
				467	; *			   СТОП 52
				468	; *		ЗАФИКСИРОВАНА ОШИБКА НЕСРАВНЕНИЯ
				469	; *	ИНДИКАЦИЯ:
				470	; *		  ВР  - ОЖИДАЕМЫЙ СИМВОЛ
				471	; *		  РМР - ПРИНЯТЫЙ СИМВОЛ
				472	; *		  СМ  - КОД НЕСРАВНЕНИЯ
				473	; *		  И9  - НОМЕР СИМВОЛА В ПОТОКЕ ДАННЫХ
				474	; *	ПРИ ПРОТАЛКИВАНИИ ПРОДОЛЖИМ ВЫПОЛНЕНИЕ ЧТЕНИЯ
				475	
00 0000363 00 073 0001675	476		ИК	СИМВОЛ
	   11 077007 0052	477		ОСТ	42,9		;ПРОТАЛКИВАЕМЫЙ СТОП
				478	
00 0000364 11 075 0000001	479	ЦЧИТ2	СА	1,9
	   13 033 0000356	480		КЦ	ЧТСТР,11	;ЦИКЛ ПО СТРОКЕ
00 0000365 07 074 0000000	481		ПА	,7
	   03 041 0000373	482		ИН	ОКСЧТ,3		;РЕЖИМ ЕС 7920 ИЛИ ЕС 7970?
00 0000366 17 074 0001357	483		ПА	ИНФ-1,15
	   15 074 0000000	484		ПА	,13		;ВЫДАЧА КАНАЛОМ УПР-К ДЛЯ
00 0000367 16 031 0001047	485		ПВ	ДИАГР,14	;  ЗАВЕРШЕНИЯ ЧТЕНИЯ
	   00 072 0000000
00 0000370 17 074 0001376	486		ПА	КЧТ,15
	   15 074 3777776	487		ПА	-2,13
00 0000371 16 031 0001047	488		ПВ	ДИАГР,14	;ОКОНЧАНИЕ ОПЕРАЦИИ В ЕС 7970
	   00 072 0000000
00 0000372 00 030 0000375	489		ПБ	ЗАВЧТ
	   00 072 0000000
00 0000373 17 074 0001377	490	ОКСЧТ	ПА	КЧТ+1,15
	   15 074 3777775	491		ПА	-3,13
00 0000374 16 031 0001047	492		ПВ	ДИАГР,14	;ЗАВЕРШИМ ЧТЕНИЕ В ЕС 7920
	   00 072 0000000
00 0000375 16 031 0001001	493	ЗАВЧТ	ПВ	КОСОЙТ,14	;ПРЕОБРАЗУЕМ МАССИВ СИМВОЛОВ
	   00 072 0000000
00 0000376 00 010 0001701	494	ОПРНП	СЧ	НАЧПОЗ		;НАЧАЛЬНАЯ ПОЗИЦИЯ
	   00 113 0000120	495		ЦСЛ	80		;  СЛЕДУЮЩЕЙ СТРОКИ
00 0000377 12 033 0000267	496		КЦ	ЦТАЦД2,10	;ЦИКЛ ПО СТРОКАМ
	   00 010 0001421	497		СЧ	ФЛРЕЖ
00 0000400 00 050 0000405	498		УР	ТАЦД3
				499	
	   00 072 0000000
00 0000401 04 010 0001247	500	СЛАЦД	СЧ	ТНВУ+1,4
	   00 050 0000404	501		УР	КНЦ
00 0000402 00 111 0000777	502		ЛУЛ	0777
	   00 000 0001674	503		ЗЧ	НВУ		;СЛЕДУЮЩИЙ АЦД
00 0000403 04 033 0000105	504		КЦ	ТАЦД,4
	   00 030 0000732	505		ПБ	ВЫХТ
КАС2.01/19.06.89/ Файл ACDN : Лист 10. Дата 08.07.89 (00:18)


Тг   Адрес Код:8		Строка	Текст

00 0000404 04 033 0000401	506	КНЦ	КЦ	СЛАЦД,4
	   00 030 0000732	507		ПБ	ВЫХТ
				508	
   0000405			509	ТАЦД3
				510		.ВСТ:К	-T3-
				511	; *			  ЧАСТЬ 3
				512	; *
				513	; *    В ТРЕТЬЕЙ ЧАСТИ ТЕСТА ПРОВЕРЯЮТСЯ КОМАНДЫ 'СЧИТАТЬ МО-
				514	; * ДИФИЦИРОВАННОЕ' (06) И 'ЗАПИСАТЬ' (01) СОВМЕСТНО С ПРИКАЗА-
				515	; * МИ 'НАЧАЛО ПОЛЯ'(1Д), 'УСТАНОВИТЬ КУРСОР' (11) И 'СТЕРЕТЬ
				516	; * НЕЗАЩИЩЕННОЕ ДО АДРЕСА' (0А). КОМАНДОЙ 'СТЕРЕТЬ-ЗАПИСАТЬ'
				517	; * (05) НА ЭКРАН АЦД ВЫДАЕТСЯ ПРИГЛАШЕНИЕ 'ЖДУ ТЕКСТА' И В ПА-
				518	; * РЕ С КОМАНДОЙ 'УСТАНОВИТЬ КУРСОР' ПРОИЗВОДИТСЯ ФОРМАТИРОВА-
				519	; * НИЕ ЭКРАНА.
				520	; *    ПОСЛЕ ВЫДАЧИ ПРИГЛАШЕНИЯ НАДО НАБРАТЬ С КЛАВИАТУРЫ ТЕКСТ
				521	; * И НАЖАТЬ КЛАВИШУ 'ВВОД'. ТЕКСТ СЧИТЫВАЕТСЯ В ПАМЯТЬ ЭВМ КО-
				522	; * МАНДОЙ 'СЧИТАТЬ МОДИФИЦИРОВАННОЕ' И ВЫДАЕТСЯ ОБРАТНО НА
				523	; * ЭКРАН КОМАНДОЙ 'ЗАПИСАТЬ'. СОВПАДЕНИЕ ТЕКСТОВ КОНТРОЛИРУЕТ-
				524	; * СЯ ВИЗУАЛЬНО.
				525	; *    РАБОТА ТЕСТА ЗАКАНЧИВАЕТСЯ, ЕСЛИ НАБРАНО СЛОВО 'КОНЕЦ'
				526	; * ЗАГЛАВНЫМИ БУКВАМИ. ПЕРЕМЕЩЕНИЕ КУРСОРА ВЫПОЛНЯЕТСЯ ПРИКА-
				527	; * ЗАМИ 'УСТАНОВИТЬ КУРСОР' И 'СТЕРЕТЬ НЕЗАЩИЩЕННОЕ ДО АДРЕСА',
				528	; * ГДЕ АДРЕС - ЭТО АДРЕС КОНЦА СТРОКИ ВВОДА.			    
				529	; *
				530	; *			РЕГИСТРЫ:
				531	; *	И10 - СЧЕТЧИК СТРОК ПРИ ЧТЕНИИ
				532	; *	И11 - ЧИСЛО СИМВОЛОВ В СТРОКЕ
				533	; *	И12 - ЧИСЛО СТРОК ЭКРАНА
				534	
00 0000405 00 010 0001423	535		СЧ	РЕЖИМ		;ПРОВЕРКА НА БЛОКИРОВКУ
	   00 011 0001164	536		ЛУ	БТАЦД3Б		;   3-Й ЧАСТИ
00 0000406 00 051 0000732	537		УН	ВЫХТ
	   00 010 0001415	538		СЧ	ЗАПРОС
00 0000407 00 015 0001170	539		ЛС	МАСКНОМ
	   00 012 0001170	540		СР	МАСКНОМ
00 0000410 00 000 0001415	541		ЗЧ	ЗАПРОС
	   00 010 0001674	542		СЧ	НВУ
00 0000411 00 077026 1722	543		СД	1024-46
	   00 015 0001415	544		ЛС	ЗАПРОС		;ЗАНЕСЕНИЕ НОМЕРА ВУ(АЦД)
00 0000412 00 000 0001415	545		ЗЧ	ЗАПРОС		;   В СТЕК 'ЗАПРОС'
	   14 074 3777751	546		ПА	-23,12		;ЧИСЛО СТРОК ЭКРАНА
00 0000413 03 041 0000414	547		ИН	ДВАЭКР,3
	   14 074 3777721	548		ПА	-47,12		;БУФРГ = 48 СТРОК (ДВА ЭКРАНА)
00 0000414 06 074 0000003	549	ДВАЭКР	ПА	3,6		;НОМЕР ЧАСТИ ТЕСТА
	   00 110 0000001	550		СЧЛ	1
00 0000415 00 000 0001420	551		ЗЧ	ФЛКОБ		;НЕТ РЕАКЦИИ НА КОН. ОБМЕНА ОТ ВУ
				552	
				553	; *			ФОРМАТИРОВАНИЕ ЭКРАНА
				554	
	   11 074 0000000	555		ПА	,9
00 0000416 00 010 0000000	556		СЧ
	   00 072 0000000
00 0000417 16 031 0000747	557	ФОРМАТ	ПВ	АДРЕС,14	;ФОРМИРУЕМ АДРЕСА СТРОК
	   00 072 0000000
00 0000420 00 077026 1740	558	ФОРАДР	СД	1024-32
	   03 015 0001202	559		ЛС	СУЗНП8,3	;ПРИКАЗ НА ФОРМАТИРОВАНИЕ
00 0000421 00 077026 2020	560		СД	1024+16
	   00 000 0001425	561		ЗЧ	БУФ+1
00 0000422 03 041 0000430	562		ИН	ФОРАД,3 ;РЕЖИМ ЕС 7970 ИЛИ ЕС 7920?
	   00 010 0001214	563		СЧ	ЗСООБ1		;ЗАГОЛОВОК СООБЩЕНИЯ
00 0000423 00 077026 2070	564		СД	1024+56
	   00 000 0001424	565		ЗЧ	БУФ
КАС2.01/19.06.89/ Файл ACDN : Лист 11. Дата 08.07.89 (00:18)


Тг   Адрес Код:8		Строка	Текст

00 0000424 00 010 0001212	566		СЧ	ЗБЛОК1		;ЗАГОЛОВОК БЛОКА
	   00 077026 1770	567		СД	1024-8
00 0000425 00 015 0001424	568		ЛС	БУФ
	   00 000 0001424	569		ЗЧ	БУФ
00 0000426 13 074 3777762	570		ПА	-14,11		;В СТРОКЕ 15 СИМВОЛОВ
	   02 074 0001424	571		ПА	БУФ,2		;ДЛЯ П/П
00 0000427 10 074 0000070	572		ПА	56,8		;  ДАЙСИМ
	   00 030 0000432	573		ПБ	ГОТФОРМ
00 0000430 13 074 3777773	574	ФОРАД	ПА	-5,11		;ЧИСЛО СИМВОЛОВ В СТРОКЕ
	   02 074 0001425	575		ПА	БУФ+1,2		;ДЛЯ П/П
00 0000431 10 074 0000060	576		ПА	48,8		;  ДАЙСИМ
	   00 072 0000000
00 0000432 05 074 3777777	577	ГОТФОРМ ПА	-1,5
	   00 072 0000000
00 0000433 05 010 0001366	578	ЦЗКОП6	СЧ	АЦД-4,5
	   00 115 0000777	579		ЛСЛ	0777
00 0000434 00 112 0000777	580		СРЛ	0777
	   11 015 0001251	581		ЛС	СТРЗПС,9	;КОД ОПЕРАЦИИ СТРЗПС ИЛИ ЗПС
00 0000435 05 000 0001366	582		ЗЧ	АЦД-4,5		;   В ДИАГРАММУ
	   05 033 0000433	583		КЦ	ЦЗКОП6,5
00 0000436 11 074 0000001	584		ПА	1,9
	   17 074 0001373	585		ПА	АЦД+1,15
00 0000437 15 074 3777771	586		ПА	-7,13
	   16 031 0001047	587		ПВ	ДИАГР,14	;НАЧАЛЬНАЯ ВЫБОРКА
00 0000440 16 031 0001016	588	ЗАПФС	ПВ	ДАЙСИМ,14	;СИМВОЛ ИЗ БУФЕРА
	   00 072 0000000
00 0000441 05 074 3777777	589	ЗФС	ПА	-1,5		;  В ДИАГРАММУ
	   00 072 0000000
00 0000442 05 010 0001361	590	ЦЗДАН4	СЧ	ИНФ+1,5
	   00 115 0000777	591		ЛСЛ	0777
00 0000443 00 112 0000777	592		СРЛ	0777
	   00 015 0001675	593		ЛС	СИМВОЛ
00 0000444 05 000 0001361	594		ЗЧ	ИНФ+1,5		;КОД СИМВОЛА В ДИАГРАММУ
	   05 033 0000442	595		КЦ	ЦЗДАН4,5
00 0000445 17 074 0001363	596		ПА	ИНФ+3,15
	   15 074 3777776	597		ПА	-2,13
00 0000446 16 031 0001047	598		ПВ	ДИАГР,14	;ЗАПИСЬ СТРОКИ
	   00 072 0000000
00 0000447 13 033 0000440	599	СТРЗ	КЦ	ЗАПФС,11
	   17 074 0001360	600		ПА	ИНФ,15
00 0000450 15 074 3777772	601		ПА	-6,13
	   16 031 0001047	602		ПВ	ДИАГР,14	;ЗАВЕРШЕНИЕ ОБМЕНА
00 0000451 00 010 0001701	603	ЗАВОБМ	СЧ	НАЧПОЗ
	   00 113 0000120	604		ЦСЛ	80
00 0000452 14 033 0000417	605		КЦ	ФОРМАТ,12	;ЗАВЕРШЕНИЕ ФОРМАТИРОВАНИЯ
				606	
	   00 072 0000000
00 0000453 05 074 0001233	607	ППРИГ	ПА	ПРИГ,5		;ПРИГЛАШЕНИЕ В КОИ-8
	   03 040 0000455	608		ИР	ЗАППРИГ,3
00 0000454 05 074 0001235	609		ПА	ПРИГ1,5		;  И В ДКОИ
	   00 072 0000000
00 0000455 05 010 0000000	610	ЗАППРИГ СЧ	,5
	   00 000 0001426	611		ЗЧ	БУФ+2
00 0000456 05 010 0000001	612		СЧ	1,5		;ЗАПИСЬ ПРИГЛАШЕНИЯ
	   00 000 0001427	613		ЗЧ	БУФ+3		;  В БУФЕР
00 0000457 03 010 0001204	614		СЧ	СУЗУАБ8,3	;ЗАГОЛОВОК ПОТОКА ДАННЫХ
	   00 077026 2040	615		СД	1024+32
00 0000460 03 015 0001231	616		ЛС	АДРПРИГ,3
	   00 000 0001425	617		ЗЧ	БУФ+1		;ШАПКА ЗАПИСИ
00 0000461 03 010 0001210	618		СЧ	УАБУК8,3
	   00 077026 2020	619		СД	1024+16
00 0000462 00 015 0001427	620		ЛС	БУФ+3
КАС2.01/19.06.89/ Файл ACDN : Лист 12. Дата 08.07.89 (00:18)


Тг   Адрес Код:8		Строка	Текст

	   00 000 0001427	621		ЗЧ	БУФ+3		;УСТАНОВКА КУРСОРА ПЕРЕД ЧТЕНИЕМ
00 0000463 03 041 0000471	622		ИН	ЗПРИГ,3		;РЕЖИМ ЕС 7970 ИЛИ ЕС 7920?
	   00 010 0001214	623		СЧ	ЗСООБ1		;ЗАГОЛОВОК СООБЩЕНИЯ
00 0000464 00 077026 2010	624		СД	1024+8
	   00 015 0001425	625		ЛС	БУФ+1
00 0000465 00 000 0001425	626		ЗЧ	БУФ+1
	   00 010 0001212	627		СЧ	ЗБЛОК1		;ЗАГОЛОВОК БЛОКА
00 0000466 00 077026 2010	628		СД	1024+8
	   00 000 0001424	629		ЗЧ	БУФ
00 0000467 13 074 3777746	630		ПА	-26,11		;В СТРОКЕ 27 СИМВОЛОВ (ЕС 7970)
	   02 074 0001424	631		ПА	БУФ,2
00 0000470 10 074 0000050	632		ПА	40,8		;ДЛЯ П/П ДИАГР
	   00 030 0000473	633		ПБ	НВЫБ
00 0000471 13 074 3777757	634	ЗПРИГ	ПА	-17,11		;В СТРОКЕ 18 СИМВОЛОВ (ЕС 7920)
	   02 074 0001425	635		ПА	БУФ+1,2
00 0000472 10 074 0000040	636		ПА	32,8
	   00 072 0000000
00 0000473 17 074 0001373	637	НВЫБ	ПА	АЦД+1,15
	   15 074 3777771	638		ПА	-7,13
00 0000474 16 031 0001047	639		ПВ	ДИАГР,14	;НАЧАЛЬНАЯ ВЫБОРКА
	   00 072 0000000
00 0000475 16 031 0001016	640	ВЫДПРИГ ПВ	ДАЙСИМ,14
	   00 072 0000000
00 0000476 05 074 3777777	641	ВДСИМ	ПА	-1,5
	   00 072 0000000
00 0000477 05 010 0001361	642	ЦЗДАН5	СЧ	ИНФ+1,5
	   00 115 0000777	643		ЛСЛ	0777
00 0000500 00 112 0000777	644		СРЛ	0777
	   00 015 0001675	645		ЛС	СИМВОЛ
00 0000501 05 000 0001361	646		ЗЧ	ИНФ+1,5		;КОД СИМВОЛА В ДИАГРАММУ
	   05 033 0000477	647		КЦ	ЦЗДАН5,5
00 0000502 17 074 0001363	648		ПА	ИНФ+3,15
	   15 074 3777776	649		ПА	-2,13		;ВЫДАЧА ПРИГЛАШЕНИЯ
00 0000503 16 031 0001047	650		ПВ	ДИАГР,14	;  'ЖДУ ТЕКСТА'
	   00 072 0000000
00 0000504 13 033 0000475	651	ЦПРИГ	КЦ	ВЫДПРИГ,11	;ЦИКЛ ВЫДАЧИ ПРИГЛАШЕНИЯ
	   17 074 0001360	652		ПА	ИНФ,15
00 0000505 15 074 3777772	653		ПА	-6,13
	   16 031 0001047	654		ПВ	ДИАГР,14	;ЗАВЕРШЕНИЕ ОБМЕНА
				655	
				656	; *	      ОЖИДАНИЕ ЗАПРОСА НА ОБСЛУЖИВАНИЕ ОТ АЦД
				657	
00 0000506 12 074 3777420	658	ЦТАЦД3	ПА	-240,10
	   00 072 0000000
00 0000507 12 064 0002004	659	РОСПБ	ЗН	БУФ+240,10	;РОСПИСЬ БУФЕРА НУЛЕМ
	   12 033 0000507	660		КЦ	РОСПБ,10
00 0000510 01 010 0001223	661		СЧ	Е1ПОМК,1	;РАЗРЕШЕНИЕ ПРЕРЫВАНИЙ
	   00 077006 0046	662		ЗР	046		;  1ПОМК! В ГРМ
00 0000511 00 077052 0011	663		ИВ	011
	   00 015 0001176	664		ЛС	РВП		;РАЗРЕШЕНИЕ ВНЕШНЕГО
00 0000512 00 077050 0011	665		ИУ	011		;  ПРЕРЫВАНИЯ В ИС1
	   00 072 0000000
00 0000513 00 077006 0024	666	ЖДУ2	ЗР	024		;ГАШУ СКП
	   00 030 0000513	667		ПБ	ЖДУ2		;ОЖИДАНИЕ ПРЕРЫВАНИЯ ОТ ВУ
00 0000514 17 074 0001415	668	СИГН	ПА	ЗАПРОС,15
	   15 074 3777774	669		ПА	-4,13
00 0000515 16 031 0001054	670		ПВ	ДИАГ,14		;ВЫБОРКА ОТ АБОНЕНТА
	   00 072 0000000
				671	
				672	; *			ЧТЕНИЕ ИНФОРМАЦИИ
				673	
00 0000516 05 074 3777777	674	ЗАПКОД	ПА	-1,5
КАС2.01/19.06.89/ Файл ACDN : Лист 13. Дата 08.07.89 (00:18)


Тг   Адрес Код:8		Строка	Текст

	   12 074 0000001	675		ПА	1,10
00 0000517 05 010 0001366	676	ЦЗКОП7	СЧ	АЦД-4,5
	   00 115 0000777	677		ЛСЛ	0777
00 0000520 00 112 0000777	678		СРЛ	0777
	   00 015 0001250	679		ЛС	СЧТМ		;КОД ОПЕРАЦИИ СЧТМ
00 0000521 05 000 0001366	680		ЗЧ	АЦД-4,5		;   В ДИАГРАММУ
	   05 033 0000517	681		КЦ	ЦЗКОП7,5
00 0000522 17 074 0001373	682		ПА	АЦД+1,15
	   15 074 3777771	683		ПА	-7,13
00 0000523 16 031 0001047	684		ПВ	ДИАГР,14	;НАЧАЛЬНАЯ ВЫБОРКА ДЛЯ СЧТМ
	   00 072 0000000
00 0000524 00 064 0001703	685	НАЧВ	ЗН	ЗАГЧИТ
	   00 064 0001704	686		ЗН	ЗАГЧИТ+1
00 0000525 11 074 3777776	687		ПА	-2,9		;ДЛЯ ЧТЕНИЯ <ИВ><АК1><АК2>
	   02 074 0001704	688		ПА	ЗАГЧИТ+1,2
00 0000526 10 074 0000030	689		ПА	24,8		;ДЛЯ П/П ДАЙСИМ
	   07 074 0000001	690		ПА	1,7
00 0000527 13 074 0000000	691		ПА	,11
	   03 041 0000532	692		ИН	ЧИТЗАГ,3	;РЕЖИМ?
00 0000530 11 074 3777765	693		ПА	-11,9		;ДЛЯ ЧТЕНИЯ ЗАГОЛОВКОВ
	   02 074 0001703	694		ПА	ЗАГЧИТ,2
00 0000531 10 074 0000060	695		ПА	48,8		;ДЛЯ П/П ДАЙСИМ
	   00 072 0000000
00 0000532 17 074 0001402	696	ЧИТЗАГ	ПА	ЧТЕНИЕ+1,15
	   15 074 3777776	697		ПА	-2,13
00 0000533 00 064 0001420	698		ЗН	ФЛКОБ		;КОНЕЦ ОБМЕНА ПО УПР-А
	   16 031 0001047	699		ПВ	ДИАГР,14
00 0000534 00 010 0001707	700	СЧЗАГ	СЧ	СИГНАЛЫ
	   00 111 0000377	701		ЛУЛ	0377
00 0000535 16 031 0000765	702		ПВ	ЧИТЗПС,14	;АДРЕС КУРСОРА В ЗАГЧИТ
	   00 072 0000000
00 0000536 11 033 0000532	703		КЦ	ЧИТЗАГ,9	;ЧТЕНИЕ ЗАГОЛОВКА
	   13 074 0000000	704		ПА	,11		;СЧЕТЧИК СИМВОЛОВ ПРИ ЧТЕНИИ
00 0000537 02 074 0001426	705		ПА	БУФ+2,2		;АДРЕС БУФЕРА
	   10 074 0000100	706		ПА	64,8		;СДВИГ ПО БУФЕРУ
00 0000540 11 074 3777661	707		ПА	-79,9		;СЧЕТЧИК СИМВОЛОВ В СТРОКЕ
	   00 072 0000000
00 0000541 17 074 0001402	708	ЧИТМ	ПА	ЧТЕНИЕ+1,15
	   15 074 3777776	709		ПА	-2,13
00 0000542 16 031 0001047	710		ПВ	ДИАГР,14	;ЧТЕНИЕ ОЧЕРЕДНОГО СИМВОЛА
	   00 072 0000000
00 0000543 00 010 0001707	711	ЧТОЧС	СЧ	СИГНАЛЫ
	   00 111 0000377	712		ЛУЛ	0377
00 0000544 00 012 0001206	713		СР	УАБ		;ПРОВЕРКА НА <УАБ>
	   00 050 0000550	714		УР	ПОЛЕ
00 0000545 00 077031 0000	715		МР
	   16 031 0000765	716		ПВ	ЧИТЗПС,14	;ЗАПИСЬ СИМВОЛА В БУФЕР
00 0000546 13 075 3777777	717	ЗАПОЧС	СА	-1,11
	   11 075 0000001	718		СА	1,9
00 0000547 00 030 0000541	719		ПБ	ЧИТМ
	   00 072 0000000
00 0000550 11 041 0000551	720	ПОЛЕ	ИН	ЧТАДР,9
	   12 074 0000002	721		ПА	2,10
00 0000551 11 074 3777777	722	ЧТАДР	ПА	-1,9
	   00 072 0000000
00 0000552 17 074 0001402	723	ОПОЛЕ	ПА	ЧТЕНИЕ+1,15
	   15 074 3777776	724		ПА	-2,13
00 0000553 16 031 0001047	725		ПВ	ДИАГР,14	;ЧТЕНИЕ АДРЕСА НОВОЙ СТРОКИ
	   00 072 0000000
00 0000554 00 010 0001707	726	ЧТАД	СЧ	СИГНАЛЫ
	   00 111 0000377	727		ЛУЛ	0377
00 0000555 11 000 0001704	728		ЗЧ	НПОЛЕ+1,9
КАС2.01/19.06.89/ Файл ACDN : Лист 14. Дата 08.07.89 (00:18)


Тг   Адрес Код:8		Строка	Текст

	   11 033 0000552	729		КЦ	ОПОЛЕ,9		;ОБНОВЛЕНИЕ 'НПОЛЕ'
00 0000556 11 074 3777661	730		ПА	-79,9
	   12 075 3777777	731		СА	-1,10
00 0000557 12 040 0000541	732		ИР	ЧИТМ,10
	   12 045 0000563	733		ИБ	УСТУАБ,10
00 0000560 00 010 0001222	734		СЧ	СНА
	   16 031 0000765	735		ПВ	ЧИТЗПС,14	;УКАЗАНИЕ СНА - В БУФЕР
00 0000561 10 075 3777760	736	ФОРСНА	СА	-16,8		;  И СДВИГА ПО БУФЕРУ
	   10 042 0000563	737		ИБР	УСТУАБ,8
00 0000562 02 075 0000001	738		СА	1,2
	   10 075 0000100	739		СА	64,8		;КОРРЕКЦИЯ АДРЕСА БУФЕРА
00 0000563 00 010 0001206	740	УСТУАБ	СЧ	УАБ
	   16 031 0000765	741		ПВ	ЧИТЗПС,14	;УКАЗАНИЕ УАБ - В БУФЕР
00 0000564 13 075 3777775	742	ФОРУАБ	СА	-3,11		;КОРРЕКЦИЯ СЧЕТЧИКА СИМВОЛОВ
	   10 075 3777760	743		СА	-16,8		;  И СДВИГА ПО БУФЕРУ
00 0000565 10 042 0000567	744		ИБР	ФРУАБ,8
	   02 075 0000001	745		СА	1,2
00 0000566 10 075 0000100	746		СА	64,8		;КОРРЕКЦИЯ АДРЕСА БУФЕРА
	   00 072 0000000
00 0000567 12 045 0000571	747	ФРУАБ	ИБ	УСАБ,10
	   13 075 3777775	748		СА	-3,11
00 0000570 00 030 0000541	749		ПБ	ЧИТМ		;ПРОДОЛЖЕНИЕ ЧТЕНИЯ
	   00 072 0000000
00 0000571 12 074 0000000	750	УСАБ	ПА	,10
	   00 030 0000541	751		ПБ	ЧИТМ
				752	
00 0000572 07 074 0000000	753	КОНЧТ	ПА	,7
	   00 110 0000001	754		СЧЛ	1
00 0000573 00 000 0001420	755		ЗЧ	ФЛКОБ		;НЕТ КОНЦА ОБМЕНА ПО УПР-А
	   17 074 0001376	756		ПА	КЧТ,15
00 0000574 15 074 3777776	757		ПА	-2,13
	   16 031 0001047	758		ПВ	ДИАГР,14	;ЗАВЕРШЕНИЕ ЧТЕНИЯ
00 0000575 13 040 0000607	759	КОНЧ	ИР	КНЧТЕН,11
	   13 075 3777777	760		СА	-1,11
00 0000576 12 045 0000606	761		ИБ	УСУК,10
	   00 010 0001222	762		СЧ	СНА		;ЗАВЕРШЕНИЕ ПОСЛЕДНЕЙ СТРОКИ
00 0000577 16 031 0000765	763		ПВ	ЧИТЗПС,14
	   00 072 0000000
00 0000600 10 075 3777760	764	ФОРСН	СА	-16,8		;КОРРЕКЦИЯ СЧЕТЧИКА И СДВИГА
	   10 042 0000602	765		ИБР	УСУАБ,8
00 0000601 02 075 0000001	766		СА	1,2
	   10 075 0000100	767		СА	64,8		;КОРРЕКЦИЯ АДРЕСА БУФЕРА
00 0000602 00 010 0001206	768	УСУАБ	СЧ	УАБ		;АДРЕС УСТАНОВКИ КУРСОРА
	   16 031 0000765	769		ПВ	ЧИТЗПС,14
00 0000603 13 075 3777772	770	ФОРАБ	СА	-6,11
	   10 075 3777760	771		СА	-16,8		;КОРРЕКЦИЯ СЧЕТЧИКА И СДВИГА
00 0000604 10 042 0000606	772		ИБР	УСУК,8
	   02 075 0000001	773		СА	1,2
00 0000605 10 075 0000100	774		СА	64,8		;КОРРЕКЦИЯ АДРЕСА БУФЕРА
	   00 072 0000000
00 0000606 00 010 0001207	775	УСУК	СЧ	УК
	   16 031 0000765	776		ПВ	ЧИТЗПС,14	;УКАЗАНИЕ УК - В БУФЕР
				777	
				778	; *		     ЗАПИСЬ СЧИТАННОЙ ИНФОРМАЦИИ
				779	
00 0000607 05 074 3777777	780	КНЧТЕН	ПА	-1,5
	   00 072 0000000
00 0000610 05 010 0001366	781	ЦЗКОП8	СЧ	АЦД-4,5
	   00 115 0000777	782		ЛСЛ	0777
00 0000611 00 112 0000777	783		СРЛ	0777
	   00 015 0001252	784		ЛС	ЗПС		;КОД ОПЕРАЦИИ ЗПС
00 0000612 05 000 0001366	785		ЗЧ	АЦД-4,5		;   В ДИАГРАММУ
КАС2.01/19.06.89/ Файл ACDN : Лист 15. Дата 08.07.89 (00:19)


Тг   Адрес Код:8		Строка	Текст

	   05 033 0000610	786		КЦ	ЦЗКОП8,5
00 0000613 03 040 0000634	787		ИР	ЗАПИНФ,3	;ДЛЯ КОИ-8 НУЖНА ПЕРЕКОДИРОВКА
	   13 041 0000647	788		ИН	КОРАДР,11	;ЕСЛИ НЕ ПУСТОЙ ВВОД
00 0000614 02 074 0001704	789		ПА	ЗАГЧИТ+1,2
	   10 074 0000020	790		ПА	16,8		;ДЛЯ П/П ДАЙСИМ
00 0000615 16 031 0001016	791		ПВ	ДАЙСИМ,14	;ЗА СТ. БАЙТОМ АДРЕСА
	   00 072 0000000
00 0000616 00 111 0000077	792	БАЙТ1Д	ЛУЛ	077
	   00 077026 1772	793		СД	1024-6
00 0000617 00 000 0001703	794		ЗЧ	НПОЛЕ
	   16 031 0001016	795		ПВ	ДАЙСИМ,14	;ЗА МЛ. БАЙТОМ АДРЕСА
00 0000620 00 111 0000077	796	БАЙТ2Д	ЛУЛ	077
	   00 013 0001703	797		ЦС	НПОЛЕ
00 0000621 00 113 0000120	798		ЦСЛ	80
	   16 031 0000747	799		ПВ	АДРЕС,14	;НА ПЕРЕКОДИРОВКУ
00 0000622 00 077026 1770	800	ГОТАДР	СД	1024-8
	   00 015 0001207	801		ЛС	УК
00 0000623 00 077026 1750	802		СД	1024-24
	   03 015 0001204	803		ЛС	СУЗУАБ8,3
00 0000624 00 077026 2030	804		СД	1024+24
	   00 000 0001425	805		ЗЧ	БУФ+1		;ФОРМИРУЕМ ПРИКАЗ НА ПУСТ. ВВОД
00 0000625 02 074 0001425	806		ПА	БУФ+1,2
	   10 074 0000050	807		ПА	40,8		;ДЛЯ П/П ДАЙСИМ
00 0000626 13 074 3777774	808		ПА	-4,11		;В СТРОКЕ 5 СИМВОЛОВ
	   03 041 0000665	809		ИН	ГОТЗАП,3	;РЕЖИМ?
00 0000627 00 010 0001214	810		СЧ	ЗСООБ1		;ЗАГОЛОВОК СООБЩЕНИЯ
	   00 015 0001425	811		ЛС	БУФ+1
00 0000630 00 000 0001425	812		ЗЧ	БУФ+1
	   00 010 0001212	813		СЧ	ЗБЛОК1		;ЗАГОЛОВОК БЛОКА
00 0000631 00 000 0001424	814		ЗЧ	БУФ
	   02 074 0001424	815		ПА	БУФ,2
00 0000632 10 074 0000060	816		ПА	48,8		;ДЛЯ П/П ДАЙСИМ
	   13 074 3777763	817		ПА	-13,11		;В СТРОКЕ 14 СИМВОЛОВ
00 0000633 00 030 0000665	818		ПБ	ГОТЗАП
				819	
	   00 072 0000000
00 0000634 13 041 0000643	820	ЗАПИНФ	ИН	КОРАД,11	;ЕСЛИ НЕ ПУСТОЙ ВВОД
	   02 074 0001704	821		ПА	ЗАГЧИТ+1,2
00 0000635 10 074 0000040	822		ПА	32,8
	   16 031 0001016	823		ПВ	ДАЙСИМ,14
00 0000636 00 111 0000377	824	БАЙТ18	ЛУЛ	0377		;1-Й БАЙТ АДРЕСА В КОИ-8
	   16 031 0001034	825		ПВ	КОД6,14		;НА ПЕРЕКОДИРОВКУ ИЗ КОИ-8
00 0000637 00 077026 1772	826	Б18	СД	1024-6		;  В 6-БИТОВЫЙ КОД
	   00 000 0001703	827		ЗЧ	НПОЛЕ
00 0000640 16 031 0001016	828		ПВ	ДАЙСИМ,14
	   00 072 0000000
00 0000641 00 111 0000377	829	БАЙТ28	ЛУЛ	0377		;2-Й БАЙТ АДРЕСА В КОИ-8
	   16 031 0001034	830		ПВ	КОД6,14		;ЗА АДРЕСОМ В 6-БИТ. КОДЕ
00 0000642 00 013 0001703	831	Б28	ЦС	НПОЛЕ		;БИТОВЫЙ АДРЕС СФОРМИРОВАН
	   00 030 0000621	832		ПБ	ГОТАДР-1
				833	
00 0000643 00 010 0001703	834	КОРАД	СЧ	НПОЛЕ
	   16 031 0001034	835		ПВ	КОД6,14		;ЗА 1-М БАЙТОМ В 6-БИТ.КОДЕ
00 0000644 00 077026 1772	836	БАЙТ16Б СД	1024-6
	   00 000 0001703	837		ЗЧ	НПОЛЕ
00 0000645 00 010 0001704	838		СЧ	НПОЛЕ+1
	   16 031 0001034	839		ПВ	КОД6,14		;ЗА 2-М БАЙТОМ В 6-БИТ.КОДЕ
00 0000646 00 030 0000652	840	БАЙТ26Б ПБ	ОБРИНФ-2	;НА ФОРМ. ДВОИЧНОГО АДРЕСА
				841	
	   00 072 0000000
00 0000647 00 010 0001703	842	КОРАДР	СЧ	НПОЛЕ
	   00 111 0000077	843		ЛУЛ	077
КАС2.01/19.06.89/ Файл ACDN : Лист 16. Дата 08.07.89 (00:19)


Тг   Адрес Код:8		Строка	Текст

00 0000650 00 077026 1772	844		СД	1024-6
	   00 000 0001703	845		ЗЧ	НПОЛЕ
00 0000651 00 010 0001704	846		СЧ	НПОЛЕ+1
	   00 111 0000077	847		ЛУЛ	077
00 0000652 00 013 0001703	848		ЦС	НПОЛЕ
	   00 113 0000120	849		ЦСЛ	80
00 0000653 16 031 0000747	850		ПВ	АДРЕС,14	;АДРЕС ЗАПИСИ НА ЭКРАН
	   00 072 0000000
00 0000654 03 010 0001204	851	ОБРИНФ	СЧ	СУЗУАБ8,3	;ЗАГОЛОВОК ПОТОКА ДАННЫХ
	   00 077026 2040	852		СД	1024+32
00 0000655 00 015 0001702	853		ЛС	АДР
	   00 000 0001425	854		ЗЧ	БУФ+1		;ЗАПИСЬ ЗАГОЛОВКА В БУФЕР
00 0000656 13 075 3777775	855		СА	-3,11		;ЧИСЛО ВЫДАВАЕМЫХ СИМВОЛОВ
	   02 074 0001425	856		ПА	БУФ+1,2
00 0000657 10 074 0000040	857		ПА	32,8		;АДРЕС ВЫДАЧИ ДЛЯ П/П ДАЙСИМ
	   03 041 0000665	858		ИН	ГОТЗАП,3	;РЕЖИМ ЕС 7970 ИЛИ ЕС 7920?
00 0000660 00 010 0001214	859		СЧ	ЗСООБ1		;ЗАГОЛОВОК СООБЩЕНИЯ
	   00 077026 2010	860		СД	1024+8
00 0000661 00 015 0001425	861		ЛС	БУФ+1
	   00 000 0001425	862		ЗЧ	БУФ+1
00 0000662 00 010 0001212	863		СЧ	ЗБЛОК1		;ЗАГОЛОВОК БЛОКА
	   00 077026 2010	864		СД	1024+8
00 0000663 00 000 0001424	865		ЗЧ	БУФ
	   02 074 0001424	866		ПА	БУФ,2
00 0000664 10 074 0000050	867		ПА	40,8		;ДЛЯ П/П ДАЙСИМ
	   13 075 3777767	868		СА	-9,11		;ЧИСЛО ВЫДАВАЕМЫХ СИМВОЛОВ
00 0000665 00 077001 0000	869	ГОТЗАП	ВТ
	   00 072 0000000
00 0000666 11 074 3777643	870		ПА	-93,9
	   17 074 0001373	871		ПА	АЦД+1,15
00 0000667 15 074 3777771	872		ПА	-7,13
	   16 031 0001047	873		ПВ	ДИАГР,14	;НАЧАЛЬНАЯ ВЫБОРКА
00 0000670 16 031 0001016	874	ВЫДИНФ	ПВ	ДАЙСИМ,14
	   00 072 0000000
00 0000671 11 075 0000001	875	ПРОВ	СА	1,9
	   11 040 0000674	876		ИР	ИНДЕКСЫ,9
00 0000672 00 111 0000377	877		ЛУЛ	0377
	   00 012 0001222	878		СР	СНА		;ПРОВЕРКА НА КОНЕЦ СТРОКИ
00 0000673 00 051 0000717	879		УН	ЗАПИСЬ
				880	
	   00 072 0000000
00 0000674 00 077042 0002	881	ИНДЕКСЫ ВИ	2
	   00 000 0001705	882		ЗЧ	ИНД2
00 0000675 00 077042 0010	883		ВИ	8
	   00 000 0001706	884		ЗЧ	ИНД8
00 0000676 11 041 0000701	885		ИН	КОРСТР,9
	   00 010 0001701	886		СЧ	НАЧПОЗ
00 0000677 00 113 0000117	887		ЦСЛ	79
	   00 000 0001701	888		ЗЧ	НАЧПОЗ
00 0000700 11 074 3777656	889		ПА	-82,9
	   00 030 0000710	890		ПБ	ОБНО
00 0000701 11 074 3777653	891	КОРСТР	ПА	-85,9
	   00 010 0001701	892		СЧ	НАЧПОЗ
00 0000702 00 113 0000117	893		ЦСЛ	79
	   16 031 0000747	894		ПВ	АДРЕС,14	;АДРЕС ДЛЯ СНА
00 0000703 00 077026 2010	895	АДРСНА	СД	1024+8
	   16 031 0000765	896		ПВ	ЧИТЗПС,14	;СТ.БАЙТ АДРЕСА - В БУФЕР
00 0000704 00 010 0001702	897	АДРСН	СЧ	АДР
	   00 111 0000377	898		ЛУЛ	0377
00 0000705 16 031 0000765	899		ПВ	ЧИТЗПС,14	;МЛ.БАЙТ АДРЕСА - В БУФЕР
	   00 072 0000000
00 0000706 10 075 3777770	900	ОБНОВП	СА	-8,8
КАС2.01/19.06.89/ Файл ACDN : Лист 17. Дата 08.07.89 (00:19)


Тг   Адрес Код:8		Строка	Текст

	   10 042 0000710	901		ИБР	ОБНО,8
00 0000707 02 075 0000001	902		СА	1,2
	   10 075 0000100	903		СА	64,8		;КОРРЕКЦИЯ СЧЕТЧИКА И АДРЕСА
00 0000710 00 010 0001701	904	ОБНО	СЧ	НАЧПОЗ
	   00 113 0000001	905		ЦСЛ	1
00 0000711 16 031 0000747	906		ПВ	АДРЕС,14	;ОБНОВЛЕНИЕ АДРЕСА СТРОКИ
	   00 072 0000000
00 0000712 00 077026 2010	907	АДРМАС	СД	1024+8
	   16 031 0000765	908		ПВ	ЧИТЗПС,14	;СТ. БАЙТ АДРЕСА
00 0000713 00 010 0001702	909	АДРМА	СЧ	АДР
	   00 111 0000377	910		ЛУЛ	0377
00 0000714 16 031 0000765	911		ПВ	ЧИТЗПС,14	;МЛ. БАЙТ АДРЕСА
	   00 072 0000000
00 0000715 00 010 0001705	912	ОБНОВ	СЧ	ИНД2
	   00 077040 0002	913		УИ	2
00 0000716 00 010 0001706	914		СЧ	ИНД8
	   00 077040 0010	915		УИ	8
00 0000717 05 074 3777777	916	ЗАПИСЬ	ПА	-1,5
	   00 072 0000000
00 0000720 05 010 0001361	917	ЦЗДАН7	СЧ	ИНФ+1,5
	   00 115 0000777	918		ЛСЛ	0777
00 0000721 00 112 0000777	919		СРЛ	0777
	   00 015 0001675	920		ЛС	СИМВОЛ
00 0000722 05 000 0001361	921		ЗЧ	ИНФ+1,5		;КОД СИМВОЛА В ДИАГРАММУ
	   05 033 0000720	922		КЦ	ЦЗДАН7,5
00 0000723 17 074 0001363	923		ПА	ИНФ+3,15
	   15 074 3777776	924		ПА	-2,13
00 0000724 16 031 0001047	925		ПВ	ДИАГР,14	;ВЫДАЧА СИМВОЛА
	   00 072 0000000
00 0000725 13 033 0000670	926	ВСИМВ	КЦ	ВЫДИНФ,11
	   17 074 0001360	927		ПА	ИНФ,15
00 0000726 15 074 3777772	928		ПА	-6,13
	   16 031 0001047	929		ПВ	ДИАГР,14	;ВЫДАЧА ЭКРАНА
				930	
				931	; *			АНАЛИЗ НА ТЕКСТ 'КОНЕЦ'
				932	
00 0000727 00 010 0001426	933	АНАЛИЗ	СЧ	БУФ+2
	   00 011 0001165	934		ЛУ	ПЕ40
00 0000730 03 012 0001227	935		СР	ТКОН,3
	   00 050 0000732	936		УР	ВЫХТ		;КОНЕЦ РАБОТЫ
				937	
00 0000731 00 030 0000506	938		ПБ	ЦТАЦД3
				939	
				940	; *		  ВОССТАНОВЛЕНИЕ ВРЕМЕННЫХ ДИАГРАММ
				941	
	   00 072 0000000
00 0000732 05 074 3777777	942	ВЫХТ	ПА	-1,5		;ОБНУЛИМ РАЗРЯДЫ НВУ И СИМВОЛА
	   00 072 0000000
00 0000733 05 010 0001361	943	ЦЗДАН8	СЧ	ИНФ+1,5
	   00 115 0000777	944		ЛСЛ	0777
00 0000734 00 112 0000777	945		СРЛ	0777
	   05 000 0001361	946		ЗЧ	ИНФ+1,5
00 0000735 05 033 0000733	947		КЦ	ЦЗДАН8,5
	   13 074 3777776	948		ПА	-2,11
00 0000736 13 010 0001372	949	ГАШНВУ	СЧ	АЦД,11
	   00 115 0000777	950		ЛСЛ	0777
00 0000737 00 112 0000777	951		СРЛ	0777
	   13 000 0001372	952		ЗЧ	АЦД,11	
00 0000740 13 033 0000736	953		КЦ	ГАШНВУ,11
	   00 010 0001367	954		СЧ	АЦД-3
00 0000741 00 015 0001170	955		ЛС	МАСКНОМ
	   00 012 0001170	956		СР	МАСКНОМ
КАС2.01/19.06.89/ Файл ACDN : Лист 18. Дата 08.07.89 (00:19)


Тг   Адрес Код:8		Строка	Текст

00 0000742 00 000 0001367	957		ЗЧ	АЦД-3
	   05 074 3777777	958		ПА	-1,5
00 0000743 05 010 0001366	959	ЦЗКОП9	СЧ	АЦД-4,5		;ГАШУ РАЗРЯДЫ КОДА
	   00 115 0000777	960		ЛСЛ	0777
00 0000744 00 112 0000777	961		СРЛ	0777
	   05 000 0001366	962		ЗЧ	АЦД-4,5
00 0000745 05 033 0000743	963		КЦ	ЦЗКОП9,5
	   00 110 0000000	964		СЧЛ	0
00 0000746 01 077006 0070	965		ЗР	070,1		;ОБНУЛЕНИЕ КАНАЛА
	   00 030 0000040	966		ПБ	СТП		;ТЕСТ ВЫПОЛНЕН
				967	
				968	; *		  ПОДПРОГРАММЫ ПРОГРАММЫ ТЕСТА
				969	
   0000747			970	АДРЕС
				971	; *		 П/П ФОРМИРОВАНИЯ АДРЕСОВ ЗАПИСИ
				972	
00 0000747 00 000 0001701	973		ЗЧ	НАЧПОЗ
	   00 077042 0016	974		ВИ	14
00 0000750 00 000 0001710	975		ЗЧ	ОБЛСОХР
	   00 010 0001701	976		СЧ	НАЧПОЗ
00 0000751 00 077026 2006	977		СД	1024+6		;СТ.РР.АДРЕСА
	   03 040 0000754	978		ИР	КОИ8,3
00 0000752 16 031 0001026	979		ПВ	ВДКОИ6,14	;ЗА СТ. БАЙТОМ АДРЕСА В ДКОИ
	   00 072 0000000
00 0000753 00 030 0000755	980	СТБА	ПБ	СТБАЙТ
	   00 072 0000000
00 0000754 16 031 0001031	981	КОИ8	ПВ	ВКОИ86,14	;ЗА СТ. БАЙТОМ АДРЕСА В КОИ-8
	   00 072 0000000
00 0000755 00 077026 1770	982	СТБАЙТ	СД	1024-8
	   00 000 0001702	983		ЗЧ	АДР
00 0000756 00 010 0001701	984		СЧ	НАЧПОЗ
	   00 111 0000077	985		ЛУЛ	077		;МЛ.РР АДРЕСА
00 0000757 03 040 0000761	986		ИР	КОИ81,3
	   16 031 0001026	987		ПВ	ВДКОИ6,14	;ЗА МЛ. БАЙТОМ АДРЕСА В ДКОИ
00 0000760 00 030 0000762	988	МБАЙТ	ПБ	МЛБАЙТ
	   00 072 0000000
00 0000761 16 031 0001031	989	КОИ81	ПВ	ВКОИ86,14	;ЗА МЛ. БАЙТОМ АДРЕСА В КОИ-8
	   00 072 0000000
00 0000762 00 015 0001702	990	МЛБАЙТ	ЛС	АДР
	   00 000 0001702	991		ЗЧ	АДР
00 0000763 00 010 0001710	992		СЧ	ОБЛСОХР
	   00 077040 0016	993		УИ	14
00 0000764 00 010 0001702	994		СЧ	АДР
	   16 030 0000000	995		ПБ	,14
				996	
   0000765			997	ЧИТЗПС
				998	; *	     П/П ЗАПИСИ В БУФЕР СИМВОЛА, СЧИТАННОГО
				999	; *			    ИЗ КАНАЛА
				1000	; *	ПРИ ПЕРВОМ ОБРАЩЕНИИ УСТАНОВИТЬ:
				1001	; *		И2  = НАЧАЛЬНЫЙ АДРЕС БУФЕРА
				1002	; *		И8  = НАЧАЛЬНЫЙ СДВИГ (СТАНДАРТНЫЙ 64(105)
				1003	; *	ДАЛЕЕ П/П ЧИТЗПС КОРРЕКТИРУЕТ СДВИГ И ТЕКУЩИЙ АДРЕС БУ-
				1004	; * ФЕРА, А ТАКЖЕ СЧЕТЧИК СИМВОЛОВ САМА.
				1005	; *	ВОЗВРАТ ПО И16(8)
				1006	
00 0000765 10 041 0000767	1007		ИН	ЧИТЗП,8
	   02 075 0000001	1008		СА	1,2
00 0000766 10 074 0000100	1009		ПА	64,8		;НОВОЕ СЛОВО БУФЕРА
	   00 072 0000000
00 0000767 10 075 3777770	1010	ЧИТЗП	СА	-8,8		;КОРРЕКТИРОВКА СДВИГА
	   10 077036 2000	1011		ОД	1024,8
00 0000770 02 013 0000000	1012		ЦС	,2
КАС2.01/19.06.89/ Файл ACDN : Лист 19. Дата 08.07.89 (00:19)


Тг   Адрес Код:8		Строка	Текст

	   02 000 0000000	1013		ЗЧ	,2		;ЗАПИСЬ СИМВОЛА В БУФЕР
00 0000771 16 030 0000000	1014		ПБ	,14
				1015	
	   00 072 0000000
   0000772			1016	ГЕНМАС
				1017	; *	      П/П ГЕНЕРАЦИИ ИСХОДНОГО МАССИВА СИМВОЛОВ
				1018	; *			ВОЗВРАТ ПО И16
				1019	
00 0000772 05 074 0001426	1020		ПА	БУФ+2,5		;АДРЕС ЗАПИСИ
	   03 040 0000776	1021		ИР	ГЕНМ,3		;ПРОВЕРИМ НА ТИП КОД-КИ
00 0000773 02 074 0001254	1022		ПА	ТДКОИ,2		;АДРЕС ЧТЕНИЯ
	   00 076 0000021	1023		УГ	021		;ЛГ=1, ИС10=17
00 0000774 02 150 0000001	1024		СЧК	1,2		;ПЕРЕПИСЬ В ГРУППО-
	   05 140 0000001	1025		ЗЧК	1,5		;  ВОМ РЕЖИМЕ
00 0000775 16 030 0000000	1026		ПБ	,14
	   00 072 0000000
00 0000776 02 074 0001275	1027	ГЕНМ	ПА	ТКОИ8,2		;АДРЕС ЧТЕНИЯ
	   00 076 0000024	1028		УГ	024		;ЛГ=1, ИС10=20
00 0000777 02 150 0000001	1029		СЧК	1,2		;ПЕРЕПИСЬ В ГРУППОВОМ
	   05 140 0000001	1030		ЗЧК	1,5		;  РЕЖИМЕ
00 0001000 16 030 0000000	1031		ПБ	,14
				1032	
	   00 072 0000000
   0001001			1033	КОСОЙТ
				1034	
				1035	; *	     П/П ПРЕОБРАЗОВАНИЯ МАССИВА 'КОСЫМ' ТЕСТОМ
				1036	; *			ВОЗВРАТ ПО И16
				1037	
00 0001001 00 010 0001426	1038		СЧ	БУФ+2		;1-Й СИМВОЛ 1-ГО СЛОВА
	   00 077026 1770	1039		СД	1024-8
00 0001002 00 000 0001426	1040		ЗЧ	БУФ+2
	   00 077031 0000	1041		МР
00 0001003 00 000 0001675	1042		ЗЧ	СИМВОЛ		;1-Й СИМВОЛ СТАНЕТ ПОСЛЕДНИМ
	   02 074 0001426	1043		ПА	БУФ+2,2		;И2=НАЧАЛО МАССИВА СИМВОЛОВ
00 0001004 05 074 3777756	1044		ПА	-18,5		;ДЛЯ КОИ-8 ЦИКЛ НА 19
	   03 040 0001006	1045		ИР	КСТЕСТ,3
00 0001005 05 074 3777761	1046		ПА	-15,5		;ДЛЯ ДКОИ ЦИКЛ НА 16
	   00 072 0000000
00 0001006 02 010 0000001	1047	КСТЕСТ	СЧ	1,2		;1-Й СИМВОЛ ОЧЕРЕДНОГО
	   00 077026 1770	1048		СД	1024-8		;  СЛОВА
00 0001007 02 000 0000001	1049		ЗЧ	1,2
	   00 077031 0000	1050		МР
00 0001010 02 015 0000000	1051		ЛС	,2		;ДОБАВИМ В ПРЕДЫДУЩЕЕ
	   02 000 0000000	1052		ЗЧ	,2
00 0001011 02 075 0000001	1053		СА	1,2		;ОЧЕРЕДНОЕ СЛОВО
	   05 033 0001006	1054		КЦ	КСТЕСТ,5	;ЦИКЛ 'СКАШИВАНИЯ'
00 0001012 03 040 0001014	1055		ИР	ПОСЛО,3		;ЕСЛИ КОИ-8 - НЕ ДОДВИГАЕМ
	   00 010 0001675	1056		СЧ	СИМВОЛ		;ДОДВИЖКА В СЛУЧАЕ ДКОИ
00 0001013 00 077026 1760	1057		СД	1024-16
	   00 000 0001675	1058		ЗЧ	СИМВОЛ
00 0001014 02 010 0000000	1059	ПОСЛО	СЧ	,2		;ФОРМИРУЕМ ПОСЛЕДНЕЕ СЛОВО
	   00 015 0001675	1060		ЛС	СИМВОЛ
00 0001015 02 000 0000000	1061		ЗЧ	,2
	   16 030 0000000	1062		ПБ	,14
				1063	
   0001016			1064	ДАЙСИМ
				1065	; *		    П/П ВЫДАЧИ СИМВОЛА ИЗ БУФЕРА
				1066	; *	ПРИ ПЕРВОМ ОБРАЩЕНИИ УСТАНОВИТЬ:
				1067	; *		И2 = НАЧ. АДРЕС БУФЕРА
				1068	; *		И8 = 64(10)
				1069	; *	ДАЛЕЕ П/П ДАЙСИМ КОРРЕКТИРУЕТ СДВИГ И ТЕКУЩИЙ АДРЕС БУ-
				1070	; * ФЕРА САМА
КАС2.01/19.06.89/ Файл ACDN : Лист 20. Дата 08.07.89 (00:19)


Тг   Адрес Код:8		Строка	Текст

				1071	; *	ВОЗВРАТ ПО И16.
				1072	
00 0001016 10 041 0001020	1073		ИН	ДАЙСИ,8		;СЛОВО БУФЕРА НЕ ИСЧЕРПАНО
	   02 075 0000001	1074		СА	1,2		;ПЕРЕХОД К ОЧЕРЕДНОМУ СЛОВУ
00 0001017 10 074 0000100	1075		ПА	64,8
	   00 072 0000000
00 0001020 10 075 3777770	1076	ДАЙСИ	СА	-8,8		;КОРРЕКТИРУЕМ СДВИГ
	   02 010 0000000	1077		СЧ	,2		;ВЫДЕЛИМ ОЧЕРЕДНОЙ СИМВОЛ
00 0001021 10 077026 2000	1078		СД	1024,8
	   00 111 0000377	1079		ЛУЛ	0377
00 0001022 00 000 0001675	1080		ЗЧ	СИМВОЛ
	   00 022 0000000	1081		ВЧ
00 0001023 00 111 0000001	1082		ЛУЛ	1
	   00 112 0000001	1083		СРЛ	1
00 0001024 00 077026 1770	1084		СД	1024-8
	   00 015 0001675	1085		ЛС	СИМВОЛ		;ДОПОЛНИМ ДО НЕЧЕТА
00 0001025 00 000 0001675	1086		ЗЧ	СИМВОЛ
	   16 030 0000000	1087		ПБ	,14
				1088	
   0001026			1089	ВДКОИ6
				1090	; *	П/П ПЕРЕКОДИРОВКИ ИЗ 6-БИТОВОГО КОДА В СИМВОЛ ДКОИ
				1091	; *
				1092	; *   ПРИ ВХОДЕ:
				1093	; *		6-1РР. СМ - ПЕРЕКОДИРУЕМЫЙ КОД
				1094	; *	ВОЗВРАТ ПО И16
				1095	; *   ПРИ ВЫХОДЕ:
				1096	; *		8-1РР. СМ - СИМВОЛ ДКОИ
				1097	
00 0001026 00 077026 2003	1098		СД	1024+3
	   00 077040 0005	1099		УИ	5		;АДРЕС СЛОВА В ТАБЛИЦЕ
00 0001027 05 010 0001321	1100		СЧ	ДКОИ6,5
	   00 077076 2000	1101		РД	1024
00 0001030 00 077026 2070	1102		СД	1024+56
	   16 030 0000000	1103		ПБ	,14
				1104	
   0001031			1105	ВКОИ86
				1106	; *
				1107	; *	П/П ПЕРЕКОДИРОВКИ ИЗ 6-БИТОВОГО КОДА В СИМВОЛ КОИ-8
				1108	; *
				1109	; *   ПРИ ВХОДЕ:
				1110	; *		6-1РР. СМ - ПЕРЕКОДИРУЕМЫЙ КОД
				1111	; *	ВОЗВРАТ ПО И16
				1112	; *   ПРИ ВЫХОДЕ:
				1113	; *		8-1РР. СМ - СИМВОЛ КОИ-8
				1114	
00 0001031 00 077026 2003	1115		СД	1024+3
	   00 077040 0005	1116		УИ	5		;АДРЕС СЛОВА В ТАБЛИЦЕ
00 0001032 05 010 0001331	1117		СЧ	КОИ86,5
	   00 077076 2000	1118		РД	1024
00 0001033 00 077026 2070	1119		СД	1024+56
	   16 030 0000000	1120		ПБ	,14
				1121	
   0001034			1122	КОД6
				1123	; *
				1124	; *	П/П ПЕРЕКОДИРОВКИ ИЗ СИМВОЛА КОИ-8 В 6-БИТОВЫЙ КОД
				1125	; *
				1126	; *   ПРИ ВХОДЕ:
				1127	; *		8-1РР. СМ - СИМВОЛ КОИ-8
				1128	; *	ВОЗВРАТ ПО И16
				1129	; *   ПРИ ВЫХОДЕ:
				1130	; *		6-1РР. СМ - ДВОИЧНЫЙ КОД
00 0001034 00 012 0000174	1131		СР	0174		;ПРОВЕРКА НА КОД '7С'
КАС2.01/19.06.89/ Файл ACDN : Лист 21. Дата 08.07.89 (00:19)


Тг   Адрес Код:8		Строка	Текст

	   00 051 0001036	1132		УН	ПЕРЕК
00 0001035 00 110 0000034	1133		СЧЛ	034		;ЗАМЕНА НА КОД '1С'
	   00 030 0001037	1134		ПБ	СПЕЦК
00 0001036 00 077031 0000	1135	ПЕРЕК	МР
	   00 072 0000000
00 0001037 00 111 0000077	1136	СПЕЦК	ЛУЛ	077
	   00 077026 2003	1137		СД	1024+3
00 0001040 00 077040 0005	1138		УИ	5		;АДРЕС СЛОВА В ТАБЛИЦЕ
	   05 010 0001341	1139		СЧ	БИТКОИ8,5
00 0001041 00 077076 2000	1140		РД	1024
	   00 077026 2070	1141		СД	1024+56		;НА СМ - ИСКОМЫЙ КОД
00 0001042 16 030 0000000	1142		ПБ	,14
				1143	
	   00 072 0000000
   0001043			1144	ОТРВН
				1145	; *
				1146	; *		П/П ОТРАБОТКИ СИГНАЛА 'ВНИМАНИЕ'
				1147	; *
				1148	; *	П/П  АНАЛИЗИРУЕТ  СИГНАЛЫ  ВУ И, ЕСЛИ  ПОСТУПИЛ	 СИГНАЛ
				1149	; * ТРБ-А, ВЫПОЛНЯЕТСЯ ПРИЕМ БАЙТА СОСТОЯНИЯ.
				1150	; *	ВОЗВРАТ ПО И14.
				1151	
00 0001043 01 077002 0070	1152		ЧР	070,1
	   00 011 0001174	1153		ЛУ	ТРБА
00 0001044 00 012 0001174	1154		СР	ТРБА
	   16 051 0000000	1155		УН	,14
00 0001045 17 074 0001411	1156		ПА	ЗАПРОС1+1,15
	   07 074 0000001	1157		ПА	1,7
00 0001046 15 074 3777774	1158		ПА	-4,13
	   00 030 0001047	1159		ПБ	ДИАГР
				1160	
   0001047			1161	ДИАГР
				1162	; *
				1163	; *		П/П ОТРАБОТКИ ВРЕМЕННОЙ ДИАГРАММЫ
				1164	; *
				1165	; *	 ПРИ ВХОДЕ:
				1166	; * И15 - НАЧ. АДРЕС ВРЕМЕННОЙ ДИАГРАММЫ + 1 (АДРЕС СТЕКА ВРЕ-
				1167	
				1168	; *	  МЕННОЙ ДИАГРАММЫ)
				1169	; * И13 - ЧИСЛО ОТРАБАТЫВАЕМЫХ СЛОВ
				1170	; * И1	- НОМЕР У-КАНАЛА
				1171	; * И7	- ПРИЗНАК ЗАПИСИ/ЧТЕНИЯ (0/1)
				1172	; *   ВОЗВРАТ ПО И14
				1173	; *
				1174	; *	ИСПОЛЬЗУЕМЫЕ РЕГИСТРЫ:
				1175	; *		И5  - ПАРАМЕТР ЦИКЛА ВЫДЕРЖКИ ВРЕМЕНИ
				1176	
00 0001047 17 010 0000000	1177		СЧ	,15		;СИГНАЛЫ КАНАЛА
	   01 077006 0070	1178		ЗР	070,1
00 0001050 00 112 0777777	1179		СРЛ	0777777
	   00 111 0777777	1180		ЛУЛ	0777777
00 0001051 00 000 0001676	1181		ЗЧ	ОТВЕТ		;ИНВЕРСИЯ ВЫДАЧИ В КАНАЛ
	   01 077002 0074	1182		ЧР	074,1		;КОНТРОЛЬНОЕ ЧТЕНИЕ
00 0001052 00 012 0001676	1183		СР	ОТВЕТ		;СРАВНИМ С ЗАПИСАННЫМ
	   00 050 0001054	1184		УР	ДИАГ
				1185	
				1186	; *			      СТОП 100
				1187	; *		ИСКАЖЕНО СОДЕРЖИМОЕ ВЫХОДНОГО РЕГИСТРА
				1188	; *	ИНДИКАЦИЯ:
				1189	; *		  СМ - КОД НЕСРАВНЕНИЯ
				1190	; *	ОСТАНОВ НЕ ПРОТАЛКИВАЕТСЯ
				1191	
КАС2.01/19.06.89/ Файл ACDN : Лист 22. Дата 08.07.89 (00:19)


Тг   Адрес Код:8		Строка	Текст

00 0001053 00 077007 0100	1192	СТП100	ОСТ	64
	   00 030 0001053	1193		ПБ	СТП100
				1194	
00 0001054 17 075 0000001	1195	ДИАГ	СА	1,15
	   17 010 0000000	1196		СЧ	,15
00 0001055 00 121 0777777	1197		РБЛ	0777777
	   00 000 0001676	1198		ЗЧ	ОТВЕТ		;ОЖИДАЕМЫЕ СИГНАЛЫ ВУ
00 0001056 00 112 0777777	1199		СРЛ	0777777
	   00 030 0001102	1200		ПБ	ЗАПЛАТА
00 0001057 15 033 0001047	1201	ЦДИАГР	КЦ	ДИАГР,13	;ПРОДОЛЖИМ ДИАГРАММУ
	   16 030 0000000	1202		ПБ	,14
00 0001060 00 072 0077000	1203	ЖДУОТВ	ПФ	077000
	   05 074 0000000	1204		ПА	,5
00 0001061 01 077002 0070	1205	ЖДУ	ЧР	070,1		;СИГНАЛЫ ОТ ВУ
	   00 000 0001707	1206		ЗЧ	СИГНАЛЫ
00 0001062 07 011 0001166	1207		ЛУ	Е1П17,7		;И7=0 - ЗАПИСЬ, 1 - ЧТЕНИЕ
	   00 012 0001676	1208		СР	ОТВЕТ		;СРАВНИМ С ОЖИДАЕМЫМИ
00 0001063 00 050 0001057	1209		УР	ЦДИАГР
	   01 077002 0070	1210		ЧР	070,1
00 0001064 00 011 0001173	1211		ЛУ	ВБРА
	   00 012 0001173	1212		СР	ВБРА
00 0001065 00 050 0001105	1213		УР	ВБРАБ		;НЕ НАЙДЕН АЦД
	   01 077002 0070	1214		ЧР	070,1
00 0001066 00 011 0001175	1215		ЛУ	УПРЗАН
	   00 012 0001175	1216		СР	УПРЗАН
00 0001067 00 050 0001113	1217		УР	ЗАНЯТО		;ЗАНЯТ АЦД (ГУУ)
	   01 077002 0070	1218		ЧР	070,1
00 0001070 00 011 0001161	1219		ЛУ	СБВУ
	   00 012 0001161	1220		СР	СБВУ
00 0001071 00 050 0001115	1221		УР	СБОЙ		;СБОЙ В УСТРОЙСТВЕ
	   01 077002 0070	1222		ЧР	070,1
00 0001072 00 011 0001171	1223		ЛУ	РУПРА
	   00 012 0001171	1224		СР	РУПРА		;ПРОВЕРИМ НА УПРА
00 0001073 00 050 0001143	1225		УР	СВУК
	   00 072 0000000
00 0001074 05 033 0001100	1226	ЖДУ3	КЦ	ЦОЖД,5		;ПРОДОЛЖАЕМ ЖДАТЬ
				1227	
				1228	; *			   СТОП 200
				1229	; *		     НЕТ ОЖИДАЕМЫХ СИГНАЛОВ ВУ
				1230	; *	ИНДИКАЦИЯ:
				1231	; *		  ВР  - ОЖИДАЕМЫЕ СИГНАЛЫ ВУ
				1232	; *		  РМР - ПРИШЕДШИЕ СИГНАЛЫ
				1233	; *		  СМ  - КОД НЕСРАВНЕНИЯ
				1234	; *		  И5  - НОМЕР ВУ
				1235	; *	ОСТАНОВ НЕ ПРОТАЛКИВАЕТСЯ
				1236	
	   00 010 0001674	1237		СЧ	НВУ
00 0001075 00 077040 0005	1238		УИ	5
	   00 010 0001707	1239		СЧ	СИГНАЛЫ
00 0001076 00 012 0001676	1240		СР	ОТВЕТ
	   00 072 0000000
00 0001077 05 077007 0200	1241	СТП200	ОСТ	128,5
	   00 030 0001077	1242		ПБ	СТП200
				1243	
00 0001100 00 073 0000000	1244	ЦОЖД	ИК
	   00 041 0000000	1245		ИН
00 0001101 00 030 0001061	1246		ПБ	ЖДУ		;ВЫДЕРЖКА ВРЕМЕНИ
				1247	
	   00 072 0000000
00 0001102 05 074 0000000	1248	ЗАПЛАТА ПА	,5
	   00 051 0001060	1249		УН	ЖДУОТВ
00 0001103 00 076 0100000	1250		УГ	0100000
КАС2.01/19.06.89/ Файл ACDN : Лист 23. Дата 08.07.89 (00:19)


Тг   Адрес Код:8		Строка	Текст

	   05 150 0000000	1251		СЧК	0,5
00 0001104 00 030 0001057	1252		ПБ	ЦДИАГР
				1253	
	   00 072 0000000
00 0001105 00 077042 0016	1254	ВБРАБ	ВИ	14
	   00 000 0001710	1255		ЗЧ	ОБЛСОХР
00 0001106 15 074 3777777	1256		ПА	-1,13
	   07 074 0000000	1257		ПА	,7
00 0001107 17 074 0001404	1258		ПА	ДВБР+1,15
	   16 031 0001047	1259		ПВ	ДИАГР,14	;ОКОНЧАНИЕ ПРИ ВБР-А
00 0001110 00 010 0001421	1260	ОКОН	СЧ	ФЛРЕЖ
	   00 051 0000401	1261		УН	СЛАЦД
				1262	; *			СТОП 201
				1263	; *		НОМЕР АЦД НЕ ОПОЗНАН 
				1264	; * ИНДИКАЦИЯ:	НА СМ - НОМЕР ВУ
				1265	; * ОСТАНОВ НЕ ПРОТАЛКИВАЕТСЯ
00 0001111 00 010 0001674	1266	СТП201	СЧ	НВУ
	   05 077007 0201	1267		ОСТ	129,5
00 0001112 00 030 0001111	1268		ПБ	СТП201
				1269	
	   00 072 0000000
00 0001113 15 074 3777777	1270	ЗАНЯТО	ПА	-1,13
	   07 074 0000000	1271		ПА	,7
00 0001114 17 074 0001404	1272		ПА	ДВБР+1,15
	   00 030 0001047	1273		ПБ	ДИАГР		;ОКОНЧАНИЕ ПРИ ЗНТ
				1274	
00 0001115 00 077042 0016	1275	СБОЙ	ВИ	14
	   00 000 0001710	1276		ЗЧ	ОБЛСОХР		;СОХРАНЕНИЕ АДРЕСА ВОЗВРАТА
00 0001116 07 074 0000000	1277		ПА	,7
	   15 074 3777777	1278		ПА	-1,13
00 0001117 17 074 0001353	1279		ПА	КОБМ,15
	   16 031 0001047	1280		ПВ	ДИАГР,14	;ОКОНЧАНИЕ СБОЙНОЙ ОПЕРАЦИИ
00 0001120 05 074 3777777	1281	ОКОП	ПА	-1,5
	   00 072 0000000
00 0001121 05 010 0001366	1282	ЦЗКОП10 СЧ	АЦД-4,5
	   00 115 0000777	1283		ЛСЛ	0777
00 0001122 00 112 0000777	1284		СРЛ	0777
	   00 015 0001253	1285		ЛС	УТЧН
00 0001123 05 000 0001366	1286		ЗЧ	АЦД-4,5		;КОП УТЧН - В ДИАГРАММУ
	   05 033 0001121	1287		КЦ	ЦЗКОП10,5
00 0001124 16 031 0001043	1288		ПВ	ОТРВН,14	;ПРОВЕРКА НА 'ВНИМАНИЕ'
	   00 072 0000000
00 0001125 15 074 3777772	1289	ВНИМ5	ПА	-6,13
	   17 074 0001373	1290		ПА	АЦД+1,15
00 0001126 07 074 0000000	1291		ПА	,7
	   16 031 0001047	1292		ПВ	ДИАГР,14	;НАЧАЛЬНАЯ ВЫБОРКА ДЛЯ УТЧН
00 0001127 07 074 0000001	1293	НАЧВУ	ПА	1,7
	   15 074 3777776	1294		ПА	-2,13
00 0001130 17 074 0001402	1295		ПА	ЧТЕНИЕ+1,15
	   16 031 0001047	1296		ПВ	ДИАГР,14	;ЗА Б. УТОЧНЕННОГО СОСТОЯНИЯ
00 0001131 00 010 0001707	1297	БСОСТ	СЧ	СИГНАЛЫ
	   00 000 0001711	1298		ЗЧ	СОСТ
00 0001132 07 074 0000000	1299		ПА	,7
	   17 074 0001377	1300		ПА	КЧТ+1,15
00 0001133 15 074 3777775	1301		ПА	-3,13
	   16 031 0001047	1302		ПВ	ДИАГР,14	;ОКОНЧАНИЕ ОПЕРАЦИИ УТЧН
00 0001134 00 010 0001710	1303	АДРВОЗ	СЧ	ОБЛСОХР
	   00 077040 0016	1304		УИ	14		;ВОССТАНОВЛЕНИЕ АДРЕСА ВОЗВРАТА
00 0001135 00 010 0001421	1305		СЧ	ФЛРЕЖ
	   00 050 0001137	1306		УР	СТП300		;ЕСЛИ ПОЛНЫЙ ТЕСТ
00 0001136 00 010 0001417	1307		СЧ	ФЛСЧТ
	   00 050 0000401	1308		УР	СЛАЦД
КАС2.01/19.06.89/ Файл ACDN : Лист 24. Дата 08.07.89 (00:20)


Тг   Адрес Код:8		Строка	Текст

				1309	
				1310	; *			  СТОП 300
				1311	; *		ВЫДАЧА БАЙТА УТОЧНЕННОГО СОСТОЯНИЯ
				1312	; * ИНДИКАЦИЯ:
				1313	; *	      И5 - НОМЕР ВУ
				1314	; *	      СМ - БАЙТ УТОЧНЕННОГО СОСТОЯНИЯ
				1315	; * ПРИ ПРОТАЛКИВАНИИ - ПЕРЕХОД К ТЕСТИРОВАНИЮ СЛЕДУЮЩЕГО АЦД
				1316	
00 0001137 00 010 0001674	1317	СТП300	СЧ	НВУ
	   00 077040 0005	1318		УИ	5
00 0001140 00 010 0001711	1319		СЧ	СОСТ
	   00 111 0000377	1320		ЛУЛ	0377
00 0001141 05 077007 0300	1321		ОСТ	192,5
	   00 010 0001421	1322		СЧ	ФЛРЕЖ
00 0001142 00 050 0001137	1323		УР	СТП300		;ЕСЛИ ПОЛНЫЙ ТЕСТ
	   00 030 0000401	1324		ПБ	СЛАЦД		;ЕСЛИ ЦИКЛ ПО ДИСПЛЕЯМ
				1325	
00 0001143 06 075 3777775	1326	СВУК	СА	-3,6
	   06 040 0001145	1327		ИР	ВЫХОД,6
00 0001144 06 075 0000003	1328		СА	3,6		;НЕ 3-Я ЧАСТЬ
	   00 030 0001074	1329		ПБ	ЖДУ3
00 0001145 06 074 0000003	1330	ВЫХОД	ПА	3,6
	   00 010 0001420	1331		СЧ	ФЛКОБ		;ЕСЛИ 0 - КОНЕЦ ОБМЕНА
00 0001146 00 050 0000572	1332		УР	КОНЧТ		;ВОЗВРАТ В 3-Ю ЧАСТЬ
	   00 030 0001074	1333		ПБ	ЖДУ3
				1334	
   0001147			1335	ВНЕПР	.ВХОД
				1336	; *		   ОБРАБОТЧИК ВНЕШНИХ ПРЕРЫВАНИЙ
				1337	; *		    ПРИ ВХОДЕ 48-33РР. СМ - ГРВП
				1338	
00 0001147 00 000 0001700	1339		ЗЧ	ГРВП		;48-33РР. СМ В ЯЧЕЙКУ ГРВ
	   00 010 0000000	1340		СЧ
00 0001150 00 077006 0046	1341		ЗР	046		;ГАШУ РАЗРЯДЫ МАСКИ ГРВП
	   00 010 0001162	1342		СЧ	ТТ
00 0001151 00 077050 0011	1343		ИУ	011		;ЗАКРЫВАЮ ВНЕШ. ПРЕРЫВАНИЯ
	   00 010 0001700	1344		СЧ	ГРВП
00 0001152 01 011 0001223	1345		ЛУ	Е1ПОМК,1	;ПРОВЕРИМ КАНАЛ
	   00 051 0001155	1346		УН	ВЫХПР
				1347	
				1348	; *			       СТОП 2
				1349	; *		  НЕЗАПЛАНИРОВАННОЕ ВНЕШНЕЕ ПРЕРЫВАНИЕ
				1350	; *	ИНДИКАЦИЯ:
				1351	; *		  48-33РР. СМ - ГРВП
				1352	; *		  И3 - НОМЕР ЧАСТИ ТЕСТА(1-3)
				1353	; *	ОСТАНОВ НЕ ПРОТАЛКИВАЕТСЯ
				1354	
00 0001153 00 010 0001700	1355		СЧ	ГРВП		;ИНДИКАЦИЯ НА СМ
	   00 072 0000000
00 0001154 00 077007 0002	1356	СТП2	ОСТ	2
	   00 030 0001154	1357		ПБ	СТП2
				1358	
00 0001155 00 010 0001415	1359	ВЫХПР	СЧ	ЗАПРОС
	   01 077006 0070	1360		ЗР	070,1		;ОТВЕТ НА ТРБ-А
00 0001156 05 074 2000000	1361		ПА	02000000,5
	   00 010 0000000	1362		СЧ
00 0001157 00 074 0000000	1363	ЖДУПР	ПА
	   05 033 0001157	1364		КЦ	ЖДУПР,5
00 0001160 00 077006 0047	1365		ЗР	047		;НУЛЮ ГРВП
	   00 030 0000514	1366		ПБ	СИГН		;ВОЗВРАТ В 3-Ю ЧАСТЬ
				1367	
				1368	; *		    КОНСТАНТЫ И ДАННЫЕ ТЕСТА
				1369	
КАС2.01/19.06.89/ Файл ACDN : Лист 25. Дата 08.07.89 (00:20)


Тг   Адрес Код:8		Строка	Текст

00 0001161 000 000 000 000	1370	СБВУ	1<10!2		;СИГНАЛЫ УПР-А И СБУ
	   000 000 004 002
00 0001162 000 000 000 000	1371	ТТ	1<12		;ПРИЗНАК ТТ В ИС1
	   000 000 020 000
00 0001163 000 000 000 000	1372	БТАЦД1	2		;БЛОКИРОВКА 1-Й ЧАСТИ ТЕСТА
	   000 000 000 002
00 0001164 000 000 000 000	1373	БТАЦД2	1		;БЛОКИРОВКА 2-Й ЧАСТИ ТЕСТА
	   000 000 000 001
00 0001165 377 377 377 377	1374	ПЕ40	.0377.0377.0377.0377.0377...
	   377 000 000 000
00 0001166 000 000 000 000	1375	Е1П17	0377777		;МАСКИ СИГНАЛОВ АБОНЕНТА
	   000 001 377 377
00 0001167 000 000 000 000	1376		0777000
	   000 003 376 000
00 0001170 000 177 300 000	1377	МАСКНОМ 0777<46		;МАСКА НОМЕРА ВУ
	   000 000 000 000
00 0001171 000 000 000 000	1378	РУПРА	011<10		;СИГНАЛЫ УПР-А И РАБ-А
	   000 000 044 000
00 0001172 000 000 000 000	1379	РАБК	1<13		;СИГНАЛ РАБ-К
	   000 000 040 000
00 0001173 000 000 000 000	1380	ВБРА	1<14		;СИГНАЛ ВБР-А
	   000 000 100 000
00 0001174 000 000 000 000	1381	ТРБА	1<17		;СИГНАЛ ТРБ-А
	   000 002 000 000
00 0001175 000 000 000 000	1382	УПРЗАН	1<6!1<4		;СИГНАЛЫ УПР-А И ЗНТ
	   000 000 004 020
00 0001176 000 000 000 000	1383	РВП	4		;РАЗРЕШЕНО ВНЕШ. ПРЕРЫВАНИЕ В ИС1
	   000 000 000 004
00 0001177 000 000 000 000	1384	РБСБ	037477		;ДЛЯ ФОРМИРОВАНИЯ ИНФ-И К УАБ
	   000 000 077 077
00 0001200 000 000 000 000	1385	СУЗ8	0103
	   000 000 000 103
00 0001201 000 000 000 000	1386	СУЗ	0303
	   000 000 000 303
00 0001202 101 021 000 000	1387	СУЗНП8	.0101.021...035.0101..	;СУЗ,УАБ,А1,А2,НП,АТР
	   035 101 000 000
00 0001203 301 021 000 000	1388	СУЗНП	.0301.021...035.0301..	;СУЗ,УАБ,А1,А2,НП,АТР
	   035 301 000 000
00 0001204 103 021 000 000	1389	СУЗУАБ8 .0103.021...... ;<СУЗ><УАБ><А1><А2> В КОИ-8
	   000 000 000 000
00 0001205 303 021 000 000	1390	СУЗУАБ	.0303.021...... ;<СУЗ><УАБ><А1><А2>
	   000 000 000 000
00 0001206 000 000 000 000	1391	УАБ	021
	   000 000 000 021
00 0001207 000 000 000 000	1392	УК	023
	   000 000 000 023
00 0001210 021 101 112 023	1393	УАБУК8	.021.0101.0112.023....	;В КОИ-8 И В ДКОИ
	   000 000 000 000
00 0001211 021 301 321 023	1394	УАБУК	.021.0301.0321.023....	;  <УАБ><А1><А2><УК>
	   000 000 000 000
00 0001212 000 000 054 000	1395	ЗБЛОК1	054<40		;ЗАГОЛОВОК БЛОКА ДЛЯ ЗАПИСИ
	   000 000 000 000
00 0001213 000 000 054 000	1396	ЗБЛОК2	054<16!0377<24	;ЗАГОЛОВОК БЛОКА ДЛЯ ЧТЕНИЯ
	   377 000 000 000
00 0001214 003 000 000 000	1397	ЗСООБ1	03<56		;ЗАГОЛОВОК СООБЩЕНИЯ ДЛЯ ЗАПИСИ
	   000 000 000 000
00 0001215 003 000 201 000	1398	ЗСООБ2	03<16!0201<40	;ЗАГОЛОВОК СООБЩЕНИЯ ДЛЯ ЧТЕНИЯ
	   000 000 000 000
00 0001216 055 040 040 000	1399	ШАПКА18 .055.040.040.....	;<ИВ><А1><А2> В КОИ-8
	   000 000 000 000
00 0001217 140 100 100 000	1400	ШАПКА1	.0140.0100.0100.....	;<ИВ><А1><А2> В ДКОИ
	   000 000 000 000
КАС2.01/19.06.89/ Файл ACDN : Лист 26. Дата 08.07.89 (00:20)


Тг   Адрес Код:8		Строка	Текст

00 0001220 055 040 040 021	1401	ШАПКА28 .055.040.040.021....	;ШАПКА2 В КОИ-8
	   000 000 000 000
00 0001221 140 100 100 021	1402	ШАПКА2	.0140.0100.0100.021.... ;ИВ,А1,А2,УАБ,А1,А2 ДКОИ
	   000 000 000 000
00 0001222 000 000 000 000	1403	СНА	022		;СТЕРЕТЬ НЕЗАЩИЩЕННОЕ (012)
	   000 000 000 022
00 0001223 000 000 001 000	1404	Е1ПОМК	1<40			;0-Й КАНАЛ
	   000 000 000 000
00 0001224 000 000 000 200	1405		1<39			;1-Й КАНАЛ
	   000 000 000 000
00 0001225 000 000 000 100	1406		1<38			;2-Й КАНАЛ
	   000 000 000 000
00 0001226 000 000 000 040	1407		1<37			;3-Й КАНАЛ
	   000 000 000 000
00 0001227 353 357 356 345	1408	ТКОН	.0353.0357.0356.0345.0343...	;ТЕКСТ 'КОНЕЦ' В
	   343 000 000 000
00 0001230 322 326 310 305	1409		.0322.0326.0310.0305.0273...	;  КОИ-8 И ДКОИ
	   273 000 000 000
00 0001231 000 000 000 000	1410	АДРПРИГ 020101		;В КОИ-8
	   000 000 040 101
00 0001232 000 000 000 000	1411		040301		;В ДКОИ
	   000 000 100 301
00 0001233 366 344 365 040	1412	ПРИГ	.0366.0344.0365.040.0364.0345.0353.0363
	   364 345 353 363
00 0001234 364 341 000 000	1413		.0364.0341......	;ТЕКСТ ПРИГЛ. В КОИ-8
	   000 000 000 000
00 0001235 354 274 353 040	1414	ПРИГ1	.0354.0274.0353.040.0343.0305.0322.0303
	   343 305 322 303
00 0001236 343 301 000 000	1415		.0343.0301......	;ТЕКСТ ПРИГЛАШЕНИЯ В ДКОИ
	   000 000 000 000
				1416	
				1417	; *			ТАБЛИЦА НОМЕРОВ ВУ
				1418	
00 0001237 000 000 000 000	1419		.КОД	0100		;40 - СТАНДАРТНЫЙ НОМЕР ВУ
	   000 000 000 100
00 0001240 000 000 000 000	1420		0501		;41
	   000 000 001 101
00 0001241 000 000 000 000	1421		0510		;48
	   000 000 001 110
00 0001242 000 000 000 000	1422		0111		;49
	   000 000 000 111
00 0001243 000 000 000 000	1423		0520		;50
	   000 000 001 120
00 0001244 000 000 000 000	1424		0121		;51
	   000 000 000 121
00 0001245 000 000 000 000	1425		0122		;52
	   000 000 000 122
00 0001246 000 000 000 000	1426	ТНВУ	0523		;53
	   000 000 001 123
				1427	
				1428	; *		 КОДЫ КОМАНД, ДОПОЛНЕННЫЕ ДО НЕЧЕТА
				1429	
00 0001247 000 000 000 000	1430	СЧТ	2		;СЧИТАТЬ(02)
	   000 000 000 002
00 0001250 000 000 000 000	1431	СЧТМ	0406		;СЧИТАТЬ МОДИФИЦИРОВАННОЕ(06)
	   000 000 001 006
00 0001251 000 000 000 000	1432	СТРЗПС	0405		;СТЕРЕТЬ-ЗАПИСАТЬ(05)
	   000 000 001 005
00 0001252 000 000 000 000	1433	ЗПС	1		;ЗАПИСАТЬ(01) НЕ ОТДЕЛ. ОТ СТРЗПС
	   000 000 000 001
00 0001253 000 000 000 000	1434	УТЧН	4		;УТОЧНИТЬ СОСТОЯНИЕ(04)
	   000 000 000 004
КАС2.01/19.06.89/ Файл ACDN : Лист 27. Дата 08.07.89 (00:20)


Тг   Адрес Код:8		Строка	Текст

				1435	
				1436	; *			ТАБЛИЦА КОДИРОВКИ ДКОИ 
				1437	
00 0001254 301 302 303 304	1438	ТДКОИ	.0301.0302.0303.0304.0305.0306.0307.0310
	   305 306 307 310
00 0001255 311 321 322 323	1439		.0311.0321.0322.0323.0324.0325.0326.0327
	   324 325 326 327
00 0001256 330 331 342 343	1440		.0330.0331.0342.0343.0344.0345.0346.0347
	   344 345 346 347
00 0001257 350 351 272 277	1441		.0350.0351.0272.0277.0274.0354.0372.0313
	   274 354 372 313
00 0001260 314 316 334 353	1442		.0314.0316.0334.0353.0276.0273.0376.0373
	   276 273 376 373
00 0001261 375 356 357 374	1443		.0375.0356.0357.0374.0270.0335.0201.0202
	   270 335 201 202
00 0001262 203 204 205 206	1444		.0203.0204.0205.0206.0207.0210.0211.0221
	   207 210 211 221
00 0001263 222 223 224 225	1445		.0222.0223.0224.0225.0226.0227.0230.0231
	   226 227 230 231
00 0001264 242 243 244 245	1446		.0242.0243.0244.0245.0246.0247.0250.0251
	   246 247 250 251
00 0001265 170 257 215 212	1447		.0170.0257.0215.0212.0256.0262.0217.0220
	   256 262 217 220
00 0001266 233 234 235 237	1448		.0233.0234.0235.0237.0254.0214.0200.0266
	   254 214 200 266
00 0001267 263 265 260 261	1449		.0263.0265.0260.0261.0264.0166.0240.0100
	   264 166 240 100
00 0001270 120 140 141 340	1450		.0120.0140.0141.0340.0112.0132.0152.0172
	   112 132 152 172
00 0001271 113 133 153 173	1451		.0113.0133.0153.0173.0114.0134.0154.0174
	   114 134 154 174
00 0001272 115 135 155 175	1452		.0115.0135.0155.0175.0116.0136.0156.0176
	   116 136 156 176
00 0001273 117 137 157 177	1453		.0117.0137.0157.0177.0360.0361.0362.0363
	   360 361 362 363
00 0001274 364 365 366 367	1454		.0364.0365.0366.0367.0370.0371.0100.0100
	   370 371 100 100
				1455	
				1456	; *			ТАБЛИЦА КОДИРОВКИ КОИ-8
				1457	
00 0001275 040 041 042 043	1458	ТКОИ8	.040.041.042.043.044.045.046.047
	   044 045 046 047
00 0001276 050 051 052 053	1459		.050.051.052.053.054.055.056.057
	   054 055 056 057
00 0001277 060 061 062 063	1460		.060.061.062.063.064.065.066.067
	   064 065 066 067
00 0001300 070 071 072 073	1461		.070.071.072.073.074.075.076.077
	   074 075 076 077
00 0001301 133 134 135 136	1462		.0133.0134.0135.0136.0137.0173.0174.0175
	   137 173 174 175
00 0001302 176 140 244 100	1463		.0176.0140.0244.0100.0101.0102.0103.0104
	   101 102 103 104
00 0001303 105 106 107 110	1464		.0105.0106.0107.0110.0111.0112.0113.0114
	   111 112 113 114
00 0001304 115 116 117 120	1465		.0115.0116.0117.0120.0121.0122.0123.0124
	   121 122 123 124
00 0001305 125 126 127 130	1466		.0125.0126.0127.0130.0131.0132.0141.0142
	   131 132 141 142
00 0001306 143 144 145 146	1467		.0143.0144.0145.0146.0147.0150.0151.0152
	   147 150 151 152
00 0001307 153 154 155 156	1468		.0153.0154.0155.0156.0157.0160.0161.0162
	   157 160 161 162
КАС2.01/19.06.89/ Файл ACDN : Лист 28. Дата 08.07.89 (00:20)


Тг   Адрес Код:8		Строка	Текст

00 0001310 163 164 165 166	1469		.0163.0164.0165.0166.0167.0170.0171.0172
	   167 170 171 172
00 0001311 341 342 367 347	1470		.0341.0342.0367.0347.0344.0345.0366.0372
	   344 345 366 372
00 0001312 351 352 353 354	1471		.0351.0352.0353.0354.0355.0356.0357.0360
	   355 356 357 360
00 0001313 362 363 364 365	1472		.0362.0363.0364.0365.0346.0350.0343.0376
	   346 350 343 376
00 0001314 373 375 370 371	1473		.0373.0375.0370.0371.0247.0374.0340.0361
	   247 374 340 361
00 0001315 301 302 327 307	1474		.0301.0302.0327.0307.0304.0305.0326.0332
	   304 305 326 332
00 0001316 311 312 313 314	1475		.0311.0312.0313.0314.0315.0316.0317.0320
	   315 316 317 320
00 0001317 322 323 324 325	1476		.0322.0323.0324.0325.0306.0310.0303.0336
	   306 310 303 336
00 0001320 333 335 330 331	1477		.0333.0335.0330.0331.0337.0334.0300.0321
	   337 334 300 321
				1478	
				1479	; *	  ТАБЛИЦА ПЕРЕКОДИРОВКИ ИЗ 6-БИТНОГО КОДА В ДКОИ
				1480	
00 0001321 100 301 302 303	1481	ДКОИ6	.0100.0301.0302.0303.0304.0305.0306.0307
	   304 305 306 307
00 0001322 310 311 112 113	1482		.0310.0311.0112.0113.0114.0115.0116.0117
	   114 115 116 117
00 0001323 120 321 322 323	1483		.0120.0321.0322.0323.0324.0325.0326.0327
	   324 325 326 327
00 0001324 330 331 132 133	1484		.0330.0331.0132.0133.0134.0135.0136.0137
	   134 135 136 137
00 0001325 140 141 342 343	1485		.0140.0141.0342.0343.0344.0345.0346.0347
	   344 345 346 347
00 0001326 350 351 152 153	1486		.0350.0351.0152.0153.0154.0155.0156.0157
	   154 155 156 157
00 0001327 360 361 362 363	1487		.0360.0361.0362.0363.0364.0365.0366.0367
	   364 365 366 367
00 0001330 370 371 172 173	1488		.0370.0371.0172.0173.0174.0175.0176.0177
	   174 175 176 177
				1489	
				1490	; *	  ТАБЛИЦА ПЕРЕКОДИРОВКИ ИЗ 6-БИТНОГО КОДА В КОИ-8
				1491	
00 0001331 040 101 102 103	1492	КОИ86	.040.0101.0102.0103.0104.0105.0106.0107
	   104 105 106 107
00 0001332 110 111 133 056	1493		.0110.0111.0133.056.074.050.053.041
	   074 050 053 041
00 0001333 046 112 113 114	1494		.046.0112.0113.0114.0115.0116.0117.0120
	   115 116 117 120
00 0001334 121 122 135 044	1495		.0121.0122.0135.044.052.051.073.0136
	   052 051 073 136
00 0001335 055 057 123 124	1496		.055.057.0123.0124.0125.0126.0127.0130
	   125 126 127 130
00 0001336 131 132 174 054	1497		.0131.0132.0174.054.045.0137.076.077
	   045 137 076 077
00 0001337 060 061 062 063	1498		.060.061.062.063.064.065.066.067
	   064 065 066 067
00 0001340 070 071 072 043	1499		.070.071.072.043.0100.047.075.042
	   100 047 075 042
				1500	
				1501	; *	  ТАБЛИЦА ПЕРЕКОДИРОВКИ ИЗ КОИ-8 В 6-БИТНЫЙ КОД
				1502	
00 0001341 074 001 002 003	1503	БИТКОИ8 .074.01.02.03.04.05.06.07
	   004 005 006 007
00 0001342 010 011 021 022	1504		.010.011.021.022.023.024.025.026
КАС2.01/19.06.89/ Файл ACDN : Лист 29. Дата 08.07.89 (00:20)


Тг   Адрес Код:8		Строка	Текст

	   023 024 025 026
00 0001343 027 030 031 042	1505		.027.030.031.042.043.044.045.046
	   043 044 045 046
00 0001344 047 050 051 012	1506		.047.050.051.012.052.032.037.055
	   052 032 037 055
00 0001345 000 017 077 073	1507		..017.077.073.033.054.020.075
	   033 054 020 075
00 0001346 015 035 034 016	1508		.015.035.034.016.053.040.013.041
	   053 040 013 041
00 0001347 060 061 062 063	1509		.060.061.062.063.064.065.066.067
	   064 065 066 067
00 0001350 070 071 072 036	1510		.070.071.072.036.014.076.056.057
	   014 076 056 057
				1511	
				1512	; *		  ВРЕМЕННАЯ ДИАГРАММА РАБОТЫ ВУ
				1513	
				1514	;		  ЗАВЕРШЕНИЕ ОБМЕНА
00 0001351 377 377 300 000	1515		0777777<33!1<13 ;РАБ-К
	   000 000 040 000
00 0001352 000 000 000 000	1516		5<11		;0;РАБ-К,ИНФ-К
	   000 000 050 000
00 0001353 011 001 000 000	1517	КОБМ	011<8!1<35!7<13 ;РАБ-А,УПР-А,ВУК;РВБ-К,ВБР-К,РАБК
	   000 000 340 000
00 0001354 010 000 000 000	1518		1<48!035<11	;РАБ-А;РВБ-К,ВБР-К,РАБ-К,ИНФ-К
	   000 000 350 000
00 0001355 011 002 000 000	1519		011<7!1<36!7<13 ;РАБ-А,УПР-А,КК;РВБ-К,ВБР-К,РАБ-К
	   000 000 340 000
00 0001356 010 000 000 000	1520		1<49!071<10	;РАБ-А;РВБ-К,ВБР-К,РАБ-К,УПР-К
	   000 000 344 000
00 0001357 012 000 000 000	1521		5<44!7<13	;РАБ-А,ИНФ-А;РВБ-К,ВБР-К,РАБ-К
	   000 000 340 000
				1522	;		  ЗАПИСЬ БАЙТА
00 0001360 010 000 000 000	1523	ИНФ	1<48!035<11	;РАБ-А;РВБ-К,ВБР-К,РАБ-К,ИНФ-К,
	   000 000 350 000
				1524	;				   БАЙТ ДАННЫХ
00 0001361 377 377 300 000	1525		0777777<33!7<13 ;РВБ-К,ВБР-К,РАБ-К,БАЙТ ДАННЫХ
	   000 000 340 000
00 0001362 012 000 000 000	1526		5<44!7<13	;РАБ-А,ИНФ-А;РВБ-К,ВБР-К,РАБ-К
	   000 000 340 000
				1527	;		  НАЧАЛЬНАЯ ВЫБОРКА
00 0001363 010 000 000 000	1528		1<48!035<11	;РАБ-А;РВБ-К,ВБР-К,РАБ-К,ИНФ-К
	   000 000 350 000
00 0001364 011 100 000 000	1529		045<41!7<13	;РАБ-А,УПР-А,0-Й БАЙТ СОСТОЯНИЯ;
	   000 000 340 000
				1530	;					   РВБ-К,ВБР-К,РАБ-К
00 0001365 010 000 000 000	1531		1<49!071<10	;РАБ-А;РВБ-К,ВБР-К,РАБ-К,УПРК,КОП
	   000 000 344 000
00 0001366 377 377 300 000	1532		0777777<33!7<13 ;РВБ-К,ВБР-К,РАБ-К,КОП
	   000 000 340 000
00 0001367 010 200 000 000	1533		021<42!7<13	;РАБ-А,АДР-А,НВУ;РВБ-К,ВБР-К,РАБК
	   000 000 340 000
00 0001370 010 000 000 000	1534		1<50!0161<9	;РАБ-А;РВБ-К,ВБР-К,РАБ-К,АДРК,НВУ
	   000 000 342 000
00 0001371 377 377 300 000	1535		0777777<37!021<9;РАБ-К,АДР-К,НВУ
	   000 000 042 000
00 0001372 377 377 300 000	1536	АЦД	0777777<33!1<13 ;РАБ-К,НВУ
	   000 000 040 000
				1537	
				1538	; *			ДИАГРАММА ЧТЕНИЯ
				1539	
				1540	;	     ЗАВЕРШЕНИЕ ЧТЕНИЯ
00 0001373 377 377 300 000	1541		0777777<33!1<13 ;РАБ-К
КАС2.01/19.06.89/ Файл ACDN : Лист 30. Дата 08.07.89 (00:20)


Тг   Адрес Код:8		Строка	Текст

	   000 000 040 000
00 0001374 000 000 000 000	1542		5<11		;0;РАБ-К,ИНФ-К
	   000 000 050 000
00 0001375 011 103 000 000	1543		045<6!3<35!7<13 ;РАБ-А,УПРА,КК,ВУК;РВБК,ВБРК,РАБК
	   000 000 340 000
00 0001376 010 000 000 000	1544	КЧТ	1<48!035<11	;РАБ-А;РВБ-К,ВБР-К,РАБ-К,ИНФ-К	
	   000 000 350 000
				1545	;	     ЧТЕНИЕ БАЙТА
00 0001377 012 000 000 000	1546		5<44!7<13	;РАБ-А,ИНФА,Б.ДАН.;РВБК,ВБРК,РАБК
	   000 000 340 000
00 0001400 012 000 000 000	1547		5<44!7<13	;РАБ-А,ИНФ-А;РВБ-К,ВБР-К,РАБ-К
	   000 000 340 000
00 0001401 010 000 000 000	1548	ЧТЕНИЕ	1<48!035<11	;РАБ-А;РВБ-К,ВБР-К,РАБ-К,ИНФ-К
	   000 000 350 000
				1549	
				1550	; *		ДИАГРАММА ОТВЕТА НА ВБР-А ИЛИ ЗНТ
				1551	
00 0001402 377 377 300 000	1552		0777777<33!1<13 ;РАБ-К
	   000 000 040 000
00 0001403 000 000 000 000	1553	ДВБР	021<9		;0;РАБ-К,АДР-К
	   000 000 042 000
				1554	
				1555	; *		  ДИАГРАММА ВЫБОРКИ ОТ АБОНЕНТА 1
				1556	
00 0001404 377 377 300 000	1557		0777777<33!1<13 ;РАБ-К
	   000 000 040 000
00 0001405 000 000 000 000	1558		5<11		;0;РАБ-К,ИНФ-К
	   000 000 050 000
00 0001406 011 000 000 000	1559		044<41!7<13	;РАБ-А,УПР-А;РВБ-К,ВБР-К,РАБ-К
	   000 000 340 000
00 0001407 010 000 000 000	1560		1<49!071<10	;РАБ-А;РВБ-К,ВБР-К,РАБ-К,УПР-К
	   000 000 344 000
00 0001410 010 200 000 000	1561	ЗАПРОС1 021<42!7<13	;РАБ-А,АДР-А;РВБ-К,ВБР-К,РАБ-К
	   000 000 340 000
				1562	
				1563	; *		    ДИАГРАММА ВЫБОРКИ ОТ АБОНЕНТА
				1564	
00 0001411 377 377 300 000	1565		0777777<33!7<13 ;РВБ-К,ВБР-К,РАБ-К
	   000 000 340 000
00 0001412 010 000 000 000	1566		1<48!035<11	;РАБ-А;РВБ-К,ВБР-К,РАБ-К,ИНФ-К
	   000 000 350 000
00 0001413 011 040 000 000	1567		0111<40!7<13	;РАБ-А,УПР-А,БАЙТ СОСТОЯНИЯ С 
	   000 000 340 000
				1568	;			     ПРИЗНАКОМ 'ВНИМАНИЕ';РВБК,ВБРК,РАБК
00 0001414 010 000 000 000	1569		1<49!071<10	;РАБ-А;РВБ-К,ВБР-К,РАБ-К,УПР-К
	   000 000 344 000
00 0001415 010 200 000 000	1570	ЗАПРОС	021<42!7<13	;РАБ-А,АДР-А,НВУ;РВБ-К,ВБРК,РАБК
	   000 000 340 000
				1571	
00 0001416 000 000 000 000	1572	КСУМТ	0		;КОНТР. СУММА ТЕСТА
	   000 000 000 000
				1573	
				1574	; *			РАБОЧИЕ ЯЧЕЙКИ ТЕСТА
				1575	
00 0001417 000 000 000 000	1576	ФЛСЧТ	0	;ФЛАГ ПРОВЕРКИ ИНТЕРФЕЙСА
	   000 000 000 000
00 0001420 0 0 0 0 0 0 0 0	1577	ФЛКОБ	.ПАМ	1	;ФЛАГ КОНЦА ОБМЕНА (0 - СИГНАЛ РАЗРЕШЕН)
00 0001421 0 0 0 0 0 0 0 0	1578	ФЛРЕЖ	.ПАМ	1	;ФЛАГ БОЛЬШОГО/МАЛОГО ТЕСТА (0/1)
00 0001422 0 0 0 0 0 0 0 0	1579	ЯЧКС	.ПАМ	1	;РАБОЧАЯ ЯЧЕЙКА КОНТР. СУММ-Я
00 0001423 0 0 0 0 0 0 0 0	1580	РЕЖИМ	.ПАМ	1	;РЕЖИМ РАБОТЫ ТЕСТА
00 0001424 0 0 0 0 0 0 0 0	1581	БУФ	.ПАМ	0250	;БУФЕР ЗАПИСИ/ЧТЕНИЯ
00 0001674 0 0 0 0 0 0 0 0	1582	НВУ	.ПАМ	1	;НОМЕР АЦД
КАС2.01/19.06.89/ Файл ACDN : Лист 31. Дата 08.07.89 (00:20)


Тг   Адрес Код:8		Строка	Текст

00 0001675 0 0 0 0 0 0 0 0	1583	СИМВОЛ	.ПАМ	1	;ХРАНЕНИЕ КОДА ОЧЕРЕДНОГО СИМВОЛА
00 0001676 0 0 0 0 0 0 0 0	1584	ОТВЕТ	.ПАМ	1	;РАБОЧАЯ ЯЧЕЙКА П/П ДИАГР
00 0001677 0 0 0 0 0 0 0 0	1585	ГРМ	.ПАМ	1	;МАСКА ГРВП
00 0001700 0 0 0 0 0 0 0 0	1586	ГРВП	.ПАМ	1	;КОПИЯ ГРВП
00 0001701 0 0 0 0 0 0 0 0	1587	НАЧПОЗ	.ПАМ	1	;НАЧАЛЬНАЯ ПОЗИЦИЯ СТРОКИ(0-1920)
00 0001702 0 0 0 0 0 0 0 0	1588	АДР	.ПАМ	1	;АДРЕС ТЕКУЩЕЙ СТРОКИ
00 0001703 0 0 0 0 0 0 0 0	1589	НПОЛЕ	.ПАМ	2	;АДРЕС ТЕКУШЕЙ СТРОКИ ПО ЧТЕНИЮ
00 0001705 0 0 0 0 0 0 0 0	1590	ИНД2	.ПАМ	1	;ЯЧЕЙКА ДЛЯ И2
00 0001706 0 0 0 0 0 0 0 0	1591	ИНД8	.ПАМ	1	;ЯЧЕЙКА ДЛЯ И8
00 0001707 0 0 0 0 0 0 0 0	1592	СИГНАЛЫ .ПАМ	1	;СИГНАЛЫ ОТ АБОНЕНТА
00 0001710 0 0 0 0 0 0 0 0	1593	ОБЛСОХР .ПАМ	1	;РАБ. ЯЧ. АДРЕСА
00 0001711 0 0 0 0 0 0 0 0	1594	СОСТ	.ПАМ	1	;БАЙТ УТОЧНЕННОГО СОСТОЯНИЯ
				1595	
				1596	; *			  ЭКВИВАЛЕНТНОСТИ
				1597	
	  =00000001176		1598	БТАЦД1Б .ЭКВ	РВП		;БЛОКИРОВКА 1-Й Ч. БОЛЬШОГО ТЕСТА
	  =00000001163		1599	БТАЦД2Б .ЭКВ	БТАЦД1		;БЛОКИРОВКА 2-Й Ч. БОЛЬШОГО ТЕСТА
	  =00000001164		1600	БТАЦД3Б .ЭКВ	БТАЦД2		;БЛОКИРОВКА 3-Й Ч. БОЛЬШОГО ТЕСТА
	  =00000001703		1601	ЗАГЧИТ	.ЭКВ	НПОЛЕ
	  =00000777777		1602	ФПАРТ	.ЭКВ	0777777
	  =00000777776		1603	ФНКАН	.ЭКВ	0777776
	  =00000777775		1604	НКАН	.ЭКВ	0777775
	  =00000777774		1605	ФНАЦД	.ЭКВ	0777774
	  =00000777773		1606	НАЦД	.ЭКВ	0777773
	  =00000777772		1607	ФРЕЖТ	.ЭКВ	0777772
	  =00000777771		1608	РЕЖТ	.ЭКВ	0777771
	  =00000777770		1609	ФКДК	.ЭКВ	0777770
	  =00000777767		1610	ТКДК	.ЭКВ	0777767
				1611		.КНЦ			;ТЕСТА АЦПУ

Начало трансляции:	00:15:35.
Конец  трансляции:	00:20:52.
Транслировано строк:	1611.
