КАС2211 Файл OP1 : Лист 1 Дата 9.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

				1	; *********************************************************
				2	; *							  *
				3	; *	      ТЕСТ ПРОВЕРКИ ОПЕРАТИВНОЙ ПАМЯТИ		  *
				4	; *							  *
				5	; * ТЕСТ ВКЛЮЧАЕТ СЛЕДУЮЩИЕ ЧАСТИ:			  * 
				6	; *  1.ПРОВЕРКА ИНФОРМАЦИОННОЙ ЧАСТИ НАКОПИТЕЛЯ		  *
				7	; *   1.1.ПРОВЕРКА НА КОДАХ 'ВСЕ 0' И 'ВСЕ 1'		  *
				8	; *   1.2.ПРОВЕРКА ТЕСТОМ 'МАРШ'			  *
				9	; *   1.3.ПРОВЕРКА ТЕСТОМ 'ДИАГОНАЛЬ'			  *
				10	; *  2.ПРОВЕРКА РАЗРЯДОВ ХЭММИНГА			  *
				11	; *   2.1.ПРОВЕРКА ПРЯМЫМ И ОБРАТНЫМ КОДОМ		  *
				12	; *   2.2.ПРОВЕРКА ТЕСТОМ 'МАРШ'			  *
				13	; *   2.3.ПРОВЕРКА ТЕСТОМ 'ДИАГОНАЛЬ'			  *
				14	; *							  * 
				15	; * ОПИСАНИЕ АЛГОРИТМА:					  *
				16	; *  ОПИСАНИЯ АЛГОРИТМОВ ПРИВЕДЕНЫ В КАЖДОЙ ЧАСТИ ТЕСТА	  *
				17	; *							  *
				18	; * ВХОДНЫЕ ПАРАМЕТРЫ:					  *
				19	; *  ФПАР = ЧИСЛО ВХОДНЫХ ПАРАМЕТРОВ ТЕСТА/0 - НЕ ЗАДАНЫ/ *
				20	; *  ФНПР = ФЛАГ ЗАДАНИЯ НОМЕРА ПРИМЕРА/0 - 'МАРШ'/	  *
				21	; *  НПРМ = НОМЕР ПРИМЕРА ПРИ ФНПР=1			  *
				22	; *  ФБЛК = ФЛАГ ЗАДАНИЯ НОМЕРА БЛОКА/0 - ПРОВЕРКА ВСЕХ/  *
				23	; *  НБЛК = НОМЕР ПРОВЕРЯЕМОГО БЛОКА ПРИ ФБЛК = 1	  *
				24	; *  ФГРУ = ФЛАГ ЗАДАНИЯ НОМЕРА ГРУППЫ/0 - ПРОВЕРКА ВСЕХ/ *
				25	; *  НГРУ = НОМЕР ПРОВЕРЯЕМОЙ ГРУППЫ ПРИ ФГРУ=1		  *
				26	; *  ФМКС = ФЛАГ ЗАДАНИЯ НОМЕРА МКСХ/0 - ПРОВЕРКА ВСЕХ/	  *
				27	; *  НМКС = НОМЕР ПРОВЕРЯЕМОЙ МИКРОСХЕМЫ ПРИ ФМКС=1	  *
				28	; *							  *
				29	; * ОСТАНОВЫ ПРИ РАБОТЕ ТЕСТА				  *
				30	; *  СТОП 0 - ТЕСТ ВЫПОЛНЕН				  *
				31	; *  СТОП 1 - НЕ СОВПАЛА КОНТРОЛЬНАЯ СУММА ТЕСТА	  *
				32	; *  СТОП 2-37(8) - ЛОВУШКИ ПРЕРЫВАНИЙ И ЭКСТРАКОДОВ	  *
				33	; *  СТОП 40(8) - НЕ СОХРАНИЛИСЬ РЕГИСТРЫ ПРИПИСКИ	  *
				34	; * ОСТАНОВЫ В СЛУЧАЕ ОШИБОЧНЫХ СИТУАЦИЙ ОПИСАНЫ В КАЖДОМ *
				35	; * ПРИМЕРЕ ТЕСТА.					  *
				36	; * ЗДЕСЬ И ДАЛЕЕ В КОММЕНТАРИЯХ НОМЕРА ИНДЕКСНЫХ РЕГИСТ- *
				37	; * РОВ И СПЕЦИАЛЬНЫХ РЕГИСТРОВ УКАЗЫВАЮТСЯ В 8-М ВИДЕ.	  * 
				38	; *********************************************************
				39	
				40		.ОБЛ	ОП(1)
00 0000001 00 077 006 0020	41	ТОП	ЗР	020		;ПКЛ=0,ПКП=0		
	   00 030 0000041	42		ПБ	НАЧТ
				43	
				44	; *******************************************************
				45	; *							*
				46	; *	     ЛОВУШКИ ПРЕРЫВАНИЙ И ЭКСТРАКОДОВ		*
				47	; * ИНДИКАЦИЯ:						*
				48	; *  48-33РР. СМ - ГРВП ПРИ ОСТ 2			*
				49	; *  31-01РР. СМ - РР ПРИ ОСТ 4,5,6,7			*
				50	; *******************************************************
				51	
00 0000002 00 077 002 0047	52	ПВНЕ	ЧР	047
	   00 077 007 0002	53		ОСТ	02		;ВНЕШНЕЕ ПРЕРЫВАНИЕ
00 0000003 00 077 007 0003	54	ПЭР3	ОСТ	03		;ЭКСТРАКОД В РЕЖИМЕ 3
	   00 072 0000000
00 0000004 00 077 002 0037	55	ПВ12	ЧР	037
	   00 077 007 0004	56		ОСТ	04		;ВНУТРЕННЕЕ ПРЕРЫВАНИЕ В РЕЖИМЕ 1-2
00 0000005 00 077 002 0037	57	ПЗ12	ЧР	037
	   00 077 007 0005	58		ОСТ	05		;ЗАПРЕЩЕННАЯ КОМАНДА В РЕЖИМЕ 1-2
00 0000006 00 077 002 0037	59	ПВР3	ЧР	037
	   00 077 007 0006	60		ОСТ	06		;ВНУТРЕННЕЕ ПРЕРЫВАНИЕ В РЕЖИМЕ 3
00 0000007 00 077 002 0037	61	ПЗК3	ЧР	037
КАС2211 Файл OP1 : Лист 2 Дата 9.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

	   00 077 007 0007	62		ОСТ	07		;ЗАПРЕЩЕННАЯ КОМАНДА В РЕЖИМЕ 3
00 0000010 00 077 007 0010	63	ПЭ50	ОСТ	010		;ЭКСТРАКОД 50(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000011 00 077 007 0011	64	ПЭ51	ОСТ	011		;ЭКСТРАКОД 51(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000012 00 077 007 0012	65	ПЭ52	ОСТ	012		;ЭКСТРАКОД 52(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000013 00 077 007 0013	66	ПЭ53	ОСТ	013		;ЭКСТРАКОД 53(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000014 00 077 007 0014	67	ПЭ54	ОСТ	014		;ЭКСТРАКОД 54(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000015 00 077 007 0015	68	ПЭ55	ОСТ	015		;ЭКСТРАКОД 55(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000016 00 077 007 0016	69	ПЭ56	ОСТ	016		;ЭКСТРАКОД 56(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000017 00 077 007 0017	70	ПЭ57	ОСТ	017		;ЭКСТРАКОД 57(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000020 00 077 007 0020	71	ПЭ60	ОСТ	020		;ЭКСТРАКОД 60(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000021 00 077 007 0021	72	ПЭ61	ОСТ	021		;ЭКСТРАКОД 61(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000022 00 077 007 0022	73	ПЭ62	ОСТ	022		;ЭКСТРАКОД 62(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000023 00 077 007 0023	74	ПЭ63	ОСТ	023		;ЭКСТРАКОД 63(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000024 00 077 007 0024	75	ПЭ64	ОСТ	024		;ЭКСТРАКОД 64(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000025 00 077 007 0025	76	ПЭ65	ОСТ	025		;ЭКСТРАКОД 65(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000026 00 077 007 0026	77	ПЭ66	ОСТ	026		;ЭКСТРАКОД 66(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000027 00 077 007 0027	78	ПЭ67	ОСТ	027		;ЭКСТРАКОД 67(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000030 00 077 007 0030	79	ПЭ70	ОСТ	030		;ЭКСТРАКОД 70(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000031 00 077 007 0031	80	ПЭ71	ОСТ	031		;ЭКСТРАКОД 71(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000032 00 077 007 0032	81	ПЭ72	ОСТ	032		;ЭКСТРАКОД 72(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000033 00 077 007 0033	82	ПЭ73	ОСТ	033		;ЭКСТРАКОД 73(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000034 00 077 007 0034	83	ПЭ74	ОСТ	034		;ЭКСТРАКОД 74(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000035 00 077 007 0035	84	ПЭ75	ОСТ	035		;ЭКСТРАКОД 75(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000036 00 077 007 0036	85	ПЭ76	ОСТ	036		;ЭКСТРАКОД 76(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000037 00 077 007 0037	86	ПЭ77	ОСТ	037		;ЭКСТРАКОД 77(8) РЕЖИМА 1-2
				87	
	   00 072 0000000
00 0000040 17 074 0000003	88	СТП	ПА	3,15
	   17 077 007 0040	89		ОСТ	040,15		;ХОРОШИЙ ОСТАНОВ
				90	
00 0000041 00 010 0000000	91	НАЧТ	СЧ	0
	   00 077 050 0011	92		ИУ	011		;ИС1:=0
00 0000042 10 074 0000000	93		ПА	,8		;СЧ-К ПРОХОДОВ := 0
				94	
				95	; *******************************************************
				96	; *		КОНТРОЛЬНОЕ СУММИРОВАНИЕ		*
				97	; *******************************************************
				98	
	   00 064 0000626	99		ЗН	РАЯ
КАС2211 Файл OP1 : Лист 3 Дата 9.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

00 0000043 12 074 3777155	100		ПА	ТОП-КСУМТ+1,10	;И12:=ДЛИНА ТЕСТА - 1
	   00 072 0000000
00 0000044 12 060 0000624	101	КСУМ	СТ	КСУМТ-1,10
	   00 013 0000626	102		ЦС	РАЯ
00 0000045 00 000 0000626	103		ЗЧ	РАЯ		;СУММИРУЕМ ОЧЕРЕДНОЕ СЛОВ
	   12 033 0000044	104		КЦ	КСУМ,10		;КЦ КОНТРОЛЬНОГО СУММИРОВАНИЯ
00 0000046 00 012 0000625	105		СР	КСУМТ
	   00 030 0000050	106		ПБ	НАЧТ1		;УР НАЧТ1
				107	
				108	; *******************************************************
				109	; *							*
				110	; *		НЕ СОВПАЛА КОНТРОЛЬНАЯ СУММА		*
				111	; *							*
				112	; *  ВР	 - ЭТАЛОННАЯ КОНТРОЛЬНАЯ СУММА			*
				113	; *  СМ	 - КОД НЕСРАВНЕНИЯ				*
				114	; *  РМР - ПОДСЧИТАННАЯ СУММА				*
				115	; *******************************************************
				116	
00 0000047 00 077 007 0001	117		ОСТ	01
	   00 030 0000041	118		ПБ	НАЧТ		;ПОВТОР СУММИРОВАНИЯ
   0000050			119	НАЧТ1
				120	
				121	; *******************************************************
				122	; *		НАЧАЛЬНАЯ НАСТРОЙКА ТЕСТА		*
				123	; *******************************************************
				124	
00 0000050 00 010 0000621	125		СЧ	ВСЕЕД
	   00 077 006 0042	126		ЗР	042		;РАЗМЕР ЛИСТА = 256К
00 0000051 00 077 006 0051	127		ЗР	051		;ОБРАЩЕНИЕ КО ВСЕМ ЛИСТАМ ОП
	   00 010 0000000	128		СЧ	0
00 0000052 00 077 006 0052	129		ЗР	052		;НЕТ ЗАЩИТЫ ЗАПИСИ
	   00 072 0000000
   0000053			130	РОСПП
				131	
				132	; *******************************************************
				133	; *		    РОСПИСЬ ПРИПИСКИ			*
				134	; *******************************************************
				135	
00 0000053 12 074 3777741	136		ПА	-31,10		;ЦИКЛ НА 32-А РЕГИСТРА
	   00 010 0000623	137		СЧ	ПРИП
				138	
00 0000054 12 077 006 0137	139	РОСП	ЗР	0137,10		;ЗАПИСЬ В ОЧЕРЕДНОЙ РЕГИСТР
	   00 013 0000624	140		ЦС	Е41Е9
00 0000055 12 033 0000054	141		КЦ	РОСП,10		;КЦ РОСПИСИ ПРИПИСКИ
				142	
				143	; *******************************************************
				144	; *		КОНТРОЛЬ УСТАНОВКИ ПРИПИСКИ		*
				145	; *******************************************************
				146	
	   12 074 3777741	147		ПА	-31,10		;ЦИКЛ НА 32-А РЕГИСТРА
00 0000056 00 010 0000623	148		СЧ	ПРИП
				149	
	   00 072 0000000
00 0000057 00 000 0000626	150	КПРИП	ЗЧ	РАЯ
	   12 077 002 0137	151		ЧР	0137,10		;ОЧЕРЕДНОЙ РЕГИСТР(ДОЛЖНА БЫТЬ ПРАВОЙ)
00 0000060 00 077 040 0000	152		УИ	0		;ВЫДЕРЖКА
	   00 012 0000626	153		СР	РАЯ
00 0000061 00 050 0000064	154		УР	КЦПРИП		;РЕГИСТР СОХРАНИЛСЯ
				155	
				156	; *******************************************************
				157	; *							*
				158	; *		ПРИПИСКА НЕ СОХРАНИЛАСЬ			*
КАС2211 Файл OP1 : Лист 4 Дата 9.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

				159	; *							*
				160	; * ИНДИКАЦИЯ:						*
				161	; *  ВР	 - ЭТАЛОННЫЙ КОД				*
				162	; *  СМ	 - КОД НЕСРАВНЕНИЯ				*
				163	; *  РМР - СЧИТАННЫЙ КОД				*
				164	; *  И	 - НОМЕР НЕСОХРАНИВШЕГОСЯ РЕГИСТРА/И12/		*
				165	; *******************************************************
				166	
	   12 075 0000040	167		СА	32,10		;ДЛЯ ИНДИКАЦИИ
00 0000062 00 073 0000626	168		ИК	РАЯ
	   12 077 007 0040	169		ОСТ	040,10
00 0000063 00 030 0000053	170		ПБ	РОСПП		;ПОВТОР РОСПИСИ И КОНТРОЛЯ
				171	
	   00 072 0000000
00 0000064 00 010 0000626	172	КЦПРИП	СЧ	РАЯ
	   00 013 0000624	173		ЦС	Е41Е9
00 0000065 12 033 0000057	174		КЦ	КПРИП,10	;КЦ КОНТРОЛЯ УСТАНОВКИ	
				175	
				176	; *******************************************************
				177	; *		РАЗБОР ВХОДНЫХ ПАРАМЕТРОВ ТЕСТА		*
				178	; *******************************************************
				179	
	   02 074 0000000	180		ПА	,2		;БЛОК НЕ ФИКСИРОВАН
00 0000066 03 074 0000000	181		ПА	,3		;ГРУППА НЕ ФИКСИРОВАНА
	   04 074 0000000	182		ПА	,4		;МКСХ НЕ ФИКСИРОВАНА
00 0000067 05 074 0000000	183		ПА	,5		;ПРОВЕРКА НА 'МАРШЕ'
	   00 010 0777777	184		СЧ	ФПАР
00 0000070 00 077 040 0012	185		УИ	10
	   12 077 045 0012	186		СИ	10,10
00 0000071 13 074 0777776	187		ПА	ФПАР-1,11
	   12 077 046 0013	188		МИ	11,10		;АДРЕС 1-ГО НЕ ЗАДАННОГО ПАР-РА
00 0000072 00 076 0000012	189	НУЛПАР	УГ	10
	   12 174 3777777	190		ЗНК	-1,10		;ОБНУЛЕНИЕ НЕ ЗАДАННЫХ ПАР-РОВ
00 0000073 00 010 0777777	191		СЧ	ФПАР
	   00 051 0000076	192		УН	ЕПАР		;ЕСТЬ ПАРАМЕТРЫ
00 0000074 00 110 0000001	193		СЧЛ	1
	   00 000 0777775	194		ЗЧ	ЧПВТ		;ПО УМОЛЧАНИЮ 1 ПРОХОД
00 0000075 00 030 0000131	195		ПБ	ВСЕГРУ
	   00 072 0000000
00 0000076 00 077 040 0013	196	ЕПАР	УИ	11		;ЧИСЛО ПАР-РОВ
	   00 010 0777776	197		СЧ	ФПВТ
00 0000077 00 051 0000101	198		УН	НОМПРИ
	   00 110 0000001	199		СЧЛ	1
00 0000100 00 000 0777775	200		ЗЧ	ЧПВТ		;ПО УМОЛЧАНИЮ 1 ПРОХОД
	   00 072 0000000
00 0000101 13 075 3777777	201	НОМПРИ	СА	-1,11
	   13 040 0000131	202		ИР	ВСЕГРУ,11
00 0000102 00 010 0777774	203		СЧ	ФНПР
	   00 050 0000105	204		УР	НАЧТ2		;НОМЕР ПРИМЕРА НЕ ЗАДАН
00 0000103 00 010 0777773	205		СЧ	НПРМ
	   00 111 0000007	206		ЛУЛ	7
00 0000104 00 077 040 0005	207		УИ	5		;НОМЕР ВЫБРАННОГО ПРИМЕРА
	   00 072 0000000
00 0000105 13 075 3777777	208	НАЧТ2	СА	-1,11
	   13 040 0000131	209		ИР	ВСЕГРУ,11
00 0000106 00 010 0777772	210		СЧ	ФБЛК
	   00 077 040 0002	211		УИ	2		;ПРИЗНАК ФИКСАЦИИ БЛОКА
00 0000107 00 010 0777771	212		СЧ	НБЛК
	   00 111 0000003	213		ЛУЛ	3
00 0000110 00 000 0777771	214		ЗЧ	НБЛК		;НОМЕР БЛОКА
	   13 075 3777777	215		СА	-1,11
00 0000111 13 040 0000131	216		ИР	ВСЕГРУ,11
КАС2211 Файл OP1 : Лист 5 Дата 9.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

	   00 010 0777766	217		СЧ	ФМКС
00 0000112 00 077 040 0004	218		УИ	4		;ПРИЗНАК ФИКСАЦИИ МКСХ
	   00 010 0777765	219		СЧ	НМКС
00 0000113 00 111 0000007	220		ЛУЛ	7
	   00 000 0777765	221		ЗЧ	НМКС
00 0000114 13 075 3777777	222		СА	-1,11
	   13 040 0000131	223		ИР	ВСЕГРУ,11
00 0000115 00 010 0777770	224		СЧ	ФГРУ
	   00 077 040 0003	225		УИ	3		;ПРИЗНАК ФИКСАЦИИ ГРУППЫ
00 0000116 00 050 0000131	226		УР	ВСЕГРУ		;ГРУППА НЕ ЗАДАНА
	   00 010 0777767	227		СЧ	НГРУ
00 0000117 00 111 0000003	228		ЛУЛ	3
	   00 000 0777767	229		ЗЧ	НГРУ
00 0000120 00 050 0000123	230		УР	НУЛГРУ		;ПРОВЕРКА 0-Й ГРУППЫ
				231	
				232	; * ПРОВЕРКА ЗАДАННОЙ НЕНУЛЕВОЙ ГРУППЫ --------
				233	
	   07 074 0000000	234		ПА	,7		;БАЗА ТЕСТА = 0-Й ГРУППЕ
00 0000121 17 074 0000556	235		ПА	ВЫХТ,15		;ВОЗВРАТ ИЗ ПРИМЕРА
	   05 040 0000246	236		ИР	МАРШ,5		;0 - ТОЛЬКО "МАРШ"/ИНФ.РР. И РР. ХЭМ./
00 0000122 05 030 0000134	237		ПБ	ВЫБПР-1,5	;НА ВЫБОР ПРИМЕРА
	   00 072 0000000
   0000123			238	НУЛГРУ				;ПРОВЕРКА 0-Й ГРУППЫ
00 0000123 07 072 0000000	239		ПФ	,7
	   16 031 0000561	240		ПВ	ИЗ0В1,14	;ТЕСТ В 1-Ю ГРУППУ
00 0000124 07 072 0000000	241		ПФ	,7
	   17 074 0000127	242		ПА	ВНУЛГ,15	;ВОЗВРАТ ИЗ ПРИМЕРА
00 0000125 07 072 0000000	243		ПФ	,7
	   05 040 0000246	244		ИР	МАРШ,5		;0 - ТОЛЬКО "МАРШ"/ИНФ. РР. И РР. ХЭМ./
00 0000126 07 072 0000000	245		ПФ	,7
	   05 030 0000134	246		ПБ	ВЫБПР-1,5	;НА ВЫБОР ПРИМЕРА
   0000127			247	ВНУЛГ				;ПЕРЕПИСЬ ТЕСТА В НАЧАЛО И СТОП
00 0000127 07 072 0000000	248		ПФ	,7
	   16 031 0000563	249		ПВ	ИЗ1В0,14	;ТЕСТ В 0-Ю ГРУППУ
00 0000130 07 072 0000000	250		ПФ	,7
	   00 030 0000556	251		ПБ	ВЫХТ	
				252	
   0000131			253	ВСЕГРУ				;ПРОВЕРКА ПО ВСЕМ ГРУППАМ
00 0000131 17 074 0000133	254		ПА	ПНУЛГ,15	;ВОЗВРАТ ДЛЯ ПРОВЕРКИ 0-Й ГРУППЫ
	   07 074 0000000	255		ПА	,7		;БАЗА ТЕСТА = 0-Й ГРУППЕ
00 0000132 05 040 0000246	256		ИР	МАРШ,5		;0 - ТОЛЬКО "МАРШ"/ИНФ. РР. И РР. ХЭМ./
	   05 030 0000134	257		ПБ	ВЫБПР-1,5	;НА ВЫБОР ПРИМЕРА
   0000133			258	ПНУЛГ				;А ТЕПЕРЬ ПРОВЕРИМ 0-Ю ГРУППУ
00 0000133 03 074 0000001	259		ПА	1,3		;ФИКСИРУЕМ ГРУППУ
	   00 010 0000000	260		СЧ	0
00 0000134 07 000 0777767	261		ЗЧ	НГРУ,7		;0-Я ГРУППА
	   00 030 0000123	262		ПБ	НУЛГРУ
   0000135			263	ВЫБПР				;ПЕРЕКЛЮЧАТЕЛЬ ПРИМЕРОВ
00 0000135 07 072 0000000	264		ПФ	,7
	   00 030 0000144	265		ПБ	ЗППЧТП		;'ЗАПИСЬ-ЧТЕНИЕ'
00 0000136 07 072 0000000	266		ПФ	,7
	   00 030 0000246	267		ПБ	МАРШ		;'МАРШ'
00 0000137 07 072 0000000	268		ПФ	,7
	   00 030 0000417	269		ПБ	ДИАГ		;'ДИАГОНАЛЬ'
00 0000140 07 072 0000000	270		ПФ	,7
	   00 030 0000420	271		ПБ	ЗПХЧТХ		;'ЗАПИСЬ-ЧТЕНИЕ'/РАЗРЯДЫ ХЭММИНГА/
00 0000141 07 072 0000000	272		ПФ	,7
	   00 030 0000421	273		ПБ	МАРШХ		;'МАРШ'/РАЗРЯДЫ ХЭММИНГА/
00 0000142 07 072 0000000	274		ПФ	,7
	   00 030 0000555	275		ПБ	ДИАГХ		;'ДИАГОНАЛЬ'/РАЗРЯДЫ ХЭММИНГА/
				276	
00 0000143 00 077 007 7777	277		ОСТ	07777		;ЗДЕСЬ НЕ ДОЛЖНЫ БЫВАТЬ
КАС2211 Файл OP1 : Лист 6 Дата 9.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

	   00 072 0000000
   0000144			278	ЗППЧТП	 
				279	
				280	; *******************************************************
				281	; *	     ПРОВЕРКА ИНФОРМАЦИОННЫХ РАЗРЯДОВ		*
				282	; *******************************************************
				283	
				284	; *******************************************************
				285	; *							*
				286	; *	    ПРОВЕРКА ТЕСТОМ 'ЗАПИСЬ-СЧИТЫВАНИЕ'		*
				287	; *							*
				288	; * АЛГОРИТМ ПРОВЕРКИ:					*
				289	; *  КОД 'ВСЕ 0' ЗАПИСЫВАЕТСЯ ПО ВСЕМ АДРЕСАМ ПРОВЕРЯЕ- *
				290	; *  МОЙ ОБЛАСТИ. ПОСЛЕ ЭТОГО ВЫПОЛНЯЕТСЯ ЧТЕНИЕ С КОН- * 
				291	; *  ТРОЛЕМ. ПРИ НЕСОВПАДЕНИИ ПРОГРАММА ВЫЙДЕТ НА ОСТА- *
				292	; *  НОВ С АДРЕСОМ 50(8). ТА ЖЕ ПОСЛЕДОВАТЕЛЬНОСТЬ ДЕЙ- *
				293	; *  СТВИЙ ВЫПОЛНЯЕТСЯ ДЛЯ КОДА 'ВСЕ 1'.		* 
				294	; *  ПОРЯДОК ПЕРЕБОРА АДРЕСОВ СЛЕДУЮЩИЙ:		*
				295	; *   БЛОК =>ГРУППА =>МИКРОСХЕМА =>КОЛОНКА =>СТРОКА	*
				296	; *							*
				297	; * РАСПРЕДЕЛЕНИЕ РЕГИСТРОВ:				*
				298	; *  И1	 - АДРЕС ЗАПИСИ/ЧТЕНИЯ				*
				299	; *  И2	 - ПРИЗНАК ФИКСАЦИИ БЛОКА			*
				300	; *  И3	 - ПРИЗНАК ФИКСАЦИИ ГРУППЫ			*
				301	; *  И4	 - ПРИЗНАК ФИКСАЦИИ МИКРОСХЕМЫ			*
				302	; *  И11 - ПАРАМЕТР ЦИКЛА ПО БЛОКАМ			*
				303	; *  И12 - ПАРАМЕТР ЦИКЛА ПО ГРУППАМ			*
				304	; *  И13 - ПАРАМЕТР ЦИКЛА ПО МИКРОСХЕМАМ		*
				305	; *  И14 - ПАРАМЕТР ЦИКЛА ПО КОЛОНКАМ			*
				306	; *  И15 - ПАРАМЕТР ЦИКЛА ПО СТРОКАМ			*
				307	; *  И16 - ПАРАМЕТР ЦИКЛА ПО КОДАМ ПРОВЕРКИ		*
				308	; *******************************************************
				309	
00 0000144 07 072 0000000	310		ПФ	,7
	   16 031 0000575	311		ПВ	НАЧАДР,14	;И1:=НАЧ.АДРЕС ПРОВЕРКИ
00 0000145 16 074 3777777	312		ПА	-1,14		;ДВА КОДА ПРОВЕРКИ('ВСЕ 0' И 'ВСЕ 1')
	   00 010 0000000	313		СЧ	0
   0000146			314	ЦЗП
				315	
				316	; *******************************************************
				317	; *			РОСПИСЬ ОП			*
				318	; *******************************************************
				319	
00 0000146 07 000 0000627	320		ЗЧ	ЭТАЛОН,7	;ЭТАЛОННЫЙ КОД
	   11 074 3777775	321		ПА	-3,9		;СЧЕТЧИК БЛОКОВ
00 0000147 12 074 3777776	322		ПА	-2,10		;СЧЕТЧИК ГРУПП/В ОДНОЙ ИЗ ГРУПП ТЕСТ/
	   13 074 3777771	323		ПА	-7,11		;СЧЕТЧИК МКСХ
00 0000150 14 074 3777401	324		ПА	-255,12		;СЧЕТЧИК КОЛОНОК
	   15 074 3777401	325		ПА	-255,13		;СЧЕТЧИК СТРОК
				326	
   0000151			327	ЦЗ
00 0000151 07 010 0000627	328		СЧ	ЭТАЛОН,7	;ЭТАЛОННЫЙ КОД
	   01 000 0000000	329		ЗЧ	,1
00 0000152 07 072 0000000	330		ПФ	,7
	   02 041 0000156	331		ИН	ЦЗ1,2		;1 - БЛОК ФИКСИРОВАН 
00 0000153 07 072 0000000	332		ПФ	,7
	   11 033 0000177	333		КЦ	КЗБ,9		;КЦ ЗП ПО БЛОКАМ
00 0000154 00 077 042 0001	334		ВИ	1
	   00 112 0000003	335		СРЛ	3
00 0000155 00 077 040 0001	336		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА БЛОКА
	   11 074 3777775	337		ПА	-3,9		;СЧЕТЧИК БЛОКОВ
   0000156			338	ЦЗ1
КАС2211 Файл OP1 : Лист 7 Дата 9.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

00 0000156 07 072 0000000	339		ПФ	,7
	   03 041 0000163	340		ИН	ЦЗ2,3		;1 - ГРУППА ФИКСИРОВАНА
00 0000157 07 072 0000000	341		ПФ	,7
	   12 033 0000200	342		КЦ	КЗГ,10		;КЦ ЗП ПО ГРУППАМ
00 0000160 00 077 042 0001	343		ВИ	1
	   00 072 0002000	344		ПФ	02000
00 0000161 00 112 0000000	345		СРЛ
	   00 077 040 0001	346		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА ГРУППЫ
00 0000162 12 074 3777776	347		ПА	-2,10		;СЧЕТЧИК ГРУПП
	   00 072 0000000
   0000163			348	ЦЗ2
00 0000163 07 072 0000000	349		ПФ	,7
	   04 041 0000167	350		ИН	ЦЗ3,4		;1 - МКСХ ФИКСИРОВАНА
00 0000164 07 072 0000000	351		ПФ	,7
	   13 033 0000202	352		КЦ	КЗМ,11		;КЦ ЗП ПО МКСХ
00 0000165 00 077 042 0001	353		ВИ	1
	   00 112 0000034	354		СРЛ	034
00 0000166 00 077 040 0001	355		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА МКСХ
	   13 074 3777771	356		ПА	-7,11		;СЧЕТЧИК МКСХ
   0000167			357	ЦЗ3
00 0000167 07 072 0000000	358		ПФ	,7
	   14 033 0000203	359		КЦ	КЗК,12		;КЦ ЗП ПО КОЛОНКАМ
00 0000170 00 077 042 0001	360		ВИ	1
	   00 072 0000776	361		ПФ	0776
00 0000171 00 112 0000000	362		СРЛ
	   00 077 040 0001	363		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА КОЛОНКИ
00 0000172 14 074 3777401	364		ПА	-255,12		;СЧЕТЧИК КОЛОНОК
	   07 072 0000000	365		ПФ	,7
00 0000173 15 033 0000204	366		КЦ	КЗС,13		;КЦ ЗП ПО СТРОКАМ
	   00 077 001 0000	367		ВТ			;ВЫТОЛКНЕМ В ОП
00 0000174 00 077 042 0001	368		ВИ	1
	   00 112 0017740	369		СРЛ	017740
00 0000175 00 077 040 0001	370		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА КОЛОНКИ
	   15 074 3777401	371		ПА	-255,13		;СЧЕТЧИК СТРОК
00 0000176 07 030 0000205	372		ПБ	ЦЧТ,7		;НА КОНТРОЛЬНОЕ ЧТЕНИЕ
	   00 072 0000000
   0000177			373	КЗБ
00 0000177 01 075 0000001	374		СА	1,1		;НОВЫЙ БЛОК
	   07 030 0000151	375		ПБ	ЦЗ,7
   0000200			376	КЗГ
00 0000200 00 072 0001000	377		ПФ	01000
	   01 075 0000000	378		СА	,1		;НОВАЯ ГРУППА
00 0000201 07 030 0000151	379		ПБ	ЦЗ,7
	   00 072 0000000
   0000202			380	КЗМ
00 0000202 01 075 0000004	381		СА	4,1		;НОВАЯ МКСХ
	   07 030 0000151	382		ПБ	ЦЗ,7
   0000203			383	КЗК
00 0000203 01 075 0020000	384		СА	020000,1	;НОВАЯ КОЛОНКА
	   07 030 0000151	385		ПБ	ЦЗ,7
   0000204			386	КЗС
00 0000204 01 075 0000040	387		СА	040,1		;НОВАЯ СТРОКА
	   07 030 0000151	388		ПБ	ЦЗ,7
				389	
   0000205			390	ЦЧТ
				391	
				392	; *******************************************************
				393	; *		     ЧТЕНИЕ И СРАВНЕНИЕ			*
				394	; *	   /ПАРАМЕТРЫ ЦИКЛОВ УЖЕ УСТАНОВЛЕНЫ/		*
				395	; *******************************************************
				396	
   0000205			397	ЦЧ
КАС2211 Файл OP1 : Лист 8 Дата 9.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

00 0000205 07 072 0000000	398		ПФ	,7
	   01 040 0000211	399		ИР	ЦЧ2,1		;0 - Ю НЕ КОНТРОЛИРУЕМ
00 0000206 01 010 0000000	400		СЧ	,1
	   07 012 0000627	401		СР	ЭТАЛОН,7	;СРАВНИМ С ЭТАЛОНОМ
00 0000207 07 050 0000211	402		УР	ЦЧ2,7
				403	
				404	; *******************************************************
				405	; *							*
				406	; *		  ОШИБКА НЕСРАВНЕНИЯ			*
				407	; *							*
				408	; * ИНДИКАЦИЯ:						*
				409	; *  ВР	 - ЭТАЛОННЫЙ КОД				*
				410	; *  СМ	 - КОД НЕСРАВНЕНИЯ				*
				411	; *  РМР - СЧИТАННОЕ ЗНАЧЕНИЕ				*
				412	; *  И	 - АДРЕС СЧИТЫВАНИЯ/И1/				*
				413	; *******************************************************
				414	
	   07 073 0000627	415		ИК	ЭТАЛОН,7
00 0000210 01 077 007 0050	416		ОСТ	050,1
	   07 030 0000211	417		ПБ	ЦЧ2,7		;ЗДЕСЬ БУДЕТ ДИАГНОСТИКА
   0000211			418	ЦЧ2
00 0000211 07 072 0000000	419		ПФ	,7
	   02 041 0000215	420		ИН	ЦЧ3,2		;1 - БЛОК ФИКСИРОВАН
00 0000212 07 072 0000000	421		ПФ	,7
	   11 033 0000235	422		КЦ	КЧБ,9		;КЦ ЧТ ПО БЛОКАМ
00 0000213 00 077 042 0001	423		ВИ	1
	   00 112 0000003	424		СРЛ	3
00 0000214 00 077 040 0001	425		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА БЛОКА
	   11 074 3777775	426		ПА	-3,9		;СЧЕТЧИК БЛОКОВ
   0000215			427	ЦЧ3
00 0000215 07 072 0000000	428		ПФ	,7
	   03 041 0000222	429		ИН	ЦЧ4,3		;1 - ЕСЛИ ГРУППА ФИКСИРОВАНА
00 0000216 07 072 0000000	430		ПФ	,7
	   12 033 0000236	431		КЦ	КЧГ,10		;КЦ ЧТ ПО ГРУППАМ
00 0000217 00 077 042 0001	432		ВИ	1
	   00 072 0002000	433		ПФ	02000
00 0000220 00 112 0000000	434		СРЛ
	   00 077 040 0001	435		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА ГРУППЫ
00 0000221 12 074 3777776	436		ПА	-2,10		;СЧЕТЧИК ГРУПП
	   00 072 0000000
   0000222			437	ЦЧ4
00 0000222 07 072 0000000	438		ПФ	,7
	   04 041 0000226	439		ИН	ЦЧ5,4		;1 - МКСХ ФИКСИРОВАНА
00 0000223 07 072 0000000	440		ПФ	,7
	   13 033 0000240	441		КЦ	КЧМ,11		;КЦ ЧТ ПО МКСХ
00 0000224 00 077 042 0001	442		ВИ	1
	   00 112 0000034	443		СРЛ	034
00 0000225 00 077 040 0001	444		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА МКСХ
	   13 074 3777771	445		ПА	-7,11		;СЧЕТЧИК МКСХ
   0000226			446	ЦЧ5
00 0000226 07 072 0000000	447		ПФ	,7
	   14 033 0000241	448		КЦ	КЧК,12		;КЦ ЧТ ПО КОЛОНКАМ
00 0000227 00 077 042 0001	449		ВИ	1
	   00 072 0000776	450		ПФ	0776
00 0000230 00 112 0000000	451		СРЛ
	   00 077 040 0001	452		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА КОЛОНКИ
00 0000231 14 074 3777401	453		ПА	-255,12		;СЧЕТЧИК КОЛОНОК
	   07 072 0000000	454		ПФ	,7
00 0000232 15 033 0000242	455		КЦ	КЧС,13		;КЦ ЧТ ПО СТРОКАМ
	   00 077 042 0001	456		ВИ	1
00 0000233 00 112 0017740	457		СРЛ	017740
	   00 077 040 0001	458		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА СТРОКИ
КАС2211 Файл OP1 : Лист 9 Дата 9.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

00 0000234 15 074 3777401	459		ПА	-255,13		;СЧЕТЧИК СТРОК
	   07 030 0000243	460		ПБ	КЗПЧТ,7 
   0000235			461	КЧБ
00 0000235 01 075 0000001	462		СА	1,1		;НОВЫЙ БЛОК
	   07 030 0000205	463		ПБ	ЦЧ,7
   0000236			464	КЧГ
00 0000236 00 072 0001000	465		ПФ	01000
	   01 075 0000000	466		СА	,1		;НОВАЯ ГРУППА
00 0000237 07 030 0000205	467		ПБ	ЦЧ,7
	   00 072 0000000
   0000240			468	КЧМ
00 0000240 01 075 0000004	469		СА	4,1		;НОВАЯ МКСХ
	   07 030 0000205	470		ПБ	ЦЧ,7
   0000241			471	КЧК
00 0000241 01 075 0020000	472		СА	020000,1	;НОВАЯ КОЛОНКА
	   07 030 0000205	473		ПБ	ЦЧ,7
   0000242			474	КЧС
00 0000242 01 075 0000040	475		СА	040,1		;НОВАЯ КОЛОНКА
	   07 030 0000205	476		ПБ	ЦЧ,7
   0000243			477	КЗПЧТ
00 0000243 07 010 0000621	478		СЧ	ВСЕЕД,7		;НОВЫЙ ЭТАЛОННЫЙ КОД
	   07 072 0000000	479		ПФ	,7
00 0000244 16 033 0000146	480		КЦ	ЦЗП,14		;КЦ ЗП/ЧТ ПО КОДАМ ПРОВЕРКИ
	   07 072 0000000	481		ПФ	,7
00 0000245 05 040 0000246	482		ИР	МАРШ,5		;НА СЛЕДУЮЩИЙ ПРИМЕР
	   17 030 0000000	483		ПБ	,15		;ВЫПОЛНЯЕТСЯ ТОЛЬКО ОДИН ПРИМЕР
				484		
   0000246			485	МАРШ
				486	
				487	; *******************************************************
				488	; *							*
				489	; *		  ПРОВЕРКА ТЕСТОМ 'МАРШ'		*
				490	; *							*
				491	; * АЛГОРИТМ ПРОВЕРКИ:					*
				492	; *  АНАЛОГИЧЕН АЛГОРИТМУ ТЕСТА 'ЗАПИСЬ-СЧИТЫВАНИЕ', НО *
				493	; *  СРАЗУ ЖЕ ПОСЛЕ СЧИТЫВАНИЯ ПО АДРЕСУ СЧИТЫВАНИЯ ЗА- *
				494	; *  ПИСЫВАЕТСЯ ОБРАТНЫЙ КОД.				*
				495	; *  ПОРЯДОК ПЕРЕБОРА АДРЕСОВ:				*
				496	; *  1)БЛОК =>ГРУППА =>МИКРОСХЕМА =>КОЛОНКА =>СТРОКА	*
				497	; *    (ПО ВОЗРАСТАНИЮ АДРЕСОВ)				*
				498	; *  2)БЛОК =>ГРУППА  =>МИКРОСХЕМА =>КОЛОНКА =>СТРОКА	*
				499	; *    (ПО УБЫВАНИЮ АДРЕСОВ)				*
				500	; *  ЕСЛИ НЕСРАВНЕНИЕ С КОДОМ РОСПИСИ ЗАФИКСИРОВАНО ПРИ *
				501	; *  ПЕРЕБОРЕ АДРЕСОВ ПО ВОЗРАСТАНИЮ, ТО ПРОГРАММА ВЫЙ- *
				502	; *  ДЕТ НА ОСТАНОВ С АДРЕСОМ 51(8), А ЕСЛИ ПРИ ПЕРЕБО- *
				503	; *  РЕ ПО УБЫВАНИЮ, ТО НА ОСТАНОВ С АДРЕСОМ 52(8).	*
				504	; *							*
				505	; * ИСПОЛЬЗУЕМЫЕ РЕГИСТРЫ:				*
				506	; *  И1	 - АДРЕС ЗАПИСИ/ЧТЕНИЯ				*
				507	; *  И2	 - ПРИЗНАК ФИКСАЦИИ БЛОКА			*
				508	; *  И3	 - ПРИЗНАК ФИКСАЦИИ ГРУППЫ			*
				509	; *  И4	 - ПРИЗНАК ФИКСАЦИИ КОЛОНКИ			*
				510	; *  И11 - ПАРАМЕТР ЦИКЛА ПО БЛОКАМ			*
				511	; *  И12 - ПАРАМЕТР ЦИКЛА ПО ГРУППАМ			*
				512	; *  И13 - ПАРАМЕТР ЦИКЛА ПО МИКРОСХЕМАМ		*
				513	; *  И14 - ПАРАМЕТР ЦИКЛА ПО КОЛОНКАМ			*
				514	; *  И15 - ПАРАМЕТР ЦИКЛА ПО СТРОКАМ			*
				515	; *  И16 - ПАРАМЕТР ЦИКЛА ПО КОДАМ ПРОВЕРКИ		* 
				516	; *******************************************************
				517	
				518	; *******************************************************
				519	; *	    ПЕРЕБОР АДРЕСОВ ОТ МЛАДШИХ К СТАРШИМ	*
КАС2211 Файл OP1 : Лист 10 Дата 9.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

				520	; *******************************************************
				521	
				522	; *******************************************************
				523	; *			РОСПИСЬ ОП			*
				524	; *******************************************************
				525	
00 0000246 07 072 0000000	526		ПФ	,7
	   16 031 0000575	527		ПВ	НАЧАДР,14	;И1:=НАЧ.АДРЕС ПРОВЕРКИ
00 0000247 00 010 0000000	528		СЧ	0
	   07 000 0000627	529		ЗЧ	ЭТАЛОН,7	;ЭТАЛОННЫЙ КОД
00 0000250 11 074 3777775	530		ПА	-3,9		;СЧЕТЧИК БЛОКОВ
	   12 074 3777776	531		ПА	-2,10		;СЧЕТЧИК ГРУПП
00 0000251 13 074 3777771	532		ПА	-7,11		;СЧЕТЧИК МКСХ
	   14 074 3777401	533		ПА	-255,12		;СЧЕТЧИК КОЛОНОК
00 0000252 15 074 3777401	534		ПА	-255,13		;СЧЕТЧИК СТРОК
	   00 072 0000000
   0000253			535	ЦЗМ1
00 0000253 07 010 0000627	536		СЧ	ЭТАЛОН,7	;ЭТАЛОННЫЙ КОД
	   01 000 0000000	537		ЗЧ	,1
00 0000254 07 072 0000000	538		ПФ	,7
	   02 041 0000260	539		ИН	ЦЗМГ1,2		;1 - БЛОК ФИКСИРОВАН
00 0000255 07 072 0000000	540		ПФ	,7
	   11 033 0000301	541		КЦ	КЗБМ1,9		;КЦ ЗАПИСИ ПО БЛОКАМ
00 0000256 11 074 3777775	542		ПА	-3,9		;СЧЕТЧИК БЛОКОВ
	   00 077 042 0001	543		ВИ	1
00 0000257 00 112 0000003	544		СРЛ	3
	   00 077 040 0001	545		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА БЛОКА
   0000260			546	ЦЗМГ1
00 0000260 07 072 0000000	547		ПФ	,7
	   03 041 0000265	548		ИН	ЦЗММ1,3		;1 - ГРУППА ФИКСИРОВАНА
00 0000261 07 072 0000000	549		ПФ	,7
	   12 033 0000303	550		КЦ	КЗГМ1,10	;КЦ ЗП ПО ГРУППАМ
00 0000262 12 074 3777776	551		ПА	-2,10		;СЧЕТЧИК ГРУПП
	   00 077 042 0001	552		ВИ	1
00 0000263 00 072 0002000	553		ПФ	02000
	   00 112 0000000	554		СРЛ
00 0000264 00 077 040 0001	555		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА ГРУППЫ
	   00 072 0000000
   0000265			556	ЦЗММ1
00 0000265 07 072 0000000	557		ПФ	,7
	   04 041 0000271	558		ИН	ЦЗКМ1,4		;1 - МКСХ ФИКСИРОВАНА	
00 0000266 07 072 0000000	559		ПФ	,7
	   13 033 0000305	560		КЦ	КЗММ1,11	;КЦ ЗП ПО МКСХ
00 0000267 13 074 3777771	561		ПА	-7,11		;СЧЕТЧИК МКСХ
	   00 077 042 0001	562		ВИ	1
00 0000270 00 112 0000034	563		СРЛ	034
	   00 077 040 0001	564		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА МКСХ
   0000271			565	ЦЗКМ1
00 0000271 07 072 0000000	566		ПФ	,7
	   14 033 0000306	567		КЦ	КЗКМ1,12	;КЦ ЗП ПО КОЛОНКАМ
00 0000272 14 074 3777401	568		ПА	-255,12		;СЧЕТЧИК КОЛОНОК
	   00 077 042 0001	569		ВИ	1
00 0000273 00 072 0000776	570		ПФ	0776
	   00 112 0000000	571		СРЛ
00 0000274 00 077 040 0001	572		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА КОЛОНКИ
	   07 072 0000000	573		ПФ	,7
00 0000275 15 033 0000307	574		КЦ	КЗСМ1,13	;КЦ ЗП ПО СТРОКАМ
	   00 077 001 0000	575		ВТ			;ВЫТОЛКНЕМ В ОП
00 0000276 00 077 042 0001	576		ВИ	1
	   00 112 0017740	577		СРЛ	017740
00 0000277 00 077 040 0001	578		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА СТРОКИ
	   15 074 3777401	579		ПА	-255,13		;СЧЕТЧИК СТРОК
КАС2211 Файл OP1 : Лист 11 Дата 9.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

00 0000300 07 030 0000310	580		ПБ	ЧТМ1,7		;НА ЧТЕНИЕ С ИНВЕРТИРОВАНИЕМ	
	   00 072 0000000
   0000301			581	КЗБМ1
00 0000301 01 075 0000001	582		СА	1,1		;НОВЫЙ БЛОК
	   00 077 006 0024	583		ЗР	024		;ГАШУ СКП
00 0000302 07 030 0000253	584		ПБ	ЦЗМ1,7
	   00 072 0000000
   0000303			585	КЗГМ1
00 0000303 00 072 0001000	586		ПФ	01000
	   01 075 0000000	587		СА	,1		;НОВАЯ ГРУППА
00 0000304 07 030 0000253	588		ПБ	ЦЗМ1,7
	   00 072 0000000
   0000305			589	КЗММ1
00 0000305 01 075 0000004	590		СА	4,1		;НОВАЯ МКСХ
	   07 030 0000253	591		ПБ	ЦЗМ1,7
   0000306			592	КЗКМ1
00 0000306 01 075 0020000	593		СА	020000,1	;НОВАЯ КОЛОНКА
	   07 030 0000253	594		ПБ	ЦЗМ1,7
   0000307			595	КЗСМ1
00 0000307 01 075 0000040	596		СА	040,1		;НОВАЯ СТРОКА
	   07 030 0000253	597		ПБ	ЦЗМ1,7
   0000310			598	ЧТМ1
00 0000310 00 077 037 2760	599		РА	02760		;ТЕГ='37'
	   07 010 0000621	600		СЧ	ВСЕЕД,7
00 0000311 07 067 0000630	601		ЗТ	ОБРКО,7
	   00 077 001 0000	602		ВТ
				603	
				604	; *******************************************************
				605	; *		ЧТЕНИЕ С ИНВЕРТИРОВАНИЕМ		*
				606	; *	    /ПАРАМЕТРЫ ЦИКЛОВ УЖЕ УСТАНОВЛЕНЫ/		*
				607	; *******************************************************
				608	
   0000312			609	ЧМ1
00 0000312 07 072 0000000	610		ПФ	,7
	   01 040 0000320	611		ИР	ЦЧМ1,1		;0 -Ю ЯЧЕЙКУ НЕ ПРОВЕРЯЕМ
00 0000313 01 060 0000000	612		СТ	,1
	   07 012 0000627	613		СР	ЭТАЛОН,7	;СРАВНИМ С ЭТАЛОНОМ	
00 0000314 07 050 0000316	614		УР	ИНВЕРС1,7
				615	
				616	; *******************************************************
				617	; *							*
				618	; *	      ОШИБКА НЕСРАВНЕНИЯ В ТЕСТЕ 'МАРШ'		*
				619	; *	   (ПЕРЕБОР АДРЕСОВ ОТ МЛАДШИХ К СТАРШИМ)	*
				620	; *							*
				621	; * ИНДИКАЦИЯ:						*
				622	; *  ВР	 - ЭТАЛОННЫЙ КОД				*
				623	; *  СМ	 - КОД НЕСРАВНЕНИЯ				*
				624	; *  РМР - СЧИТАННЫЙ КОД				*
				625	; *  И	 - АДРЕС СЧИТЫВАНИЯ/И1/				*
				626	; *******************************************************
				627	
	   07 073 0000627	628		ИК	ЭТАЛОН,7
00 0000315 01 077 007 0051	629		ОСТ	051,1
	   07 030 0000316	630		ПБ	ИНВЕРС1,7	;ЗДЕСЬ БУДЕТ ДИАГНОСТИКА
				631	
00 0000316 07 060 0000630	632	ИНВЕРС1 СТ	ОБРКО,7
	   01 067 0000000	633		ЗТ	,1		;ЗАПИШЕМ ОБРАТНЫЙ КОД
00 0000317 00 077 001 0000	634		ВТ			;ВЫТОЛКНЕМ В ОП
	   00 072 0000000
00 0000320 07 072 0000000	635	ЦЧМ1	ПФ	,7
	   02 041 0000324	636		ИН	ЦЧГМ1,2		;1 - БЛОК ФИКСИРОВАН
00 0000321 07 072 0000000	637		ПФ	,7
КАС2211 Файл OP1 : Лист 12 Дата 9.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

	   11 033 0000344	638		КЦ	КЧБМ1,9		;КЦ ЧТ ПО БЛОКАМ
00 0000322 11 074 3777775	639		ПА	-3,9		;СЧЕТЧИК БЛОКОВ
	   00 077 042 0001	640		ВИ	1
00 0000323 00 112 0000003	641		СРЛ	3
	   00 077 040 0001	642		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА БЛОКА
   0000324			643	ЦЧГМ1
00 0000324 07 072 0000000	644		ПФ	,7
	   03 041 0000331	645		ИН	ЦЧММ1,3		;1 - ГРУППА ФИКСИРОВАНА
00 0000325 07 072 0000000	646		ПФ	,7
	   12 033 0000346	647		КЦ	КЧГМ1,10	;КЦ ЧТ ПО ГРУППАМ
00 0000326 12 074 3777776	648		ПА	-2,10		;СЧЕТЧИК ГРУПП
	   00 077 042 0001	649		ВИ	1
00 0000327 00 072 0002000	650		ПФ	02000
	   00 112 0000000	651		СРЛ
00 0000330 00 077 040 0001	652		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА ГРУППЫ
	   00 072 0000000
   0000331			653	ЦЧММ1
00 0000331 07 072 0000000	654		ПФ	,7
	   04 041 0000335	655		ИН	ЦЧКМ1,4		;1 - МКСХ ФИКСИРОВАНА
00 0000332 07 072 0000000	656		ПФ	,7
	   13 033 0000350	657		КЦ	КЧММ1,11	;КЦ ЧТ ПО МКСХ
00 0000333 13 074 3777771	658		ПА	-7,11		;СЧЕТЧИК МКСХ
	   00 077 042 0001	659		ВИ	1
00 0000334 00 112 0000034	660		СРЛ	034
	   00 077 040 0001	661		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА МКСХ
   0000335			662	ЦЧКМ1
00 0000335 07 072 0000000	663		ПФ	,7
	   14 033 0000351	664		КЦ	КЧКМ1,12	;КЦ ЧТ ПО КОЛОНКАМ
00 0000336 14 074 3777401	665		ПА	-255,12		;СЧЕТЧИК КОЛОНОК
	   00 077 042 0001	666		ВИ	1
00 0000337 00 072 0000776	667		ПФ	0776
	   00 112 0000000	668		СРЛ
00 0000340 00 077 040 0001	669		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА КОЛОНКИ
	   07 072 0000000	670		ПФ	,7
00 0000341 15 033 0000352	671		КЦ	КЧСМ1,13	;КЦ ЧТ ПО СТРОКАМ
	   00 077 042 0001	672		ВИ	1
00 0000342 00 112 0017740	673		СРЛ	017740
	   00 077 040 0001	674		УИ	1		;УБРАЛИ РАЗРЯДЫ НОМЕРА СТРОКИ
00 0000343 15 074 3777401	675		ПА	-255,13		;СЧЕТЧИК СТРОК
	   07 030 0000353	676		ПБ	ЗМ2ЧМ2,7
   0000344			677	КЧБМ1
00 0000344 01 075 0000001	678		СА	1,1		;НОВЫЙ БЛОК
	   00 077 006 0024	679		ЗР	024		;ГАШУ СКП
00 0000345 07 030 0000312	680		ПБ	ЧМ1,7
	   00 072 0000000
   0000346			681	КЧГМ1
00 0000346 00 072 0001000	682		ПФ	01000
	   01 075 0000000	683		СА	,1		;НОВАЯ ГРУППА
00 0000347 07 030 0000312	684		ПБ	ЧМ1,7
	   00 072 0000000
   0000350			685	КЧММ1
00 0000350 01 075 0000004	686		СА	4,1		;НОВАЯ МКСХ
	   07 030 0000312	687		ПБ	ЧМ1,7
   0000351			688	КЧКМ1
00 0000351 01 075 0020000	689		СА	020000,1	;НОВАЯ КОЛОНКА
	   07 030 0000312	690		ПБ	ЧМ1,7
   0000352			691	КЧСМ1
00 0000352 01 075 0000040	692		СА	040,1		;НОВАЯ СТРОКА
	   07 030 0000312	693		ПБ	ЧМ1,7
   0000353			694	ЗМ2ЧМ2
				695	
				696	; *******************************************************
КАС2211 Файл OP1 : Лист 13 Дата 9.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

				697	; *	    ПЕРЕБОР АДРЕСОВ ОТ СТАРШИХ К МЛАДШИМ	*
				698	; *******************************************************
				699	
00 0000353 07 072 0000000	700		ПФ	,7	
	   16 031 0000600	701		ПВ	КОНАДР,14	;ФОРМИРУЕМ НАЧ.АДРЕС ПРОВЕРКИ
00 0000354 07 010 0000621	702		СЧ	ВСЕЕД,7
	   07 000 0000627	703		ЗЧ	ЭТАЛОН,7
   0000355			704	ЧТМ2
				705	
				706	; *******************************************************
				707	; *		ЧТЕНИЕ С ИНВЕРТИРОВАНИЕМ		*
				708	; *	     /ПАРАМЕТРЫ ЦИКЛОВ УЖЕ УСТАНОВЛЕНЫ/		*
				709	; *******************************************************
				710	
   0000355			711	ЧМ2
00 0000355 07 072 0000000	712		ПФ	,7
	   01 040 0000363	713		ИР	ЦЧМ2,1		;0-Ю ЯЧЕЙКУ НЕ ПРОВЕРЯЕМ
00 0000356 01 060 0000000	714		СТ	,1
	   07 012 0000627	715		СР	ЭТАЛОН,7	;СРАВНИМ С ЭТАЛОНОМ
00 0000357 07 050 0000361	716		УР	ИНВЕРС2,7
				717	
				718	; *******************************************************
				719	; *							*
				720	; *	      ОШИБКА НЕСРАВНЕНИЯ В ТЕСТЕ 'МАРШ'		*
				721	; *	   (ПЕРЕБОР АДРЕСОВ ОТ СТАРШИХ К МЛАДШИМ)	*      
				722	; *							*
				723	; * ИНДИКАЦИЯ:						*
				724	; *  ВР	 - ЭТАЛОННЫЙ КОД				*
				725	; *  СМ	 - КОД НЕСРАВНЕНИЯ				*
				726	; *  РМР - СЧИТАННЫЙ КОД				*
				727	; *  И	 - АДРЕС СЧИТЫВАНИЯ/И1/				*
				728	; *******************************************************
				729	
	   07 073 0000627	730		ИК	ЭТАЛОН,7
00 0000360 01 077 007 0052	731		ОСТ	052,1
	   07 030 0000361	732		ПБ	ИНВЕРС2,7	;ЗДЕСЬ БУДЕТ ДИАГНОСТИКА
				733	
00 0000361 00 010 0000000	734	ИНВЕРС2 СЧ	0
	   01 000 0000000	735		ЗЧ	,1		;ЗАПИШЕМ ОБРАТНЫЙ КОД
00 0000362 00 077 001 0000	736		ВТ			;ВЫТОЛКНЕМ В ОП
	   00 072 0000000
   0000363			737	ЦЧМ2
00 0000363 07 072 0000000	738		ПФ	,7
	   02 041 0000367	739		ИН	ЦЧГМ2,2		;1 - БЛОК ФИКСИРОВАН
00 0000364 07 072 0000000	740		ПФ	,7
	   11 033 0000410	741		КЦ	КЧБМ2,9		;КЦ ЧТ ПО БЛОКАМ
00 0000365 11 074 3777775	742		ПА	-3,9		;СЧЕТЧИК БЛОКОВ
	   00 077 042 0001	743		ВИ	1
00 0000366 00 112 0000003	744		СРЛ	3
	   00 077 040 0001	745		УИ	1		;ВОССТАНОВИЛИ РАЗРЯДЫ НОМЕРА БЛОКА
   0000367			746	ЦЧГМ2
00 0000367 07 072 0000000	747		ПФ	,7
	   03 041 0000374	748		ИН	ЦЧММ2,3		;1 - ГРУППА ФИКСИРОВАНА
00 0000370 07 072 0000000	749		ПФ	,7
	   12 033 0000412	750		КЦ	КЧГМ2,10	;КЦ ЧТ ПО ГРУППАМ
00 0000371 12 074 3777776	751		ПА	-2,10		;СЧЕТЧИК ГРУПП
	   00 077 042 0001	752		ВИ	1
00 0000372 00 072 0002000	753		ПФ	02000
	   00 112 0000000	754		СРЛ
00 0000373 00 077 040 0001	755		УИ	1		;ВОССТАНОВИЛИ РАЗРЯДЫ НОМЕРА ГРУППЫ
	   00 072 0000000
   0000374			756	ЦЧММ2
КАС2211 Файл OP1 : Лист 14 Дата 9.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

00 0000374 07 072 0000000	757		ПФ	,7
	   04 041 0000400	758		ИН	ЦЧКМ2,4		;1 - МКСХ ФИКСИРОВАНА
00 0000375 07 072 0000000	759		ПФ	,7
	   13 033 0000414	760		КЦ	КЧММ2,11	;КЦ ЧТ ПО МКСХ
00 0000376 13 074 3777771	761		ПА	-7,11		;СЧЕТЧИК МКСХ
	   00 077 042 0001	762		ВИ	1
00 0000377 00 112 0000034	763		СРЛ	034
	   00 077 040 0001	764		УИ	1		;ВОССТАНОВИЛИ РАЗРЯДЫ НОМЕРА МКСХ
   0000400			765	ЦЧКМ2
00 0000400 07 072 0000000	766		ПФ	,7
	   14 033 0000415	767		КЦ	КЧКМ2,12	;КЦ ЧТ ПО КОЛОНКАМ
00 0000401 14 074 3777401	768		ПА	-255,12		;СЧЕТЧИК КОЛОНОК
	   00 077 042 0001	769		ВИ	1
00 0000402 00 072 0000776	770		ПФ	0776
	   00 112 0000000	771		СРЛ
00 0000403 00 077 040 0001	772		УИ	1		;ВОССТАНОВИЛИ РАЗРЯДЫ НОМЕРА КОЛОНКИ
	   07 072 0000000	773		ПФ	,7
00 0000404 15 033 0000416	774		КЦ	КЧСМ2,13	;КЦ ЧТ ПО СТРОКАМ
	   00 077 042 0001	775		ВИ	1
00 0000405 00 112 0017740	776		СРЛ	017740
	   00 077 040 0001	777		УИ	1		;ВОССТАНОВИЛИ РАЗРЯДЫ НОМЕРА СТРОКИ
00 0000406 15 074 3777401	778		ПА	-255,13		;СЧЕТЧИК СТРОК
	   07 072 0000000	779		ПФ	,7
00 0000407 05 040 0000421	780		ИР	МАРШХ,5		;НА СЛЕД.ПРИМЕР
	   17 030 0000000	781		ПБ	,15		;ТОЛЬКО ОДИН ПРИМЕР	
   0000410			782	КЧБМ2
00 0000410 01 075 3777777	783		СА	-1,1		;НОВЫЙ БЛОК
	   00 077 006 0024	784		ЗР	024		;ГАШУ СКП 
00 0000411 07 030 0000355	785		ПБ	ЧМ2,7
	   00 072 0000000
   0000412			786	КЧГМ2
00 0000412 00 072 3777000	787		ПФ	-01000
	   01 075 0000000	788		СА	,1		;НОВАЯ ГРУППА
00 0000413 07 030 0000355	789		ПБ	ЧМ2,7
	   00 072 0000000
   0000414			790	КЧММ2
00 0000414 01 075 3777774	791		СА	-4,1		;НОВАЯ МКСХ
	   07 030 0000355	792		ПБ	ЧМ2,7
   0000415			793	КЧКМ2
00 0000415 01 075 3760000	794		СА	-020000,1	;НОВАЯ КОЛОНКА
	   07 030 0000355	795		ПБ	ЧМ2,7
   0000416			796	КЧСМ2
00 0000416 01 075 3777740	797		СА	-040,1		;НОВАЯ СТРОКА
	   07 030 0000355	798		ПБ	ЧМ2,7
				799	
   0000417			800	ДИАГ
				801	
				802	; *******************************************************
				803	; *							*
				804	; *		ПРОВЕРКА ТЕСТОМ 'ДИАГОНАЛЬ'		*
				805	; *							*
				806	; * АЛГОРИТМ ПРОВЕРКИ:					*
				807	; *  В ТЕСТЕ ПРОВЕРЯЮТСЯ УСИЛИТЕЛИ СЧИТЫВАНИЯ МИКРОСХЕМ *
				808	; *  ДИНАМИЧЕСКОГО ТИПА. В ВЫБРАННОЙ МИКРОСХЕМЕ(1-5,22, *
				809	; *  23РР. АДРЕСА) ПО ВСЕМ АДРЕСАМ ЗАПИСЫВАЕТСЯ ФОНОВЫЙ *
				810	; *  КОД. ЕСЛИ НОМЕР СТРОКИ В МИКРОСХЕМЕ(13-6РР.АДРЕСА) *
				811	; *  РАВЕН НОМЕРУ КОЛОНКИ(21-14РР.АДРЕСА), ТО ЗАПИСЫВА- *
				812	; *  ЕТСЯ КОД, ОБРАТНЫЙ ФОНОВОМУ. ЗАТЕМ ПО ВСЕМ АДРЕСАМ *
				813	; *  ВЫПОЛНЯЕТСЯ СЧИТЫВАНИЕ С КОНТРОЛЕМ. ПРИ НЕСОВПАДЕ- *
				814	; *  НИИ ТЕСТ ВЫХОДИТ НА ОСТАНОВ С АДРЕСОМ 53(8). ТЕ ЖЕ *
				815	; *  ДЕЙСТВИЯ ВЫПОЛНЯЮТСЯ С ЗАПИСЬЮ КОДА, ОБРАТНОГО ФО- *
				816	; *  НОВОМУ, ПРИ УСЛОВИИ: НОМЕР СТРОКИ = НОМЕРУ КОЛОНКИ *
КАС2211 Файл OP1 : Лист 15 Дата 9.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

				817	; *  + 1 И Т.Д.						*
				818	; *							*
				819	; * ИСПОЛЬЗУЕМЫЕ РЕГИСТРЫ:				*
				820	; *******************************************************
				821	
   0000417			822	ЗПД
				823	
				824	; *******************************************************
				825	; *		   ЗАПИСЬ В МИКРОСХЕМЕ			*
				826	; *******************************************************
				827	
				828	; *******************************************************
				829	; *							*
				830	; *	  ОШИБКА НЕСРАВНЕНИЯ В ТЕСТЕ 'ДИАГОНАЛЬ'	*
				831	; *							*
				832	; * ИНДИКАЦИЯ:						*
				833	; *******************************************************
				834	
00 0000417 00 077 007 1003	835		ОСТ	01003		;НЕ РЕАЛИЗОВАНО 
				836	
	   00 072 0000000
   0000420			837	ТХЭМ
				838	
				839	; *******************************************************
				840	; *							*
				841	; *		ПРОВЕРКА РАЗРЯДОВ ХЭММИНГА		*
				842	; *							*
				843	; * АЛГОРИТМ ПРОВЕРКИ:					*
				844	; *  РАЗРЯДЫ ХЭММИНГА ПРОВЕРЯЮТСЯ НА ТЕХ ЖЕ АЛГОРИТМАХ, *
				845	; *  ЧТО И ИНФОРМАЦИОННЫЕ РАЗРЯДЫ, С ИСПОЛЬЗОВАНИЕМ КО- *
				846	; *  ДОВ 'ВСЕ 0', 'ВСЕ 1'(ПРОВЕРКА 71-73 И 77-79 РР.) И *
				847	; *  'ЕДИНИЦА 58 РАЗРЯДА'(ПРОВЕРКА 76-74 РР.).		*
				848	; *  КРИТЕРИЙ ИСПРАВНОСТИ - ОТСУТСТВИЕ ИСПРАВЛЕНИЯ ОДИ- *
				849	; *  НОЧНЫХ ОШИБОК. КОНТРОЛЬ ЧЕРЕЗ ПУЛЬТОВОЙ ПРОЦЕССОР. *
				850	; *******************************************************
				851	
   0000420			852	ЗПХЧТХ
				853	
				854	; *******************************************************
				855	; *							*
				856	; *	  ПРОВЕРКА ПРЯМЫМ И ОБРАТНЫМ КОДОМ		*
				857	; *							*
				858	; * ИСПОЛЬЗУЕМЫЕ РЕГИСТРЫ:				*
				859	; *							*
				860	; *******************************************************
				861	
00 0000420 00 077 007 1004	862		ОСТ	01004		;НЕ РЕАЛИЗОВАНО
				863	
	   00 072 0000000
   0000421			864	МАРШХ
				865	
				866	; *******************************************************
				867	; *							*
				868	; *		   ПРОВЕРКА ТЕСТОМ 'МАРШ'		*
				869	; *							*			
				870	; * ИСПОЛЬЗУЕМЫЕ РЕГИСТРЫ:				*
				871	; *							*
				872	; *******************************************************
				873	
00 0000421 07 072 0000000	874		ПФ	,7
	   16 031 0000575	875		ПВ	НАЧАДР,14	;НАЧ.АДР.ПРОВЕР;КИ -> И1
00 0000422 11 074 3777775	876		ПА	-3,9		;СЧ-К БЛОКОВ
КАС2211 Файл OP1 : Лист 16 Дата 9.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

	   12 074 3777776	877		ПА	-2,10		;СЧ-К ГРУПП
00 0000423 13 074 3777771	878		ПА	-7,11		;СЧ-К МКСХ
	   14 074 3777401	879		ПА	-255,12		;СЧ-К КОЛОНОК
00 0000424 15 074 3777401	880		ПА	-255,13		;СЧ-К СТРОК
	   00 072 0000000
00 0000425 00 010 0000000	881	ЦЗМХ1	СЧ	0
	   01 000 0000000	882		ЗЧ	,1
00 0000426 07 072 0000000	883		ПФ	,7
	   02 041 0000432	884		ИН	ЦЗМГХ1,2	;БЛОК ФИКСИРОВАН
00 0000427 07 072 0000000	885		ПФ	,7
	   11 033 0000453	886		КЦ	КЗБМХ1,9	;КЦ ЗП ПО БЛОКАМ
00 0000430 11 074 3777775	887		ПА	-3,9		;СЧ-К БЛОКОВ
	   00 077 042 0001	888		ВИ	1
00 0000431 00 112 0000003	889		СРЛ	3
	   00 077 040 0001	890		УИ	1		;УБРАЛИ РР. НОМЕРА БЛОКА
00 0000432 07 072 0000000	891	ЦЗМГХ1	ПФ	,7
	   03 041 0000437	892		ИН	ЦЗММХ1,3	;ГРУППА ФИКСИРОВАНА
00 0000433 07 072 0000000	893		ПФ	,7
	   12 033 0000455	894		КЦ	КЗГМХ1,10	;КЦ ЗП ПО ГРУППАМ
00 0000434 12 074 3777776	895		ПА	-2,10		;СЧ-К ГРУПП
	   00 077 042 0001	896		ВИ	1
00 0000435 00 072 0002000	897		ПФ	02000
	   00 112 0000000	898		СРЛ
00 0000436 00 077 040 0001	899		УИ	1		;УБРАЛИ РР. НОМЕРА ГРУППЫ
	   00 072 0000000
00 0000437 07 072 0000000	900	ЦЗММХ1	ПФ	,7
	   04 041 0000443	901		ИН	ЦЗКМХ1,4	;МКСХ ФИКСИРОВАНА
00 0000440 07 072 0000000	902		ПФ	,7
	   13 033 0000457	903		КЦ	КЗММХ1,11	;КЦ ЗП ПО МКСХ
00 0000441 13 074 3777771	904		ПА	-7,11		;СЧ-К МКСХ
	   00 077 042 0001	905		ВИ	1
00 0000442 00 112 0000034	906		СРЛ	034
	   00 077 040 0001	907		УИ	1		;УБРАЛИ РР. НОМЕРА МКСХ
00 0000443 07 072 0000000	908	ЦЗКМХ1	ПФ	,7
	   14 033 0000460	909		КЦ	КЗКМХ1,12	;КЦ ЗП ПО КОЛОНКАМ
00 0000444 14 074 3777401	910		ПА	-255,12		;СЧ-К КОЛОНОК
	   00 077 042 0001	911		ВИ	1
00 0000445 00 072 0000776	912		ПФ	0776
	   00 112 0000000	913		СРЛ
00 0000446 00 077 040 0001	914		УИ	1		;УБРАЛИ РР. НОМЕРА КОЛОНКИ
	   07 072 0000000	915		ПФ	,7
00 0000447 15 033 0000461	916		КЦ	КЗСМХ1,13	;КЦ ЗП ПО СТРОКАМ
	   00 077 001 0000	917		ВТ			;ВЫТОЛКНЕМ В ОП
00 0000450 00 077 042 0001	918		ВИ	1
	   00 112 0017740	919		СРЛ	017740
00 0000451 00 077 040 0001	920		УИ	1		;УБРАЛИ РР. НОМЕРА СТРОКИ
	   15 074 3777401	921		ПА	-255,13		;СЧ-К СТРОК
00 0000452 07 030 0000462	922		ПБ	ЧТМХ1,7
	   00 072 0000000
00 0000453 01 075 0000001	923	КЗБМХ1	СА	1,1
	   00 077 006 0024	924		ЗР	024		;ГАШУ СКП
00 0000454 07 030 0000425	925		ПБ	ЦЗМХ1,7		;НОВ.БЛОК
	   00 072 0000000
00 0000455 00 072 0001000	926	КЗГМХ1	ПФ	01000
	   01 075 0000000	927		СА	,1
00 0000456 07 030 0000425	928		ПБ	ЦЗМХ1,7		;НОВ.ГРУППА
	   00 072 0000000
00 0000457 01 075 0000004	929	КЗММХ1	СА	4,1
	   07 030 0000425	930		ПБ	ЦЗМХ1,7		;НОВ.МКСХ
00 0000460 01 075 0020000	931	КЗКМХ1	СА	020000,1
	   07 030 0000425	932		ПБ	ЦЗМХ1,7		;НОВ.КОЛОНКА
00 0000461 01 075 0000040	933	КЗСМХ1	СА	040,1
КАС2211 Файл OP1 : Лист 17 Дата 9.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

	   07 030 0000425	934		ПБ	ЦЗМХ1,7		;НОВ.СТРОКА
				935	
   0000462			936	ЧТМХ1
				937	
				938	; *******************************************************
				939	; *		ЧТЕНИЕ С ИНВЕРТИРОВАНИЕМ		*
				940	; *******************************************************
				941	
00 0000462 01 010 0000000	942	ЧМХ1	СЧ	,1
	   07 010 0000622	943		СЧ	Е58,7
00 0000463 01 000 0000000	944		ЗЧ	,1		;ОБР. РР. ХЭММИНГА
	   00 077 001 0000	945		ВТ
00 0000464 07 072 0000000	946	ЦЧМХ1	ПФ	,7
	   02 041 0000470	947		ИН	ЦЧГМХ1,2	;БЛОК ФИКСИРОВАН
00 0000465 07 072 0000000	948		ПФ	,7
	   11 033 0000510	949		КЦ	КЧБМХ1,9	;КЦ ЧТ ПО БЛОКАМ
00 0000466 11 074 3777775	950		ПА	-3,9		;СЧ-К БЛОКОВ
	   00 077 042 0001	951		ВИ	1
00 0000467 00 112 0000003	952		СРЛ	3
	   00 077 040 0001	953		УИ	1		;УБРАЛИ РР. НОМЕРА БЛОКА
00 0000470 07 072 0000000	954	ЦЧГМХ1	ПФ	,7
	   03 041 0000475	955		ИН	ЦЧММХ1,3	;ГРУППА ФИКСИРОВАНА
00 0000471 07 072 0000000	956		ПФ	,7
	   12 033 0000512	957		КЦ	КЧГМХ1,10	;КЦ ЧТ ПО ГРУППАМ
00 0000472 12 074 3777776	958		ПА	-2,10		;СЧ-К ГРУПП
	   00 077 042 0001	959		ВИ	1
00 0000473 00 072 0002000	960		ПФ	02000
	   00 112 0000000	961		СРЛ
00 0000474 00 077 040 0001	962		УИ	1		;УБРАЛИ РР. НОМЕРА ГРУППЫ
	   00 072 0000000
00 0000475 07 072 0000000	963	ЦЧММХ1	ПФ	,7
	   04 041 0000501	964		ИН	ЦЧКМХ1,4	;МКСХ ФИКСИРОВАНА
00 0000476 07 072 0000000	965		ПФ	,7
	   13 033 0000514	966		КЦ	КЧММХ1,11	;КЦ ЧТ ПО МКСХ
00 0000477 13 074 3777771	967		ПА	-7,11		;СЧ-К МКСХ
	   00 077 042 0001	968		ВИ	1
00 0000500 00 112 0000034	969		СРЛ	034
	   00 077 040 0001	970		УИ	1		;УБРАЛИ РР. НОМЕРА МКСХ
00 0000501 07 072 0000000	971	ЦЧКМХ1	ПФ	,7
	   14 033 0000515	972		КЦ	КЧКМХ1,12	;КЦ ЧТ ПО КОЛОНКАМ
00 0000502 14 074 3777401	973		ПА	-255,12		;СЧ-К КОЛОНОК
	   00 077 042 0001	974		ВИ	1
00 0000503 00 072 0000776	975		ПФ	0776
	   00 112 0000000	976		СРЛ
00 0000504 00 077 040 0001	977		УИ	1		;УБРАЛИ РР. НОМЕРА КОЛОНКИ
	   07 072 0000000	978		ПФ	,7
00 0000505 15 033 0000516	979		КЦ	КЧСМХ1,13	;КЦ ЧТ ПО СТРОКАМ
	   00 077 042 0001	980		ВИ	1
00 0000506 00 112 0017740	981		СРЛ	017740
	   00 077 040 0001	982		УИ	1		;УБРАЛИ РР. НОМЕРА СТР.
00 0000507 15 074 3777401	983		ПА	-255,13		;СЧ-К СТРОК
	   07 030 0000517	984		ПБ	ЗХ2ЧХ2,7
00 0000510 01 075 0000001	985	КЧБМХ1	СА	1,1
	   00 077 006 0024	986		ЗР	024		;ГАШУ СКП
00 0000511 07 030 0000462	987		ПБ	ЧМХ1,7		;НОВ.БЛОК
	   00 072 0000000
00 0000512 00 072 0001000	988	КЧГМХ1	ПФ	01000
	   01 075 0000000	989		СА	,1
00 0000513 07 030 0000462	990		ПБ	ЧМХ1,7		;НОВ. ГРУППА
	   00 072 0000000
00 0000514 01 075 0000004	991	КЧММХ1	СА	4,1
	   07 030 0000462	992		ПБ	ЧМХ1,7		;НОВ.МКСХ
КАС2211 Файл OP1 : Лист 18 Дата 9.3.89 (0:3)


Тг   Адрес Код:		Строка	Текст

00 0000515 01 075 0020000	993	КЧКМХ1	СА	020000,1
	   07 030 0000462	994		ПБ	ЧМХ1,7		;НОВ. КОЛОНКА
00 0000516 01 075 0000040	995	КЧСМХ1	СА	040,1
	   07 030 0000462	996		ПБ	ЧМХ1,7		;НОВ.СТР.
				997	
   0000517			998	ЗХ2ЧХ2
				999	
				1000	; *******************************************************
				1001	; *	  ПЕРЕБОР АДРЕСОВ ОТ СТАРШИХ К МЛАДШИМ		*
				1002	; *******************************************************
				1003	
00 0000517 07 072 0000000	1004		ПФ	,7
	   16 031 0000600	1005		ПВ	КОНАДР,14	;НАЧ.АДРЕС ПРОВЕРКИ -> И1
00 0000520 01 010 0000000	1006	ЧМХ2	СЧ	,1
	   00 010 0000000	1007		СЧ	0
00 0000521 01 000 0000000	1008		ЗЧ	,1		;ОБР. РР. ХЭММИНГА
	   00 077 001 0000	1009		ВТ
00 0000522 07 072 0000000	1010		ПФ	,7
	   02 041 0000526	1011		ИН	ЦЧГМХ2,2	;БЛОК ФИКСИРОВАН
00 0000523 07 072 0000000	1012		ПФ	,7
	   11 033 0000546	1013		КЦ	КЧБМХ2,9	;КЦ ЧТ ПО БЛОКАМ
00 0000524 11 074 3777775	1014		ПА	-3,9		;СЧ-К БЛОКОВ
	   00 077 042 0001	1015		ВИ	1
00 0000525 00 112 0000003	1016		СРЛ	3
	   00 077 040 0001	1017		УИ	1		;ВОССТАНОВИЛИ РР. НОМЕРА БЛОКА
00 0000526 07 072 0000000	1018	ЦЧГМХ2	ПФ	,7
	   03 041 0000533	1019		ИН	ЦЧММХ2,3	;ГРУППА ФИКС.
00 0000527 07 072 0000000	1020		ПФ	,7
	   12 033 0000550	1021		КЦ	КЧГМХ2,10	;КЦ ЧТ ПО ГРУППАМ
00 0000530 12 074 3777776	1022		ПА	-2,10		;СЧ-К ГРУПП
	   00 077 042 0001	1023		ВИ	1
00 0000531 00 072 0002000	1024		ПФ	02000
	   00 112 0000000	1025		СРЛ
00 0000532 00 077 040 0001	1026		УИ	1		;ВОССТ. РР. НОМЕРА ГРУППЫ
	   00 072 0000000
00 0000533 07 072 0000000	1027	ЦЧММХ2	ПФ	,7
	   04 041 0000537	1028		ИН	ЦЧКМХ2,4	;МКСХ ФИКС.
00 0000534 07 072 0000000	1029		ПФ	,7
	   13 033 0000552	1030		КЦ	КЧММХ2,11	;КЦ ЧТ ПО МКСХ
00 0000535 00 077 042 0001	1031		ВИ	1
	   00 112 0000034	1032		СРЛ	034
00 0000536 00 077 040 0001	1033		УИ	1		;ВОССТ. РР. НОМЕРА МКСХ
	   00 072 0000000
00 0000537 07 072 0000000	1034	ЦЧКМХ2	ПФ	,7
	   14 033 0000553	1035		КЦ	КЧКМХ2,12	;КЦ ЧТ ПО КОЛОНКАМ
00 0000540 14 074 3777401	1036		ПА	-255,12		;СЧ-К КОЛОНОК
	   00 077 042 0001	1037		ВИ	1
00 0000541 00 072 0000776	1038		ПФ	0776
	   00 112 0000000	1039		СРЛ
00 0000542 00 077 040 0001	1040		УИ	1		;ВОССТ. РР. НОМЕРА КОЛОНКИ
	   07 072 0000000	1041		ПФ	,7
00 0000543 15 033 0000554	1042		КЦ	КЧСМХ2,13	;КЦ ЧТ ПО СТРОКАМ
	   00 077 042 0001	1043		ВИ	1
00 0000544 00 112 0017740	1044		СРЛ	017740
	   00 077 040 0001	1045		УИ	1		;ВОССТ. РР. НОМЕРА СТРОКИ
00 0000545 15 074 3777401	1046		ПА	-255,13		;СЧ-К СТРОК
	   17 030 0000000	1047		ПБ	,15		;ТОЬКО ОДИН ПРИМЕР;
00 0000546 01 075 3777777	1048	КЧБМХ2	СА	-1,1
	   00 077 006 0024	1049		ЗР	024		;ГАШУ СКП
00 0000547 07 030 0000520	1050		ПБ	ЧМХ2,7		;НОВ. БЛОК
	   00 072 0000000
00 0000550 00 072 3777000	1051	КЧГМХ2	ПФ	-01000
КАС2211 Файл OP1 : Лист 19 Дата 9.3.89 (0:3)


Тг   Адрес Код:		Строка	Текст

	   01 075 0000000	1052		СА	,1
00 0000551 07 030 0000520	1053		ПБ	ЧМХ2,7		;НОВ.ГРУППА
	   00 072 0000000
00 0000552 01 075 3777774	1054	КЧММХ2	СА	-4,1
	   07 030 0000520	1055		ПБ	ЧМХ2,7		;НОВ.МКСХ
00 0000553 01 075 3760000	1056	КЧКМХ2	СА	-020000,1
	   07 030 0000520	1057		ПБ	ЧМХ2,7		;НОВ. КОЛОНКА
00 0000554 01 075 3777740	1058	КЧСМХ2	СА	-040,1
	   07 030 0000520	1059		ПБ	ЧМХ2,7		;НОВ. СТР.	
				1060	
   0000555			1061	ДИАГХ		
				1062	
				1063	; *******************************************************
				1064	; *							*
				1065	; *	     ПРОВЕРКА ТЕСТОМ 'ДИАГОНАЛЬ'		*
				1066	; *							*
				1067	; * ИСПОЛЬЗУЕМЫЕ РЕГИСТРЫ:				*
				1068	; *							*
				1069	; *******************************************************
				1070	
00 0000555 00 077 007 1006	1071		ОСТ	01006		;НЕ РЕАЛИЗОВАНО
				1072	
	   00 072 0000000
   0000556			1073	ВЫХТ
				1074	
				1075	; ЗАВЕРШЕНИЕ РАБОТЫ ТЕСТА
				1076	; =======================
				1077	
00 0000556 10 075 0000001	1078		СА	1,8		;СЧ-К ПРОХОДОВ + 1
	   00 077 042 0010	1079		ВИ	8
00 0000557 07 012 0777775	1080		СР	ЧПВТ,7
	   07 050 0000040	1081		УР	СТП,7
00 0000560 07 030 0000050	1082		ПБ	НАЧТ1,7		;ПОВТОР
				1083	
	   00 072 0000000
   0000561			1084	ПЕРЕПТ	
				1085	
				1086	; *******************************************************
				1087	; *							*
				1088	; *		     ПЕРЕПИСЬ ТЕСТА			*
				1089	; *							*
				1090	; * ДВА ВХОДА:						*
				1091	; *  ИЗ0В1 - ПЕРЕПИСЬ ИЗ 0-Й ГРУППЫ В 1-Ю ГРУППУ	*
				1092	; *  ИЗ1В0 - ПЕРЕПИСЬ ИЗ 1-Й ГРУППЫ В 0-Ю ГРУППУ	*
				1093	; * ВОЗВРАТ ПО И16					*
				1094	; *******************************************************
				1095	
   0000561			1096	ИЗ0В1
00 0000561 11 074 0000000	1097		ПА	,9		;АДРЕС ЧТЕНИЯ = 0-Й ГРУППЕ
	   00 072 0001000	1098		ПФ	01000
00 0000562 12 074 0000000	1099		ПА	,10		;АДРЕС ЗАПИСИ = 1-Й ГРУППЕ
	   00 030 0000565	1100		ПБ	ПЕРЕП
   0000563			1101	ИЗ1В0
00 0000563 00 072 0001000	1102		ПФ	01000
	   11 074 0000000	1103		ПА	,9		;АДРЕС ЧТЕНИЯ = 1-Й ГРУППЕ
00 0000564 12 074 0000000	1104		ПА	,10		;АДРЕС ЗАПИСИ = 0-Й ГРУППЕ
	   00 072 0000000
   0000565			1105	ПЕРЕП
				1106	
				1107	; * ПЕРЕПИСЬ ВХОДНЫХ ПАРАМЕТРОВ ------
				1108	
00 0000565 13 074 3777766	1109		ПА	-10,11
КАС2211 Файл OP1 : Лист 20 Дата 9.3.89 (0:3)


Тг   Адрес Код:		Строка	Текст

	   00 072 0000000
   0000566			1110	ПАРАМ
00 0000566 11 072 0000000	1111		ПФ	,9
	   13 010 0777777	1112		СЧ	НМКС+10,11
00 0000567 12 072 0000000	1113		ПФ	,10
	   13 000 0777777	1114		ЗЧ	НМКС+10,11
00 0000570 07 072 0000000	1115		ПФ	,7
	   13 033 0000566	1116		КЦ	ПАРАМ,11
				1117	
				1118	; * ПЕРЕПИСЬ ТЕСТА --------------
				1119	
00 0000571 12 077 044 0007	1120		ПИ	7,10		;НОВАЯ БАЗА
	   00 076 0000625	1121		УГ	К-ТОП+1		;ЛГ=1,ИС10:=ДЛИНА ТЕСТА
00 0000572 11 170 0000001	1122		СТК	1,9
	   12 177 0000001	1123		ЗТК	1,10
00 0000573 00 077 001 0000	1124		ВТ			;ВЫТОЛКНЕМ В ОП
	   00 072 0000000
   0000574			1125	ВОЗВ
00 0000574 16 030 0000000	1126		ПБ	,14
				1127	
	   00 072 0000000
   0000575			1128	ФОРАДР
				1129	
				1130	; *******************************************************
				1131	; *							*
				1132	; *	 ФОРМИРОВАНИЕ НАЧАЛЬНОГО АДРЕСА ПРОВЕРКИ	*
				1133	; *							*
				1134	; * ДВА ВХОДА:						*
				1135	; *  НАЧАДР - ПРОВЕРКА НАЧИНАЕТСЯ С МЛАДШИХ АДРЕСОВ ОП	*
				1136	; *  КОНАДР - ПРОВЕРКА НАЧИНАЕТСЯ СО СТАРШИХ АДРЕСОВ ОП *
				1137	; * ВОЗВРАТ ПО И16					*
				1138	; * ПРИ ВЫХОДЕ:						*
				1139	; *  И1 - НАЧАЛЬНЫЙ АДРЕС ПРОВЕРКИ			*
				1140	; *******************************************************
				1141	
   0000575			1142	НАЧАДР
00 0000575 01 074 0000000	1143		ПА	,1		;НАЧ.АДРЕС = 0-Й ГРУППЕ
	   07 072 0000000	1144		ПФ	,7
00 0000576 07 041 0000601	1145		ИН	ФОРАД,7
	   00 072 0001000	1146		ПФ	01000
00 0000577 01 074 0000000	1147		ПА	,1		;НАЧ.АДРЕС = 1-Й ГРУППЕ
	   07 030 0000601	1148		ПБ	ФОРАД,7
   0000600			1149	КОНАДР
00 0000600 00 072 0003777	1150		ПФ	03777
	   01 074 0007777	1151		ПА	07777,1		;НАЧНЕМ С КОНЦА ОП
   0000601			1152	ФОРАД
00 0000601 07 072 0000000	1153		ПФ	,7
	   02 040 0000605	1154		ИР	ДАЙГРУ,2	;БЛОК НЕ ФИКСИРОВАН
00 0000602 00 077 042 0001	1155		ВИ	1
	   00 115 0000003	1156		ЛСЛ	3
00 0000603 00 112 0000003	1157		СРЛ	3		;УБРАЛИ РАЗРЯДЫ НОМЕРА БЛОКА
	   07 015 0777771	1158		ЛС	НБЛК,7
00 0000604 00 077 040 0001	1159		УИ	1		;УСТАНОВИЛИ РАЗРЯДЫ НОМЕРА БЛОКА
	   00 072 0000000
   0000605			1160	ДАЙГРУ
00 0000605 07 072 0000000	1161		ПФ	,7
	   03 040 0000612	1162		ИР	ДАЙМКС,3	;ГРУППА НЕ ФИКСИРОВАНА
00 0000606 07 010 0777767	1163		СЧ	НГРУ,7
	   00 077 026 1753	1164		СД	1024-21
00 0000607 07 000 0000626	1165		ЗЧ	РАЯ,7
	   00 077 042 0001	1166		ВИ	1
00 0000610 00 072 0000777	1167		ПФ	0777
КАС2211 Файл OP1 : Лист 21 Дата 9.3.89 (0:3)


Тг   Адрес Код:		Строка	Текст

	   00 111 0007777	1168		ЛУЛ	07777		;УБРАЛИ РАЗРЯДЫ ГРУППЫ
00 0000611 07 015 0000626	1169		ЛС	РАЯ,7
	   00 077 040 0001	1170		УИ	1		;УСТАНОВИЛИ РАЗРЯДЫ ГРУППЫ
   0000612			1171	ДАЙМКС
00 0000612 16 072 0000000	1172		ПФ	,14
	   04 040 0000000	1173		ИР	,4		;МКСХ ФИКСИРОВАНА
00 0000613 07 010 0777765	1174		СЧ	НМКС,7
	   00 111 0000007	1175		ЛУЛ	7
00 0000614 00 077 026 1776	1176		СД	1024-2
	   07 000 0000626	1177		ЗЧ	РАЯ,7
00 0000615 00 077 042 0001	1178		ВИ	1
	   00 115 0000034	1179		ЛСЛ	034
00 0000616 00 112 0000034	1180		СРЛ	034		;УБРАЛИ РАЗРЯДЫ НОМЕРА МКСХ
	   07 015 0000626	1181		ЛС	РАЯ,7
00 0000617 00 077 040 0001	1182		УИ	1		;УСТАНОВИЛИ РАЗРЯДЫ НОМЕРА ГРУППЫ
	   16 030 0000000	1183		ПБ	,14		;ВОЗВРАТ		
				1184	
				1185	; *******************************************************
				1186	; *			КОНСТАНТЫ			*
				1187	; *******************************************************
				1188	
   0000620			1189	ПК				;КОДЫ ПРОВЕРКИ
00 0000620 000 000 000 000	1190		.КОД	0		;'ВСЕ 0'
	   000 000 000 000
00 0000621 377 377 377 377	1191		.КОД	-1		;'ВСЕ 1'
	   377 377 377 377
00 0000622 002 000 000 000	1192		.КОД	1<57		;'ЕДИНИЦА 58 РАЗРЯДА'
	   000 000 000 000
				1193	
00 0000623 000 000 000 377	1194	ПРИП	.КОД	0377<32		;НАЧ.КОНСТАНТА ПРИПИСКИ
	   000 000 000 000
00 0000624 000 000 001 000	1195	Е41Е9	.КОД	1<32!1<8
	   000 000 001 000
00 0000625 000 000 000 000	1196	КСУМТ	.КОД	0		;КОНТРОЛЬНАЯ СУММА ТЕСТА
	   000 000 000 000
				1197	
				1198	; *******************************************************
				1199	; *		    РАБОЧИЕ ЯЧЕЙКИ ТЕСТА		*
				1200	; *******************************************************
				1201	
00 0000626 0 0 0 0 0 0 0 0	1202	РАЯ	.ПАМ	1
00 0000627 0 0 0 0 0 0 0 0	1203	ЭТАЛОН	.ПАМ	1		;КОД РОСПИСИ
00 0000630 0 0 0 0 0 0 0 0	1204	ОБРКО	.ПАМ	1
				1205	
				1206	; *******************************************************
				1207	; *		    ЭКВИВАЛЕНТНОСТИ			*
				1208	; *******************************************************
				1209	
	  =00000000621		1210	ВСЕЕД	.ЭКВ	ПК+1		;'ВСЕ 1'
	  =00000000622		1211	Е58	.ЭКВ	ПК+2	
	  =00000777777		1212	ФПАР	.ЭКВ	0777777		;ФЛАГ ЗАДАНИЯ ПАРАМЕТРОВ
	  =00000777776		1213	ФПВТ	.ЭКВ	0777776		;ФЛАГ ЧИСЛА ПРОХОДОВ
	  =00000777775		1214	ЧПВТ	.ЭКВ	0777775		;ЧИСЛО ПРОХОДОВ
	  =00000777774		1215	ФНПР	.ЭКВ	0777774		;ФЛАГ НОМЕРА ПРИМЕРА
	  =00000777773		1216	НПРМ	.ЭКВ	0777773		;НОМЕР ПРИМЕРА
	  =00000777772		1217	ФБЛК	.ЭКВ	0777772		;ФЛАГ НОМЕРА БЛОКА
	  =00000777771		1218	НБЛК	.ЭКВ	0777771		;НОМЕР БЛОКА
	  =00000777770		1219	ФГРУ	.ЭКВ	0777770		;ФЛАГ НОМЕРА ГРУППЫ
	  =00000777767		1220	НГРУ	.ЭКВ	0777767		;НОМЕР ГРУППЫ
	  =00000777766		1221	ФМКС	.ЭКВ	0777766		;ФЛАГ НОМЕРА МИКРОСХЕМЫ
	  =00000777765		1222	НМКС	.ЭКВ	0777765		;НОМЕР МИКРОСХЕМЫ
	  =00000000625		1223	К	.ЭКВ	КСУМТ
КАС2211 Файл OP1 : Лист 22 Дата 9.3.89 (0:3)


Тг   Адрес Код:		Строка	Текст

				1224	
				1225		.КНЦ	;ТЕСТА ОПЕРАТИВНОЙ ПАМЯТИ

Начало трансляции	00:00:30.
Конец  трансляции	00:03:23.
Транслировано строк	1225
