КАС2011 Файл SP : Лист 1 Дата 18.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

				1	; ************************************************************
				2	; *							     *
				3	; *		ТЕСТ ПРОВЕРКИ СИСТЕМНОЙ ПАМЯТИ		     *
				4	; *							     *
				5	; * В ТЕСТЕ ПРОВЕРЯЕТСЯ СИСТЕМНАЯ ПАМЯТЬ, Т.Е. ТА ЧАСТЬ ОПЕ- * 
				6	; * РАТИВНОЙ ПАМЯТИ, ПРИ ОБРАЩЕНИИ К КОТОРОЙ НЕ ПРОИЗВОДИТСЯ *
				7	; * ПРИПИСКА. ТЕСТ ВКЛЮЧАЕТ СЛЕДУЮЩИЕ ЧАСТИ:		     *
				8	; * ЕТ СЛЕДУЮЩИЕ ЧАСТИ.					     *
				9	; *  1.ПРОВЕРКА ИНФОРМАЦИОННОЙ ЧАСТИ НАКОПИТЕЛЯ		     *
				10	; *   1.1.ПРОВЕРКА НА КОДАХ 'ВСЕ 0' И 'ВСЕ 1'		     *
				11	; *   1.2.ПРОВЕРКА ТЕСТОМ 'МАРШ'			     *
				12	; *   1.3.ПРОВЕРКА ТЕСТОМ 'ДИАГОНАЛЬ'			     *
				13	; *  2.ПРОВЕРКА РАЗРЯДОВ ХЭММИНГА			     *
				14	; *   2.1.ПРОВЕРКА ПРЯМЫМ И ОБРАТНЫМ КОДОМ		     *
				15	; *   2.2.ПРОВЕРКА ТЕСТОМ 'МАРШ'			     *
				16	; *   2.3.ПРОВЕРКА ТЕСТОМ 'ДИАГОНАЛЬ'			     *
				17	; * ЗАГРУЖАЕМЫЙ В ПЕРВУЮ ПОЛОВИНУ СИСТЕМНОЙ ПАМЯТИ ТЕСТ ПРО- *
				18	; * ВЕРЯЕТ ВТОРУЮ ПОЛОВИНУ /ИНФОРМАЦИОННЫЕ РАЗРЯДЫ И РАЗРЯДЫ *
				19	; * КОДА ХЭММИНГА/. ПОСЛЕ ЭТОГО ТЕСТ ПЕРЕПИСЫВАЕТСЯ В ПРОВЕ- *
				20	; * РЕННУЮ ОБЛАСТЬ И ПРОВЕРЯЕТСЯ ПЕРВАЯ ПОЛОВИНА. ПОСЛЕ ПРО- *
				21	; * ВЕРКИ ПАМЯТИ ТЕСТ СНОВА ПЕРЕПИСЫВАЕТСЯ В ПЕРВУЮ ПОЛОВИНУ *
				22	; * СИСТЕМНОЙ ПАМЯТИ.					     * 
				23	; *							     * 
				24	; * ОПИСАНИЕ АЛГОРИТМА:					     *
				25	; *  ОПИСАНИЯ АЛГОРИТМОВ ПРИВЕДЕНЫ В КАЖДОЙ ЧАСТИ ТЕСТА	     *	    
				26	; *							     *
				27	; * ОСТАНОВЫ ПРИ РАБОТЕ ТЕСТА:				     *
				28	; *  СТОП 40(8) - ТЕСТ ВЫПОЛНЕН				     *
				29	; *  СТОП 1 - НЕ СОВПАЛА КОНТРОЛЬНАЯ СУММА ТЕСТА	     *
				30	; *  СТОП 2-37(8) - ЛОВУШКИ ПРЕРЫВАНИЙ И ЭКСТРАКОДОВ	     *
				31	; * ОСТАНОВЫ В СЛУЧАЕ ОШИБОК ОПИСАНЫ В КАЖДОЙ ЧАСТИ ТЕСТА.   *
				32	; *							     *
				33	; * ИСПОЛЬЗУЕМЫЕ РЕГИСТРЫ:				     *
				34	; *  И7	 - БАЗОВЫЙ РЕГИСТР				     *
				35	; *  И10 - СЧЕТЧИК ЧИСЛА ПРОХОДОВ ТЕСТА			     *
				36	; * ЗДЕСЬ И ДАЛЕЕ В КОММЕНТАРИЯХ НОМЕРА СПЕЦИАЛЬНЫХ И ИНДЕК- *
				37	; * СНЫХ РЕГИСТРОВ УКАЗЫВАЮТСЯ В 8-М ВИДЕ.		     *
				38	; *							     *
				39	; * ЗАМЕЧАНИЯ:						     *
				40	; *  1)ТЕСТ РАССЧИТАН НА 256К СЛОВ СИСТЕМНОЙ ПАМЯТИ. ПРИ ПЕ- *
				41	; *    РЕХОДЕ НА БОЛЬШИЙ ОБ'ЕМ НЕОБХОДИМО ВНЕСТИ ИЗМЕНЕНИЯ В *
				42	; *    РАЗДЕЛ 'ЭКВИВАЛЕНТНОСТИ'.			     *
				43	; *  2)КОНТРОЛЬНОЕ СУММИРОВАНИЕ ВЫПОЛНЯЕТСЯ ПРИ КАЖДОЙ ПЕРЕ- *
				44	; *    ПИСИ ТЕСТА.					     *
				45	; ************************************************************
				46	
				47		.ОБЛ	СП(1)
00 0000001 00 077 006 0020	48	ТСП	ЗР	020		;ПКЛ=0,ПКП=0
	   00 030 0000041	49		ПБ	НАЧТ
				50	
				51	; *******************************************************
				52	; *							*
				53	; *	     ЛОВУШКИ ПРЕРЫВАНИЙ И ЭКСТРАКОДОВ		*
				54	; * ИНДИКАЦИЯ:						*
				55	; *  48-33РР. СМ - ГРВП ПРИ ОСТ 2			*
				56	; *  31-01РР. СМ - РР ПРИ ОСТ 4,5,6,7			*
				57	; *******************************************************
				58	
00 0000002 00 077 002 0047	59	ПВНЕ	ЧР	047
	   00 077 007 0002	60		ОСТ	02		;ВНЕШНЕЕ ПРЕРЫВАНИЕ
00 0000003 00 077 007 0003	61	ПЭР3	ОСТ	03		;ЭКСТРАКОД В РЕЖИМЕ 3
	   00 072 0000000
КАС2011 Файл SP : Лист 2 Дата 18.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

00 0000004 00 077 002 0037	62	ПВ12	ЧР	037
	   00 077 007 0004	63		ОСТ	04		;ВНУТРЕННЕЕ ПРЕРЫВАНИЕ В РЕЖИМЕ 1-2
00 0000005 00 077 002 0037	64	ПЗ12	ЧР	037
	   00 077 007 0005	65		ОСТ	05		;ЗАПРЕЩЕННАЯ КОМАНДА В РЕЖИМЕ 1-2
00 0000006 00 077 002 0037	66	ПВР3	ЧР	037
	   00 077 007 0006	67		ОСТ	06		;ВНУТРЕННЕЕ ПРЕРЫВАНИЕ В РЕЖИМЕ 3
00 0000007 00 077 002 0037	68	ПЗК3	ЧР	037
	   00 077 007 0007	69		ОСТ	07		;ЗАПРЕЩЕННАЯ КОМАНДА В РЕЖИМЕ 3
00 0000010 00 077 007 0010	70	ПЭ50	ОСТ	010		;ЭКСТРАКОД 50(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000011 00 077 007 0011	71	ПЭ51	ОСТ	011		;ЭКСТРАКОД 51(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000012 00 077 007 0012	72	ПЭ52	ОСТ	012		;ЭКСТРАКОД 52(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000013 00 077 007 0013	73	ПЭ53	ОСТ	013		;ЭКСТРАКОД 53(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000014 00 077 007 0014	74	ПЭ54	ОСТ	014		;ЭКСТРАКОД 54(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000015 00 077 007 0015	75	ПЭ55	ОСТ	015		;ЭКСТРАКОД 55(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000016 00 077 007 0016	76	ПЭ56	ОСТ	016		;ЭКСТРАКОД 56(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000017 00 077 007 0017	77	ПЭ57	ОСТ	017		;ЭКСТРАКОД 57(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000020 00 077 007 0020	78	ПЭ60	ОСТ	020		;ЭКСТРАКОД 60(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000021 00 077 007 0021	79	ПЭ61	ОСТ	021		;ЭКСТРАКОД 61(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000022 00 077 007 0022	80	ПЭ62	ОСТ	022		;ЭКСТРАКОД 62(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000023 00 077 007 0023	81	ПЭ63	ОСТ	023		;ЭКСТРАКОД 63(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000024 00 077 007 0024	82	ПЭ64	ОСТ	024		;ЭКСТРАКОД 64(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000025 00 077 007 0025	83	ПЭ65	ОСТ	025		;ЭКСТРАКОД 65(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000026 00 077 007 0026	84	ПЭ66	ОСТ	026		;ЭКСТРАКОД 66(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000027 00 077 007 0027	85	ПЭ67	ОСТ	027		;ЭКСТРАКОД 67(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000030 00 077 007 0030	86	ПЭ70	ОСТ	030		;ЭКСТРАКОД 70(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000031 00 077 007 0031	87	ПЭ71	ОСТ	031		;ЭКСТРАКОД 71(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000032 00 077 007 0032	88	ПЭ72	ОСТ	032		;ЭКСТРАКОД 72(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000033 00 077 007 0033	89	ПЭ73	ОСТ	033		;ЭКСТРАКОД 73(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000034 00 077 007 0034	90	ПЭ74	ОСТ	034		;ЭКСТРАКОД 74(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000035 00 077 007 0035	91	ПЭ75	ОСТ	035		;ЭКСТРАКОД 75(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000036 00 077 007 0036	92	ПЭ76	ОСТ	036		;ЭКСТРАКОД 76(8) РЕЖИМА 1-2
	   00 072 0000000
00 0000037 00 077 007 0037	93	ПЭ77	ОСТ	037		;ЭКСТРАКОД 77(8) РЕЖИМА 1-2
				94	; *******************************************************
				95	; *		    ХОРОШИЙ ОСТАНОВ			*
				96	; *******************************************************
				97	
	   00 072 0000000
00 0000040 17 074 0000002	98	СТП	ПА	2,15
	   17 077 007 0040	99		ОСТ	040,15		;ХОРОШИЙ ОСТАНОВ
КАС2011 Файл SP : Лист 3 Дата 18.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

				100	
00 0000041 10 074 0000000	101	НАЧТ	ПА	,8		;СЧ-К ПРОХОДОВ := 0    
	   00 010 0000000	102		СЧ	0
00 0000042 00 077 050 0011	103		ИУ	011		;ИС1:=0
	   07 074 0000000	104		ПА	0,7		;УСТАНОВКА БАЗЫ ТЕСТА
   0000043			105	КСУМ
				106	
				107	; *******************************************************
				108	; *		КОНТРОЛЬНОЕ СУММИРОВАНИЕ		*
				109	; *******************************************************
				110	
00 0000043 07 072 0000000	111		ПФ	,7
	   03 074 0000447	112		ПА	РАЯ,3		;И3:=АДРЕС ЯЧ-КИ ПОДСЧЕТА КС
00 0000044 03 064 0000000	113		ЗН	,3
	   12 074 3777334	114		ПА	ТСП-КСУМТ+1,10	;И12:=1-ДЛИНА ТЕСТА
00 0000045 07 072 0000000	115	КСМ	ПФ	,7
	   12 010 0000445	116		СЧ	КСУМТ-1,10
00 0000046 03 013 0000000	117		ЦС	,3
	   03 000 0000000	118		ЗЧ	,3		;СУММИРУЕМ ОЧЕРЕДНОЕ СЛОВО
00 0000047 07 072 0000000	119		ПФ	,7
	   12 033 0000045	120		КЦ	КСМ,10		;КЦ КОНТРОЛЬНОГО СУММИРОВАНИЯ
00 0000050 07 012 0000446	121		СР	КСУМТ,7		;СРАВНИМ С ЭТАЛОННОЙ КС
	   07 030 0000052	122		ПБ	НАЧТ1,7		;УР НАЧТ1,7
				123	
				124	; *******************************************************
				125	; *							*
				126	; *		НЕ СОВПАЛА КОНТРОЛЬНАЯ СУММА		*
				127	; *							*
				128	; * ИНДИКАЦИЯ:						*
				129	; *  ВР	 - ЭТАЛОННАЯ КОНТРОЛЬНАЯ СУММА			*
				130	; *  СМ	 - КОД НЕСРАВНЕНИЯ				*
				131	; *  РМР - ПОДСЧИТАННАЯ СУММА				*
				132	; *******************************************************
				133	
00 0000051 00 077 007 0001	134		ОСТ	1
	   07 030 0000043	135		ПБ	КСУМ,7		;ПОВТОР СУМ;МИРОВАНИЯ
   0000052			136	НАЧТ1
				137	
				138	; *******************************************************
				139	; *	     ПРОВЕРКА ИНФОРМАЦИОННЫХ РАЗРЯДОВ		*
				140	; *******************************************************
				141	
   0000052			142	ЗППЧТП
				143	
				144	; *******************************************************
				145	; *							*
				146	; *	    ПРОВЕРКА ТЕСТОМ 'ЗАПИСЬ-СЧИТЫВАНИЕ'		*
				147	; *							*
				148	; * АЛГОРИТМ ПРОВЕРКИ:					*
				149	; *  КОД 'ВСЕ 0' ЗАПИСЫВАЕТСЯ ПО ВСЕМ АДРЕСАМ ПРОВЕРЯЕ- *
				150	; *  МОЙ ОБЛАСТИ. ПОСЛЕ ЭТОГО ВЫПОЛНЯЕТСЯ ЧТЕНИЕ С КОН- * 
				151	; *  ТРОЛЕМ. ПРИ НЕСОВПАДЕНИИ ПРОГРАММА ВЫЙДЕТ НА ОСТА- *
				152	; *  НОВ С АДРЕСОМ 50(8). ТА ЖЕ ПОСЛЕДОВАТЕЛЬНОСТЬ ДЕЙ- *
				153	; *  СТВИЙ ВЫПОЛНЯЕТСЯ ДЛЯ КОДА 'ВСЕ 1'.		* 
				154	; *  ПОРЯДОК ПЕРЕБОРА АДРЕСОВ СЛЕДУЮЩИЙ:		*
				155	; *   БЛОК =>ГРУППА =>МИКРОСХЕМА =>КОЛОНКА =>СТРОКА	*
				156	; *							*
				157	; * РАСПРЕДЕЛЕНИЕ РЕГИСТРОВ:				*
				158	; *  И1	 - АДРЕС ЗАПИСИ/ЧТЕНИЯ				*
				159	; *  И2	 - ТЕКУЩИЙ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ		*
				160	; *  И3	 - ТЕКУЩИЙ АДРЕС ПЕРЕБОРА ПО СТРОКАМ		*
				161	; *  И4	 - АДРЕС ЭТАЛОННОГО КОДА			*
КАС2011 Файл SP : Лист 4 Дата 18.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

				162	; *  И11 - ПАРАМЕТР ЦИКЛА ПО БЛОКАМ			*
				163	; *  И12 - ПАРАМЕТР ЦИКЛА ПО МИКРОСХЕМАМ		*
				164	; *  И13 - ПАРАМЕТР ЦИКЛА ПО КОЛОНКАМ			*
				165	; *  И14 - ПАРАМЕТР ЦИКЛА ПО СТРОКАМ			*
				166	; *  И15 - ПАРАМЕТР ЦИКЛА ПО ПРОВЕРОЧНЫМ КОДАМ		*
				167	; * ЗАМЕЧАНИЕ:						*
				168	; *  ПРИ ПРОВЕРКЕ СИСТЕМНОЙ ПАМЯТИ РАЗРЯДЫ НОМЕРА ГРУП- *
				169	; *  ПЫ/23-22РР. АДРЕСА/ РАВНЫ 0.			*
				170	; *******************************************************
				171	
00 0000052 15 074 3777777	172		ПА	-1,13		;ДВА КОДА ПРОВЕРКИ('ВСЕ 0' И 'ВСЕ 1')
	   07 072 0000000	173		ПФ	,7
00 0000053 04 074 0000443	174		ПА	ПК,4		;И4:=АДРЕС КОДА ПРОВЕРКИ
				175	
	   00 072 0000000
   0000054			176	ЗПЧТ
				177	
				178	; *******************************************************
				179	; *			РОСПИСЬ ОП			*
				180	; *******************************************************
				181	
00 0000054 04 010 0000000	182		СЧ	,4		;СМ:=КОД ПРОВЕРКИ
				183	
				184	; * И1:=НАЧ. АДРЕС ПРОВЕРКИ --------
				185	
	   01 074 0000000	186		ПА	,1
00 0000055 07 072 0000000	187		ПФ	,7
	   07 041 0000057	188		ИН	ЗПП,7
00 0000056 01 074 0400000	189		ПА	ПОЛПАМ,1
				190	
	   00 072 0000000
   0000057			191	ЗПП
00 0000057 01 077 044 0003	192		ПИ	3,1		;НАЧ.АДРЕС ПЕРЕБОРА ПО СТРОКАМ
	   14 074 3777401	193		ПА	0-ЧС,12		;УСТ-КА СЧЕТЧИКА СТРОК
   0000060			194	ЗПС
00 0000060 13 074 3777761	195		ПА	0-ЧК,11		;УСТ-КА СЧЕТЧИКА КОЛОНОК
	   03 077 044 0002	196		ПИ	2,3		;НАЧ./ТЕКУЩИЙ/ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ
   0000061			197	ЗПК
00 0000061 12 074 3777771	198		ПА	0-ЧМ,10		;УСТ-КА СЧЕТЧИКА МИКРОСХЕМ
	   00 072 0000000
   0000062			199	ЗПМ
00 0000062 11 074 3777775	200		ПА	0-ЧБ,9		;УСТ-КА СЧЕТЧИКА БЛОКОВ
	   00 072 0000000
   0000063			201	ЗПБ
00 0000063 01 000 0000000	202		ЗЧ	0,1
	   01 075 0000001	203		СА	1,1		;НОВЫЙ БЛОК ИЛИ МКСХ
00 0000064 07 072 0000000	204		ПФ	,7
	   11 033 0000063	205		КЦ	ЗПБ,9		;КЦ ЗАПИСИ ПО БЛОКАМ
00 0000065 07 072 0000000	206		ПФ	,7
	   12 033 0000062	207		КЦ	ЗПМ,10		;КЦ ЗАПИСИ ПО МКСХ
00 0000066 02 075 0020000	208		СА	020000,2	;НОВАЯ КОЛОНКА
	   02 077 044 0001	209		ПИ	1,2
00 0000067 07 072 0000000	210		ПФ	,7
	   13 033 0000061	211		КЦ	ЗПК,11		;КЦ ЗАПИСИ ПО КОЛОНКАМ
00 0000070 03 075 0000040	212		СА	040,3		;НОВАЯ СТРОКА
	   03 077 044 0001	213		ПИ	1,3
00 0000071 07 072 0000000	214		ПФ	,7
	   14 033 0000060	215		КЦ	ЗПС,12		;КЦ ЗАПИСИ ПО СТРОКАМ
00 0000072 00 077 001 0000	216		ВТ			;ВЫТОЛКНЕМ БРЗ В ОП
	   00 072 0000000
   0000073			217	ЧТОП
				218	
КАС2011 Файл SP : Лист 5 Дата 18.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

				219	; *******************************************************
				220	; *		     ЧТЕНИЕ И СРАВНЕНИЕ			*
				221	; *******************************************************
				222	
				223	; * И1:=НАЧ. АДРЕС ПРОВЕРКИ
				224	
00 0000073 01 074 0000000	225		ПА	0,1
	   07 072 0000000	226		ПФ	,7
00 0000074 07 041 0000075	227		ИН	ЧТП,7
	   01 074 0400000	228		ПА	ПОЛПАМ,1
				229	
   0000075			230	ЧТП
00 0000075 01 077 044 0003	231		ПИ	3,1		;НАЧ.АДРЕС ПЕРЕБОРА ПО СТРОКАМ
	   14 074 3777401	232		ПА	0-ЧС,12		;УСТ-КА СЧЕТЧИКА СТРОК
   0000076			233	ЧТС
00 0000076 13 074 3777761	234		ПА	0-ЧК,11		;УСТ-КА СЧЕТЧИКА КОЛОНОК
	   03 077 044 0002	235		ПИ	2,3		;НАЧ./ТЕКУЩИЙ/ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ
   0000077			236	ЧТК
00 0000077 12 074 3777771	237		ПА	0-ЧМ,10		;УСТ-КА СЧЕТЧИКА МИКРОСХЕМ
	   00 072 0000000
   0000100			238	ЧТМ
00 0000100 11 074 3777775	239		ПА	0-ЧБ,9		;УСТ-КА СЧЕТЧИКА БЛОКОВ
	   00 072 0000000
   0000101			240	ЧТБ
00 0000101 07 072 0000000	241		ПФ	,7
	   01 040 0000106	242		ИР	КЦЧТБ,1		;0-Ю ЯЧЕЙКУ НЕ ЧИТАЕМ
00 0000102 01 010 0000000	243		СЧ	0,1
	   04 012 0000000	244		СР	0,4		;СРАВНИМ С ЭТАЛОННЫМ КОДОМ
00 0000103 07 050 0000105	245		УР	ЧТ,7
				246	
				247	; *******************************************************
				248	; *							*
				249	; *		    ОШИБКА НЕСРАВНЕНИЯ			*
				250	; *							*
				251	; * ИНДИКАЦИЯ:						*
				252	; *  ВР	 - ЭТАЛОННОЕ ЗНАЧЕНИЕ				*
				253	; *  СМ	 - КОД НЕСРАВНЕНИЯ				*
				254	; *  РМР - СЧИТАННОЕ ЗНАЧЕНИЕ				*
				255	; *  И1	 - АДРЕС ЧТЕНИЯ					*
				256	; *******************************************************
				257	
	   00 072 0000000
00 0000104 00 077 007 0050	258	СТПОШ	ОСТ	050
	   07 030 0000105	259		ПБ	ЧТ,7		;ЗДЕСЬ БУДЕТ ПЕРЕХОД НА ДИАГНОСТИРОВАНИЕ
   0000105			260	ЧТ
00 0000105 01 075 0000001	261		СА	1,1		;НОВЫЙ БЛОК ИЛИ МКСХ
	   00 072 0000000
00 0000106 07 072 0000000	262	КЦЧТБ	ПФ	,7
	   11 033 0000101	263		КЦ	ЧТБ,9		;КЦ ЧТ ПО БЛОКАМ
00 0000107 07 072 0000000	264		ПФ	,7
	   12 033 0000100	265		КЦ	ЧТМ,10
00 0000110 02 075 0020000	266		СА	020000,2	;НОВАЯ КОЛОНКА
	   02 077 044 0001	267		ПИ	1,2
00 0000111 07 072 0000000	268		ПФ	,7
	   13 033 0000077	269		КЦ	ЧТК,11		;КЦ ЧТ ПО КОЛОНКАМ
00 0000112 03 075 0000040	270		СА	040,3		;НОВАЯ СТРОКА
	   03 077 044 0001	271		ПИ	1,3
00 0000113 07 072 0000000	272		ПФ	,7
	   14 033 0000076	273		КЦ	ЧТС,12		;КЦ ЧТ ПО СТРОКАМ
00 0000114 04 075 0000001	274		СА	1,4		;НОВЫЙ КОД ПРОВЕРКИ
	   07 072 0000000	275		ПФ	,7
00 0000115 15 033 0000054	276		КЦ	ЗПЧТ,13		;КЦ ЗП/ЧТ
КАС2011 Файл SP : Лист 6 Дата 18.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

				277	
	   00 072 0000000
   0000116			278	МАРШ
				279	
				280	; *******************************************************
				281	; *							*
				282	; *		  ПРОВЕРКА ТЕСТОМ 'МАРШ'		*
				283	; *							*
				284	; * АЛГОРИТМ ПРОВЕРКИ:					*
				285	; *  АНАЛОГИЧЕН АЛГОРИТМУ ТЕСТА 'ЗАПИСЬ-СЧИТЫВАНИЕ', НО *
				286	; *  СРАЗУ ЖЕ ПОСЛЕ СЧИТЫВАНИЯ ПО АДРЕСУ СЧИТЫВАНИЯ ЗА- *
				287	; *  ПИСЫВАЕТСЯ ОБРАТНЫЙ КОД.				*
				288	; *  ПОРЯДОК ПЕРЕБОРА АДРЕСОВ:				*
				289	; *  1)БЛОК =>ГРУППА =>МИКРОСХЕМА =>КОЛОНКА =>СТРОКА	*
				290	; *    (ПО ВОЗРАСТАНИЮ АДРЕСОВ)				*
				291	; *  2)БЛОК =>ГРУППА =>МИКРОСХЕМА =>КОЛОНКА =>СТРОКА	*
				292	; *    (ПО УБЫВАНИЮ АДРЕСОВ)				*
				293	; *  ЕСЛИ НЕСРАВНЕНИЕ С КОДОМ РОСПИСИ ЗАФИКСИРОВАНО ПРИ *
				294	; *  ПЕРЕБОРЕ АДРЕСОВ ПО ВОЗРАСТАНИЮ, ТО ПРОГРАММА ВЫЙ- *
				295	; *  ДЕТ НА ОСТАНОВ С АДРЕСОМ 51(8), А ЕСЛИ ПРИ ПЕРЕБО- *
				296	; *  РЕ ПО УБЫВАНИЮ, ТО НА ОСТАНОВ С АДРЕСОМ 52(8).	*
				297	; *							*
				298	; * ИСПОЛЬЗУЕМЫЕ РЕГИСТРЫ:				*
				299	; *  И1	 - АДРЕС ЗАПИСИ/ЧТЕНИЯ				*
				300	; *  И2	 - ТЕКУЩИЙ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ		*
				301	; *  И3	 - ТЕКУЩИЙ АДРЕС ПЕРЕБОРА ПО СТРОКАМ		*		      
				302	; *  И11 - ПАРАМЕТР ЦИКЛА ПО БЛОКАМ			*
				303	; *  И12 - ПАРАМЕТР ЦИКЛА ПО МИКРОСХЕМАМ		*
				304	; *  И13 - ПАРАМЕТР ЦИКЛА ПО КОЛОНКАМ			*
				305	; *  И14 - ПАРАМЕТР ЦИКЛА ПО СТРОКАМ			*
				306	; *							*
				307	; * ЗАМЕЧАНИЕ:						*
				308	; *  ПРИ ПРОВЕРКЕ СИСТЕМНОЙ ПАМЯТИ РАЗРЯДЫ НОМЕРА ГРУП- *
				309	; *  ПЫ/23-22РР. АДРЕСА/ РАВНЫ 0.			*  
				310	; *******************************************************
				311	
				312	; *******************************************************
				313	; *	    ПЕРЕБОР АДРЕСОВ ОТ МЛАДШИХ К СТАРШИМ	*
				314	; *******************************************************
				315	
				316	; * И1:=НАЧ. АДРЕС ПРОВЕРКИ --------
				317	
00 0000116 01 074 0000000	318		ПА	0,1
	   07 072 0000000	319		ПФ	,7
00 0000117 07 041 0000120	320		ИН	ЗМ1ЧМ1,7
	   01 074 0400000	321		ПА	ПОЛПАМ,1
   0000120			322	ЗМ1ЧМ1
				323	
				324	; *******************************************************
				325	; *			РОСПИСЬ ОП			*
				326	; *******************************************************
				327	
00 0000120 00 010 0000000	328		СЧ	0		;СМ:='ВСЕ 0'
	   01 077 044 0003	329		ПИ	3,1		;НАЧ.АДРЕС ПЕРЕБОРА ПО СТРОКАМ
00 0000121 14 074 3777401	330		ПА	0-ЧС,12		;УСТ-КА СЧЕТЧИКА СТРОК
	   00 072 0000000
   0000122			331	ЗПСМ1
00 0000122 13 074 3777761	332		ПА	0-ЧК,11		;УСТ-КА СЧЕТЧИКА КОЛОНОК
	   03 077 044 0002	333		ПИ	2,3		;НАЧ./ТЕКУЩИЙ/ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ
   0000123			334	ЗПКМ1
00 0000123 12 074 3777771	335		ПА	0-ЧМ,10		;УСТ-КА СЧЕТЧИКА МИКРОСХЕМ
	   00 072 0000000
КАС2011 Файл SP : Лист 7 Дата 18.3.89 (0:1)


Тг   Адрес Код:		Строка	Текст

   0000124			336	ЗПММ1
00 0000124 11 074 3777775	337		ПА	0-ЧБ,9		;УСТ-КА СЧЕТЧИКА БЛОКОВ И МКСХ
	   00 072 0000000
   0000125			338	ЗПБМ1
00 0000125 01 000 0000000	339		ЗЧ	0,1
	   01 075 0000001	340		СА	1,1		;НОВЫЙ БЛОК ИЛИ МКСХ
00 0000126 07 072 0000000	341		ПФ	,7
	   11 033 0000125	342		КЦ	ЗПБМ1,9		;КЦ ЗП ПО БЛОКАМ
00 0000127 07 072 0000000	343		ПФ	,7
	   12 033 0000124	344		КЦ	ЗПММ1,10	;КЦ ЗП ПО МКСХ
00 0000130 02 075 0020000	345		СА	020000,2	;НОВАЯ КОЛОНКА
	   02 077 044 0001	346		ПИ	1,2
00 0000131 07 072 0000000	347		ПФ	,7
	   13 033 0000123	348		КЦ	ЗПКМ1,11	;КЦ ЗП ПО КОЛОНКАМ
00 0000132 03 075 0000040	349		СА	040,3		;НОВАЯ СТРОКА
	   03 077 044 0001	350		ПИ	1,3
00 0000133 07 072 0000000	351		ПФ	,7
	   14 033 0000122	352		КЦ	ЗПСМ1,12	;КЦ ЗП ПО СТРОКАМ
00 0000134 00 077 001 0000	353		ВТ			;ВЫТОЛКНЕМ В ОП
	   00 072 0000000
   0000135			354	ЧТПМ1
				355	
				356	; *******************************************************
				357	; *		ЧТЕНИЕ С ИНВЕРТИРОВАНИЕМ		*
				358	; *******************************************************
				359	
				360	; * И1:=НАЧ. АДРЕС ПРОВЕРЯЕМОЙ ОБЛАСТИ --------
				361		
00 0000135 01 074 0000000	362		ПА	0,1
	   07 072 0000000	363		ПФ	,7
00 0000136 07 041 0000137	364		ИН	ЧТМ1,7
	   01 074 0400000	365		ПА	ПОЛПАМ,1
				366	
00 0000137 01 077 044 0003	367	ЧТМ1	ПИ	3,1		;НАЧ.АДРЕС ПЕРЕБОРА ПО СТРОКАМ
	   14 074 3777401	368		ПА	0-ЧС,12		;УСТ-КА СЧЕТЧИКА СТРОК
   0000140			369	ЧТСМ1
00 0000140 13 074 3777761	370		ПА	0-ЧК,11		;УСТ-КА СЧЕТЧИКА КОЛОНОК
	   03 077 044 0002	371		ПИ	2,3		;НАЧ./ТЕКУЩИЙ/ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ
   0000141			372	ЧТКМ1
00 0000141 12 074 3777771	373		ПА	0-ЧМ,10		;УСТ-КА СЧЕТЧИКА МКСХ
	   00 072 0000000
   0000142			374	ЧТММ1
00 0000142 11 074 3777775	375		ПА	0-ЧБ,9		;УСТ-КА СЧЕТЧИКА БЛОКОВ
	   00 072 0000000
   0000143			376	ЧТБМ1
00 0000143 07 072 0000000	377		ПФ	,7
	   01 040 0000147	378		ИР	ИНВЕРС1,1	;0-Ю ЯЧЕЙКУ НЕ ПРОВЕРЯЕМ
00 0000144 01 010 0000000	379		СЧ	,1
	   00 012 0000000	380		СР	0		;СРАВНИМ С ЭТАЛОНОМ
00 0000145 07 050 0000147	381		УР	ИНВЕРС1,7
				382	
				383	; *******************************************************
				384	; *							*
				385	; *	      ОШИБКА НЕСРАВНЕНИЯ В ТЕСТЕ 'МАРШ'		*
				386	; *	   (ПЕРЕБОР АДРЕСОВ ОТ МЛАДШИХ К СТАРШИМ)	*
				387	; *							*
				388	; * ИНДИКАЦИЯ:						*
				389	; *  ВР	 - ЭТАЛОННЫЙ КОД				*
				390	; *  СМ	 - КОД НЕСРАВНЕНИЯ				*
				391	; *  РМР - СЧИТАННЫЙ КОД				*
				392	; *  И1	 - АДРЕС СЧИТЫВАНИЯ				*
				393	; *******************************************************
КАС2011 Файл SP : Лист 8 Дата 18.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

				394	
	   00 072 0000000
00 0000146 00 077 007 0051	395	СТПМ1	ОСТ	051
	   07 030 0000147	396		ПБ	ИНВЕРС1,7	;ЗДЕСЬ БУДЕТ ПЕРЕХОД НА ДИАГНОСТИРОВАНИЕ
				397	
00 0000147 07 010 0000444	398	ИНВЕРС1 СЧ	ВСЕЕД,7
	   01 000 0000000	399		ЗЧ	0,1		;ЗАПИШЕМ ОБРАТНЫЙ КОД
00 0000150 01 075 0000001	400		СА	1,1		;НОВЫЙ БЛОК ИЛИ МКСХ
	   00 077 001 0000	401		ВТ			;ВЫТОЛКНЕМ В ОП
00 0000151 07 072 0000000	402	КЧТБМ1	ПФ	,7
	   11 033 0000143	403		КЦ	ЧТБМ1,9		;КЦ ЧТ ПО БЛОКАМ
00 0000152 07 072 0000000	404		ПФ	,7
	   12 033 0000142	405		КЦ	ЧТММ1,10	;КЦ ЧТ ПО МКСХ
00 0000153 02 075 0020000	406		СА	020000,2	;НОВАЯ КОЛОНКА
	   02 077 044 0001	407		ПИ	1,2
00 0000154 07 072 0000000	408		ПФ	,7
	   13 033 0000141	409		КЦ	ЧТКМ1,11	;КЦ ЧТ ПО КОЛОНКАМ
00 0000155 03 075 0000040	410		СА	040,3		;НОВАЯ СТРОКА
	   03 077 044 0001	411		ПИ	1,3
00 0000156 07 072 0000000	412		ПФ	,7
	   14 033 0000140	413		КЦ	ЧТСМ1,12	;КЦ ЧТ ПО СТРОКАМ
				414	
				415	; *******************************************************
				416	; *	    ПЕРЕБОР АДРЕСОВ ОТ СТАРШИХ К МЛАДШИМ	*
				417	; *******************************************************
				418	
   0000157			419	ЧТПМ2
				420	
				421	; * И1:=КОН. АДРЕС ПРОВЕРЯЕМОЙ ОБЛАСТИ --------
				422	
00 0000157 01 074 0377777	423		ПА	ПОЛПАМ-1,1
	   07 072 0000000	424		ПФ	,7
00 0000160 07 041 0000161	425		ИН	ЧТМ2,7
	   01 074 0777777	426		ПА	КОНСП,1
   0000161			427	ЧТМ2
				428	
				429	; *******************************************************
				430	; *		ЧТЕНИЕ С ИНВЕРТИРОВАНИЕМ		*
				431	; *******************************************************
				432	
00 0000161 01 077 044 0003	433		ПИ	3,1		;НАЧ.АДРЕС ПЕРЕБОРА ПО СТРОКАМ
	   14 074 3777401	434		ПА	0-ЧС,12		;УСТ-КА СЧЕТЧИКА СТРОК
   0000162			435	ЧТСМ2
00 0000162 13 074 3777761	436		ПА	0-ЧК,11		;УСТ-КА СЧЕТЧИКА КОЛОНОК
	   03 077 044 0002	437		ПИ	2,3		;НАЧ./ТЕКУЩИЙ/ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ
   0000163			438	ЧТКМ2
00 0000163 12 074 3777771	439		ПА	0-ЧМ,10		;УСТ-КА СЧЕТЧИКА МКСХ
	   00 072 0000000
   0000164			440	ЧТММ2
00 0000164 11 074 3777775	441		ПА	0-ЧБ,9		;УСТ-КА СЧЕТЧИКА БЛОКОВ
	   00 072 0000000
   0000165			442	ЧТБМ2
00 0000165 07 072 0000000	443		ПФ	,7
	   01 040 0000253	444		ИР	ТХЭМ,1		;0-Ю НЕ ПРОВЕРЯЕМ
00 0000166 01 010 0000000	445		СЧ	0,1
	   07 012 0000444	446		СР	ВСЕЕД,7		;СРАВНИМ С ЭТАЛОННЫМ КОДОМ
00 0000167 07 050 0000171	447		УР	ИНВЕРС2,7
				448	    
				449	; *******************************************************
				450	; *							*
				451	; *	      ОШИБКА НЕСРАВНЕНИЯ В ТЕСТЕ 'МАРШ'		*
				452	; *	   (ПЕРЕБОР АДРЕСОВ ОТ СТАРШИХ К МЛАДШИМ)	*      
КАС2011 Файл SP : Лист 9 Дата 18.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

				453	; *							*
				454	; * ИНДИКАЦИЯ:						*
				455	; *  ВР	 - ЭТАЛОННЫЙ КОД				*
				456	; *  СМ	 - КОД НЕСРАВНЕНИЯ				*
				457	; *  РМР - СЧИТАННЫЙ КОД				*
				458	; *  И1	 - АДРЕС СЧИТЫВАНИЯ				*
				459	; *******************************************************
				460	
	   00 077 007 0052	461		ОСТ	052
00 0000170 07 030 0000171	462		ПБ	ИНВЕРС2,7		;ЗДЕСЬ БУДЕТ ПЕРЕХОД НА ДИАГНОСТИКУ
				463	
	   00 072 0000000
00 0000171 00 010 0000000	464	ИНВЕРС2 СЧ	0
	   01 000 0000000	465		ЗЧ	,1		;ЗАПИШЕМ ОБРАТНЫЙ КОД
00 0000172 01 075 3777777	466		СА	-1,1		;НОВЫЙ БЛОК ИЛИ МКСХ
	   00 077 001 0000	467		ВТ			;ВЫТОЛКНЕМ В ОП
00 0000173 07 072 0000000	468		ПФ	,7
	   11 033 0000165	469		КЦ	ЧТБМ2,9		;КЦ ЧТ ПО БЛОКАМ
00 0000174 07 072 0000000	470		ПФ	,7
	   12 033 0000164	471		КЦ	ЧТММ2,10	;КЦ ЧТ ПО МКСХ
00 0000175 02 075 3760000	472		СА	-020000,2	;НОВАЯ КОЛОНКА
	   02 077 044 0001	473		ПИ	1,2
00 0000176 07 072 0000000	474		ПФ	,7
	   13 033 0000163	475		КЦ	ЧТКМ2,11	;КЦ ЧТ ПО КОЛОНКАМ
00 0000177 03 075 3777740	476		СА	-040,3		;НОВАЯ СТРОКА
	   03 077 044 0001	477		ПИ	1,3
00 0000200 07 072 0000000	478		ПФ	,7
	   14 033 0000162	479		КЦ	ЧТСМ2,12	;КЦ ЧТ ПО СТРОКАМ
00 0000201 07 030 0000253	480		ПБ	ТХЭМ,7		;ВРЕМЕННО:ОБХОД ТЕСТА 'ДИАГОНАЛЬ'
				481	    
	   00 072 0000000
   0000202			482	ДИАГ
				483	
				484	; *******************************************************
				485	; *							*
				486	; *		ПРОВЕРКА ТЕСТОМ 'ДИАГОНАЛЬ'		*
				487	; *							*
				488	; * АЛГОРИТМ ПРОВЕРКИ:					*
				489	; *  В ТЕСТЕ ПРОВЕРЯЮТСЯ УСИЛИТЕЛИ СЧИТЫВАНИЯ МИКРОСХЕМ *
				490	; *  ДИНАМИЧЕСКОГО ТИПА. В ВЫБРАННОЙ МИКРОСХЕМЕ(1-5,22, *
				491	; *  23РР. АДРЕСА) ПО ВСЕМ АДРЕСАМ ЗАПИСЫВАЕТСЯ ФОНОВЫЙ *
				492	; *  КОД. ЕСЛИ НОМЕР СТРОКИ В МИКРОСХЕМЕ(13-6РР.АДРЕСА) *
				493	; *  РАВЕН НОМЕРУ КОЛОНКИ(21-14РР.АДРЕСА), ТО ЗАПИСЫВА- *
				494	; *  ЕТСЯ КОД, ОБРАТНЫЙ ФОНОВОМУ. ЗАТЕМ ПО ВСЕМ АДРЕСАМ *
				495	; *  ВЫПОЛНЯЕТСЯ СЧИТЫВАНИЕ С КОНТРОЛЕМ. ПРИ НЕСОВПАДЕ- *
				496	; *  НИИ ТЕСТ ВЫХОДИТ НА ОСТАНОВ С АДРЕСОМ 53(8). ТЕ ЖЕ *
				497	; *  ДЕЙСТВИЯ ВЫПОЛНЯЮТСЯ С ЗАПИСЬЮ КОДА, ОБРАТНОГО ФО- *
				498	; *  НОВОМУ, ПРИ УСЛОВИИ: НОМЕР СТРОКИ = НОМЕРУ КОЛОНКИ *
				499	; *  + 1 И Т.Д.						*
				500	; *							*
				501	; * ИСПОЛЬЗУЕМЫЕ РЕГИСТРЫ:				*
				502	; *  И1	 - АДРЕС ЗАПИСИ/ЧТЕНИЯ				*
				503	; *  И2	 - ТЕКУЩИЙ АДРЕС ПЕРЕБОРА ПО БЛОКАМ И МКСХ	*
				504	; *  И3	 - АДРЕС ЭТАЛОННОГО КОДА			*
				505	; *  И4	 - НОМЕР КОЛОНКИ				*
				506	; *  И5	 - НОМЕР СТРОКИ					*
				507	; *  И6 -  УСЛОВИЕ					*
				508	; *  И11 - РАБОЧИЙ ДЛЯ ПРОВЕРКИ УСЛОВИЯ			*
				509	; *  И12 - ПАРАМЕТР ЦИКЛА ПО СТРОКАМ			*
				510	; *  И13 - ПАРАМЕТР ЦИКЛА ПО КОЛОНКАМ			*
				511	; *  И14 - ПАРАМЕТР ЦИКЛА ПО УСЛОВИЯМ			*
				512	; *  И15 - ПАРАМЕТР ЦИКЛА ПО БЛОКАМ И МИКРОСХЕМАМ	*
КАС2011 Файл SP : Лист 10 Дата 18.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

				513	; *******************************************************
				514	
				515	; * И1:= НАЧ.АДРЕС ПРОВЕРЯЕМОЙ ОБЛАСТИ --------
				516	
00 0000202 01 074 0000000	517		ПА	0,1
	   07 072 0000000	518		ПФ	,7
00 0000203 07 041 0000204	519		ИН	ЗПДЧПД,7
	   01 074 0400000	520		ПА	ПОЛПАМ,1
				521	
00 0000204 15 074 3777741	522	ЗПДЧПД	ПА	0-ЧМБ,13	;СЧЕТЧИК ПО БЛОКАМ И МКСХ
	   01 077 044 0002	523		ПИ	2,1
   0000205			524	ЗДЧД
00 0000205 14 074 3777401	525		ПА	0-ЧУ,12		;СЧЕТЧИК УСЛОВИЙ
	   06 074 0000000	526		ПА	0,6		;НАЧ.УСЛОВИЕ
   0000206			527	ЗМД
00 0000206 13 074 3777761	528		ПА	0-ЧК,11		;СЧЕТЧИК КОЛОНОК
	   04 074 0000020	529		ПА	020,4		;НОМЕР НАЧ.КОЛОНКИ ДЛЯ 2-Й ПОЛОВИНЫ
00 0000207 07 072 0000000	530		ПФ	,7
	   07 040 0000211	531		ИР	ЗКД,7
00 0000210 04 074 0000000	532		ПА	0,4		;НОМЕР НАЧ.КОЛОНКИ ДЛЯ 1-Й ПОЛОВИНЫ		
	   00 072 0000000
00 0000211 12 074 3777401	533	ЗКД	ПА	0-ЧС,10		;СЧЕТЧИК СТРОК
	   05 074 0000000	534		ПА	0,5		;НОМЕР НАЧ.СТРОКИ
   0000212			535	ЗСД
				536	
				537	; *******************************************************
				538	; *		   ЗАПИСЬ В МИКРОСХЕМЕ			*
				539	; *******************************************************
				540	 
00 0000212 07 010 0000444	541		СЧ	ВСЕЕД,7
	   06 077 044 0011	542		ПИ	9,6
00 0000213 04 077 045 0011	543		СИ	9,4		;ИР11:=НОМЕР КОЛОНКИ + УСЛОВИЕ
	   05 077 047 0011	544		ИМ	9,5		;ИР11:=НОМЕР КОЛОНКИ + УСЛОВИЕ - НОМЕР СТРОКИ
00 0000214 07 072 0000000	545		ПФ	,7
	   11 040 0000216	546		ИР	ЗД,9		;ВЫПОЛНЕНО УСЛОВИЕ ЗАПИСИ ОБРАТНОГО КОДА
00 0000215 00 010 0000000	547		СЧ	0
	   00 072 0000000
   0000216			548	ЗД
00 0000216 01 000 0000000	549		ЗЧ	0,1
	   01 075 0000040	550		СА	040,1		;НОВАЯ СТРОКА ИЛИ КОЛОНКА
00 0000217 05 075 0000001	551		СА	1,5		;НОМЕР СТРОКИ + 1 
	   07 072 0000000	552		ПФ	,7
00 0000220 12 033 0000212	553		КЦ	ЗСД,10		;КЦ ЗП ПО СТРОКАМ
	   04 075 0000001	554		СА	1,4		;НОВ.КОЛОНКА
00 0000221 07 072 0000000	555		ПФ	,7
	   13 033 0000211	556		КЦ	ЗКД,11		;КЦ ЗП ПО КОЛОНКАМ
00 0000222 06 075 0000001	557		СА	1,6		;НОВОЕ УСЛОВИЕ
	   02 077 044 0001	558		ПИ	1,2
00 0000223 07 072 0000000	559		ПФ	,7
	   14 033 0000206	560		КЦ	ЗМД,12		;КЦ ЗП ПО УСЛОВИЯМ
00 0000224 00 077 001 0000	561		ВТ
	   00 072 0000000
   0000225			562	ЧТД
00 0000225 02 077 044 0001	563		ПИ	1,2		;НАЧ.АДРЕС ПРОВЕРКИ
	   06 074 0000000	564		ПА	0,6		;НАЧ.УСЛОВИЕ
00 0000226 14 074 3777401	565		ПА	0-ЧУ,12		;СЧЕТЧИК УСЛОВИЙ
	   00 072 0000000
00 0000227 13 074 3777761	566	ЧМД	ПА	0-ЧК,11		;СЧЕТЧИК КОЛОНОК
	   04 074 0000010	567		ПА	8,4		;НОМЕР НАЧ.КОЛОНКИ ДЛЯ 2-Й ПОЛОВИНЫ
00 0000230 07 072 0000000	568		ПФ	,7
	   07 040 0000232	569		ИР	ЧКД,7
00 0000231 04 074 0000000	570		ПА	0,4		;НОМЕР НАЧ.КОЛОНКИ ДЛЯ 1-Й ПОЛОВИНЫ		
КАС2011 Файл SP : Лист 11 Дата 18.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

	   00 072 0000000
00 0000232 12 074 3777401	571	ЧКД	ПА	0-ЧС,10		;СЧЕТЧИК СТРОК
	   05 074 0000000	572		ПА	0,5		;НОМЕР НАЧ.СТРОКИ
   0000233			573	ЧСД
				574	
				575	; *******************************************************
				576	; *		    ЧТЕНИЕ В МИКРОСХЕМЕ			*
				577	; *******************************************************
				578	
00 0000233 07 072 0000000	579		ПФ	,7
	   03 074 0000444	580		ПА	ВСЕЕД,3		;И3:=АДРЕС ЭТАЛОННОГО КОДА
00 0000234 06 077 044 0011	581		ПИ	9,6
	   04 077 045 0011	582		СИ	9,4		;И11:=НОМЕР.КОЛ. + УСЛОВИЕ
00 0000235 05 077 046 0011	583		МИ	9,5		;И11:=НОМЕР КОЛ. + УСЛОВИЕ - НОМЕР СТР.
	   07 072 0000000	584		ПФ	,7
00 0000236 11 040 0000240	585		ИР	ЧД,9		;УСЛОВИЕ ВЫПОЛНЕНО
	   07 072 0000000	586		ПФ	,7
00 0000237 03 074 0000443	587		ПА	НОЛЬ,3		;И3:=АДРЕС ЭТАЛОННОГО КОДА
	   00 072 0000000
   0000240			588	ЧД
00 0000240 01 010 0000000	589		СЧ	0,1
	   03 012 0000000	590		СР	0,3		;СРАВНИМ С ЭТАЛОНОМ
00 0000241 07 050 0000243	591		УР	ЧД1,7		;СОВПАЛИ
				592	
				593	; *******************************************************
				594	; *							*
				595	; *	  ОШИБКА НЕСРАВНЕНИЯ В ТЕСТЕ 'ДИАГОНАЛЬ'	*
				596	; *							*
				597	; * ИНДИКАЦИЯ:						*
				598	; *  ВР	 - ЭТАЛОННЫЙ КОД				*
				599	; *  СМ	 - КОД НЕСРАВНЕНИЯ				*
				600	; *  РМР - СЧИТАННЫЙ КОД				*
				601	; *  И1	 - АДРЕС СЧИТЫВАНИЯ				*
				602	; *******************************************************
				603	
	   00 072 0000000
00 0000242 00 077 007 0053	604	СТПД	ОСТ	053
	   07 030 0000243	605		ПБ	ЧД1,7		;ЗДЕСЬ БУДЕТ ДИАГНОСТИКА
				606	
00 0000243 01 075 0000040	607	ЧД1	СА	040,1		;НОВАЯ СТР. ИЛИ КОЛ.
	   05 075 0000001	608		СА	1,5		;НОМЕР СТРОКИ + 1
00 0000244 07 072 0000000	609		ПФ	,7
	   12 033 0000233	610		КЦ	ЧСД,10		;КЦ ЧТ ПО СТРОКАМ
00 0000245 02 077 044 0001	611		ПИ	1,2
	   04 075 0000001	612		СА	1,4		;НОМЕР КОЛОНКИ + 1
00 0000246 07 072 0000000	613		ПФ	,7
	   13 033 0000232	614		КЦ	ЧКД,11		;КЦ ЗП ПО КОЛОНКАМ
00 0000247 06 075 0000001	615		СА	1,6		;НОВОЕ УСЛОВИЕ
	   07 072 0000000	616		ПФ	,7
00 0000250 14 033 0000227	617		КЦ	ЧМД,12		;КЦ ЧТ ПО УСЛОВИЯМ
	   02 075 0000001	618		СА	1,2		;НОВЫЙ БЛОК ИЛИ МКСХ
00 0000251 02 077 044 0001	619		ПИ	1,2
	   07 072 0000000	620		ПФ	,7
00 0000252 15 033 0000205	621		КЦ	ЗДЧД,13		;КЦ ЗП/ЧТ ПО БЛОКАМ И МКСХ
				622	
	   00 072 0000000
   0000253			623	ТХЭМ
				624	
				625	; *******************************************************
				626	; *							*
				627	; *		ПРОВЕРКА РАЗРЯДОВ ХЭММИНГА		*
				628	; *							*
КАС2011 Файл SP : Лист 12 Дата 18.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

				629	; * АЛГОРИТМ ПРОВЕРКИ:					*
				630	; *  РАЗРЯДЫ ХЭММИНГА ПРОВЕРЯЮТСЯ НА ТЕХ ЖЕ АЛГОРИТМАХ, *
				631	; *  ЧТО И ИНФОРМАЦИОННЫЕ РАЗРЯДЫ, С ИСПОЛЬЗОВАНИЕМ КО- *
				632	; *  ДОВ 'ВСЕ 0', 'ВСЕ 1'(ПРОВЕРКА 71-73 И 77-79 РР.) И *
				633	; *  'ЕДИНИЦА 58 РАЗРЯДА'(ПРОВЕРКА 76-74 РР.).		*
				634	; *  КРИТЕРИЙ ИСПРАВНОСТИ - ОТСУТСТВИЕ ИСПРАВЛЕНИЯ ОДИ- *
				635	; *  НОЧНЫХ ОШИБОК. КОНТРОЛЬ ЧЕРЕЗ ПУЛЬТОВОЙ ПРОЦЕССОР. *
				636	; * ЗАМЕЧАНИЕ:						*
				637	; *  ПРОВЕРЯЮТСЯ 76-74РР., Т.К. 73-71РР. И 77-79РР. БЫ- *
				638	; *  ЛИ ПРОВЕРЕНЫ СОВМЕСТНО С ИНФОРМАЦИОННЫМИ РАЗРЯДАМИ *
				639	; *  В ПП.1.2-1.3.					*
				640	; *******************************************************
				641	
   0000253			642	ЗПХЧТХ
				643	
				644	; *******************************************************
				645	; *							*
				646	; *	     ПРОВЕРКА ПРЯМЫМ И ОБРАТНЫМ КОДОМ		*
				647	; *							*
				648	; * РАСПРЕДЕЛЕНИЕ РЕГИСТРОВ:				*
				649	; *  И1	 - АДРЕС ЗАПИСИ/ЧТЕНИЯ				*
				650	; *  И2	 - ТЕКУЩИЙ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ		*
				651	; *  И3	 - ТЕКУШИЙ АДРЕС ПЕРЕБОРА ПО СТРОКАМ		*
				652	; *  И4	 - АДРЕС ПРОВЕРОЧНОГО КОДА			*
				653	; *  И11 - ПАРАМЕТР ЦИКЛА ПО БЛОКАМ			*
				654	; *  И12 - ПАРАМЕТР ЦИКЛА ПО МИКРОСХЕМАМ		*
				655	; *  И13 - ПАРАМЕТР ЦИКЛА ПО КОЛОНКАМ			*
				656	; *  И14 - ПАРАМЕТР ЦИКЛА ПО СТРОКАМ			*
				657	; *  И15 - ПАРАМЕТР ЦИКЛА ПО КОДАМ ПРОВЕРКИ		*
				658	; *******************************************************
				659	
00 0000253 14 074 3777777	660		ПА	-1,12		;2-А КОДА ПРОВЕРКИ/'ВСЕ 1' И Е58/
	   07 072 0000000	661		ПФ	,7
00 0000254 04 074 0000444	662		ПА	ПК+1,4		;И4:=АДРЕС КОДА ПРОВЕРКИ	
	   00 072 0000000
   0000255			663	ЗХЧХ
				664	
				665	; *******************************************************
				666	; *			РОСПИСЬ ОП			*
				667	; *******************************************************
				668	
00 0000255 04 010 0000000	669		СЧ	0,4		;СМ:=КОД ПРОВЕРКИ
				670	
				671	; * И1:=НАЧ.АДРЕС ПРОВЕРКИ -------
				672	
	   01 074 0000000	673		ПА	0,1
00 0000256 07 072 0000000	674		ПФ	,7
	   07 041 0000260	675		ИН	ЗХ,7
00 0000257 01 074 0400000	676		ПА	ПОЛПАМ,1
				677	
	   00 072 0000000
00 0000260 01 077 044 0003	678	ЗХ	ПИ	3,1		;НАЧ.АДРЕС ПЕРЕБОРА ПО СТРОКАМ
	   14 074 3777401	679		ПА	0-ЧС,12		;СЧЕТЧИК СТРОК
   0000261			680	ЗСХ
00 0000261 13 074 3777761	681		ПА	0-ЧК,11		;СЧЕТЧИК КОЛОНОК
	   03 077 044 0002	682		ПИ	2,3		;НАЧ./ТЕКУЩИЙ/ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ	
   0000262			683	ЗКХ
00 0000262 12 074 3777771	684		ПА	0-ЧМ,10		;СЧЕТЧИК МКСХ
	   00 072 0000000
   0000263			685	ЗМХ
00 0000263 11 074 3777775	686		ПА	0-ЧБ,9		;СЧЕТЧИК БЛОКОВ
				687	
КАС2011 Файл SP : Лист 13 Дата 18.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

	   00 072 0000000
   0000264			688	ЗБХ
00 0000264 01 000 0000000	689		ЗЧ	0,1
	   01 075 0000001	690		СА	1,1		;НОВЫЙ БЛОК ИЛИ МКСХ
00 0000265 07 072 0000000	691		ПФ	,7
	   11 033 0000264	692		КЦ	ЗБХ,9		;КЦ ЗП ПО БЛОКАМ
00 0000266 07 072 0000000	693		ПФ	,7
	   12 033 0000263	694		КЦ	ЗМХ,10		;КЦ ЗП ПО МКСХ
00 0000267 02 075 0020000	695		СА	020000,2	;НОВАЯ КОЛОНКА
	   02 077 044 0001	696		ПИ	1,2
00 0000270 07 072 0000000	697		ПФ	,7
	   13 033 0000262	698		КЦ	ЗКХ,11		;КЦ ЗП ПО КОЛОНКАМ
00 0000271 03 075 0000040	699		СА	040,3		;НОВАЯ СТРОКА
	   03 077 044 0001	700		ПИ	1,3
00 0000272 07 072 0000000	701		ПФ	,7
	   14 033 0000261	702		КЦ	ЗСХ,12		;КЦ ЗП ПО СТРОКАМ
				703	
   0000273			704	ЧХ
				705	
				706	; *******************************************************
				707	; *		  СЧИТЫВАНИЕ С КОРРЕКЦИЕЙ		*
				708	; *******************************************************
				709	
				710	; * И1:= НАЧ.АДРЕС ПРОВЕРКИ -------
				711	
00 0000273 01 074 0000000	712		ПА	0,1
	   07 072 0000000	713		ПФ	,7
00 0000274 07 041 0000275	714		ИН	ЧХ1,7
	   01 074 0400000	715		ПА	ПОЛПАМ,1
				716	
00 0000275 01 077 044 0003	717	ЧХ1	ПИ	3,1		;НАЧ.АДРЕС ПЕРЕБОРА ПО СТРОКАМ
	   14 074 3777401	718		ПА	0-ЧС,12		;СЧЕТЧИК СТРОК
   0000276			719	ЧСХ
00 0000276 13 074 3777761	720		ПА	0-ЧК,11		;СЧЕТЧИК КОЛОНОК
	   03 077 044 0002	721		ПИ	2,3		;НАЧ./ТЕКУЩИЙ/ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ
   0000277			722	ЧКХ
00 0000277 12 074 3777771	723		ПА	0-ЧМ,10		;СЧЕТЧИК МКСХ
	   00 072 0000000
   0000300			724	ЧМХ
00 0000300 11 074 3777775	725		ПА	0-ЧБ,9		;СЧЕТЧИК БЛОКОВ
	   00 072 0000000
   0000301			726	ЧБХ
00 0000301 01 010 0000000	727		СЧ	0,1		;ЧИТАЕМ С КОРРЕКЦИЕЙ ПО ХЭММИНГУ
	   01 075 0000001	728		СА	1,1		;НОВЫЙ БЛОК ИЛИ МКСХ
00 0000302 07 072 0000000	729		ПФ	,7
	   11 033 0000301	730		КЦ	ЧБХ,9		;КЦ ЧТ ПО БЛОКАМ
00 0000303 07 072 0000000	731		ПФ	,7
	   12 033 0000300	732		КЦ	ЧМХ,10		;КЦ ЧТ ПО МИКРОСХЕМАМ
00 0000304 02 075 0020000	733		СА	020000,2	;НОВАЯ КОЛОНКА
	   02 077 044 0001	734		ПИ	1,2
00 0000305 07 072 0000000	735		ПФ	,7
	   13 033 0000277	736		КЦ	ЧКХ,11		;КЦ ЧТ ПО КОЛОНКАМ
00 0000306 03 075 0000040	737		СА	040,3		;НОВАЯ СТРОКА
	   03 077 044 0001	738		ПИ	1,3
00 0000307 07 072 0000000	739		ПФ	,7
	   14 033 0000276	740		КЦ	ЧСХ,12		;КЦ ЧТ ПО СТРОКАМ
00 0000310 04 075 0000001	741		СА	1,4		;НОВЫЙ КОД
	   07 072 0000000	742		ПФ	,7
00 0000311 15 033 0000255	743		КЦ	ЗХЧХ,13		;КЦ ЗП/ЧТ
				744	
	   00 072 0000000
   0000312			745	МАРШХ
КАС2011 Файл SP : Лист 14 Дата 18.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

				746	
				747	; *******************************************************
				748	; *							*
				749	; *		ПРОВЕРКА ТЕСТОМ 'МАРШ'			*
				750	; *							*			
				751	; * РАСПРЕДЕЛЕНИЕ РЕГИСТРОВ:				*
				752	; *  И1	 - АДРЕС ЗАПИСИ/ЧТЕНИЯ				*
				753	; *  И2	 - ТЕКУЩИЙ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ		*
				754	; *  И3	 - ТЕКУЩИЙ АДРЕС ПЕРЕБОРА ПО СТРОКАМ		*
				755	; *  И11 - ПАРАМЕТР ЦИКЛА ПО БЛОКАМ			*
				756	; *  И12 - ПАРАМЕТР ЦИКЛА ПО МИКРОСХЕМАМ		*
				757	; *  И13 - ПАРАМЕТР ЦИКЛА ПО КОЛОНКАМ			*
				758	; *  И14 - ПАРАМЕТР ЦИКЛА ПО СТРОКАМ			*
				759	; *******************************************************
				760		
				761	
				762	; * И1:=НАЧ. АДРЕС ПРОВЕРКИ --------
00 0000312 01 074 0000000	763		ПА	0,1
	   07 072 0000000	764		ПФ	,7
00 0000313 07 041 0000314	765		ИН	ЗМХ1,7
	   01 074 0400000	766		ПА	ПОЛПАМ,1
   0000314			767	ЗМХ1
				768		
				769	; *******************************************************
				770	; *			РОСПИСЬ ОП			*
				771	; *******************************************************
				772	
00 0000314 07 010 0000444	773		СЧ	ВСЕЕД,7
	   01 077 044 0003	774		ПИ	3,1		;НАЧ.АДРЕС ПЕРЕБОРА ПО СТРОКАМ
00 0000315 14 074 3777401	775		ПА	0-ЧС,12		;СЧ-К СТРОК
	   00 072 0000000
   0000316			776	ЗСМХ1
00 0000316 13 074 3777761	777		ПА	0-ЧК,11		;СЧ-К КОЛОНОК
	   03 077 044 0002	778		ПИ	2,3		;НАЧ./ТЕКУЩИЙ/ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ
   0000317			779	ЗКМХ1
00 0000317 12 074 3777771	780		ПА	0-ЧМ,10		;СЧ-К МКСХ
	   00 072 0000000
   0000320			781	ЗММХ1
00 0000320 11 074 3777775	782		ПА	0-ЧБ,9		;СЧ-К БЛОКОВ
	   00 072 0000000
00 0000321 01 000 0000000	783	ЗБМХ1	ЗЧ	0,1
	   01 075 0000001	784		СА	1,1		;НОВЫЙ БЛОК ИЛИ МКСХ
00 0000322 07 072 0000000	785		ПФ	,7
	   11 033 0000321	786		КЦ	ЗБМХ1,9		;КЦ ЗП ПО БЛОКАМ
00 0000323 07 072 0000000	787		ПФ	,7
	   12 033 0000320	788		КЦ	ЗММХ1,10	;КЦ ЗП ПО МКСХ
00 0000324 02 075 0020000	789		СА	020000,2	;НОВАЯ КОЛОНКА
	   02 077 044 0001	790		ПИ	1,2
00 0000325 07 072 0000000	791		ПФ	,7
	   13 033 0000317	792		КЦ	ЗКМХ1,11	;КЦ ЗП ПО КОЛОНКАМ
00 0000326 03 075 0000040	793		СА	040,3		;НОВАЯ СТРОКА
	   03 077 044 0001	794		ПИ	1,3
00 0000327 07 072 0000000	795		ПФ	,7
	   14 033 0000316	796		КЦ	ЗСМХ1,12	;КЦ ЗАПИСИ ПО СТРОКАМ
00 0000330 00 077 001 0000	797		ВТ
	   00 072 0000000
   0000331			798	ЧТМХ1
				799	
				800	; ***********************************************
				801	; *		   ЧТЕНИЕ ОП			*
				802	; ***********************************************
				803	
КАС2011 Файл SP : Лист 15 Дата 18.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

				804	; * И1:=НАЧ.АДРЕС ПРОВЕРКИ --------
				805	
00 0000331 01 074 0000000	806		ПА	0,1
	   07 072 0000000	807		ПФ	,7
00 0000332 07 041 0000333	808		ИН	ЧМХ1,7
	   01 074 0400000	809		ПА	ПОЛПАМ,1	;НАЧ.АДРЕС ПРОВЕРКИ
   0000333			810	ЧМХ1
00 0000333 01 077 044 0003	811		ПИ	3,1		;НАЧ.АДРЕС ПЕРЕБОРА ПО СТРОКАМ
	   14 074 3777401	812		ПА	0-ЧС,12		;СЧ-К СТРОК
   0000334			813	ЧСМХ1
00 0000334 13 074 3777761	814		ПА	0-ЧК,11		;СЧ-К КОЛОНОК
	   03 077 044 0002	815		ПИ	2,3		;НАЧ./ТЕКУЩИЙ/ АДРЕС ПЕРЕБОРА ПО КОЛОНКАМ
   0000335			816	ЧКМХ1
00 0000335 12 074 3777771	817		ПА	0-ЧМ,10		;СЧ-К МКСХ
	   00 072 0000000
   0000336			818	ЧММХ1
00 0000336 11 074 3777775	819		ПА	0-ЧБ,9		;СЧ-К БЛОКОВ
	   00 072 0000000
   0000337			820	ЧБМХ1	
00 0000337 01 010 0000000	821		СЧ	0,1
	   07 010 0000445	822		СЧ	Е58,7		;ОБРАТНЫЕ 76-74РР.
00 0000340 01 000 0000000	823		ЗЧ	0,1
	   00 077 001 0000	824		ВТ			;ВЫТОЛКНЕМ В ОП
   0000341			825	КЦЧХ1
00 0000341 01 075 0000001	826		СА	1,1		;НОВЫЙ БЛОК ИЛИ МКСХ
	   07 072 0000000	827		ПФ	,7
00 0000342 11 033 0000337	828		КЦ	ЧБМХ1,9		;КЦ ЧТ ПО БЛОКАМ
	   07 072 0000000	829		ПФ	,7
00 0000343 12 033 0000336	830		КЦ	ЧММХ1,10	;КЦ ЧТ ПО МКСХ
	   02 075 0020000	831		СА	020000,2	;НОВАЯ КОЛОНКА
00 0000344 02 077 044 0001	832		ПИ	1,2
	   07 072 0000000	833		ПФ	,7
00 0000345 13 033 0000335	834		КЦ	ЧКМХ1,11	;КЦ ЧТ ПО КОЛОНКАМ
	   03 075 0000040	835		СА	040,3		;НОВАЯ СТРОКА
00 0000346 03 077 044 0001	836		ПИ	1,3
	   07 072 0000000	837		ПФ	,7
00 0000347 13 033 0000334	838		КЦ	ЧСМХ1,11	;КЦ ЧТ ПО СТРОКАМ
				839	
				840	; *******************************************************
				841	; *	   ПЕРЕБОР АДРЕСОВ ОТ СТАРШИХ К МЛАДШИМ		*
				842	; *******************************************************
				843		
				844	
	   00 072 0000000
   0000350			845	ЧТМХ2
				846	
				847	; *******************************************************
				848	; *			ЧТЕНИЕ ОП			*
				849	; *******************************************************
				850	
				851	; * И1:=КОН. АДРЕС ПРОВЕРЯЕМОЙ ОБЛАСТИ -------
				852	
00 0000350 01 074 0377777	853		ПА	ПОЛПАМ-1,1
	   07 072 0000000	854		ПФ	0,7
00 0000351 07 041 0000352	855		ИН	ЧМХ2,7
	   01 074 0777777	856		ПА	КОНСП,1
   0000352			857	ЧМХ2
00 0000352 01 077 044 0003	858		ПИ	3,1		;НАЧ.АДРЕС ПЕРЕБОРА ПО СТРОКАМ
	   14 074 3777401	859		ПА	0-ЧС,12		;СЧ-К СТРОК
   0000353			860	ЧСМХ2
00 0000353 03 077 044 0002	861		ПИ	2,3		;НАЧ./ТЕКУЩИЙ/ АДРЕС ПЕРЕБОРА ПО СТРОКАМ
	   13 074 3777761	862		ПА	0-ЧК,11		;СЧ-К КОЛОНОК
КАС2011 Файл SP : Лист 16 Дата 18.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

   0000354			863	ЧКМХ2
00 0000354 12 074 3777771	864		ПА	0-ЧМ,10		;СЧ-К МКСХ
	   00 072 0000000
   0000355			865	ЧММХ2
00 0000355 11 074 3777775	866		ПА	0-ЧБ,9		;СЧ-К БЛОКОВ
	   00 072 0000000
   0000356			867	ЧБМХ2
00 0000356 01 010 0000000	868		СЧ	0,1
	   07 010 0000444	869		СЧ	ВСЕЕД,7		;ОБРАТНЫЕ 76-74РР.
00 0000357 01 000 0000000	870		ЗЧ	0,1
	   01 075 3777777	871		СА	-1,1		;НОВЫЙ БЛОК ИЛИ МКСХ
00 0000360 00 077 001 0000	872		ВТ			;ВЫТОЛКНЕМ В ОП
	   00 072 0000000
00 0000361 07 072 0000000	873	КЦЧХ2	ПФ	,7
	   11 033 0000356	874		КЦ	ЧБМХ2,9		;КЦ ЧТ ПО БЛОКАМ
00 0000362 07 072 0000000	875		ПФ	,7
	   12 033 0000355	876		КЦ	ЧММХ2,10	;КЦ ЧТ ПО МКСХ
00 0000363 02 075 3760000	877		СА	-020000,2	;НОВАЯ КОЛОНКА
	   02 077 044 0001	878		ПИ	1,2
00 0000364 07 072 0000000	879		ПФ	,7
	   13 033 0000354	880		КЦ	ЧКМХ2,11	;КЦ ЧТ ПО КОЛОНКАМ
00 0000365 03 075 3777740	881		СА	-040,3		;НОВАЯ СТРОКА
	   03 077 044 0001	882		ПИ	1,3
00 0000366 07 072 0000000	883		ПФ	,7
	   14 033 0000353	884		КЦ	ЧСМХ2,12	;КЦ ЧТ ПО СТРОКАМ
00 0000367 07 030 0000427	885		ПБ	ПЕРЕПТ,7	;ВРЕМЕННО: ОБХОД ТЕСТА 'ДИАГОНАЛЬ'
	   00 072 0000000
   0000370			886	ДИАГХ		
				887	
				888	; *******************************************************
				889	; *							*
				890	; *	     ПРОВЕРКА ТЕСТОМ 'ДИАГОНАЛЬ'		*
				891	; *							*
				892	; * РАСПРЕДЕЛЕНИЕ РЕГИСТРОВ:				*
				893	; *  И1	 - АДРЕС ЗАПИСИ/ЧТЕНИЯ				*
				894	; *  И2	 - ТЕКУЩИЙ АДРЕС ПЕРЕБОРА ПО БЛОКАМ И МКСХ	*
				895	; *  И3	 - АДРЕС ЭТАЛОННОГО КОДА			*
				896	; *  И4	 - НОМЕР КОЛОНКИ				*
				897	; *  И5	 - НОМЕР СТРОКИ					*
				898	; *  И6	 - УСЛОВИЕ					*
				899	; *  И11 - РАБОЧИЙ ДЛЯ ПРОВЕРКИ УСЛОВИЯ			*
				900	; *  И12 - ПАРАМЕТР ЦИКЛА ПО СТРОКАМ			*
				901	; *  И13 - ПАРАМЕТР ЦИКЛА ПО КОЛОНКАМ			*
				902	; *  И14 - ПАРАМЕТР ЦИКЛА ПО УСЛОВИЯМ			*
				903	; *  И15 - ПАРАМЕТР ЦИКЛА ПО БЛОКАМ И МКСХ		*
				904	; *							*
				905	; *******************************************************
				906	
				907	; * И1:=НАЧ.АДРЕС ПРОВЕРЯЕМОЙ ОБЛАСТИ --------
				908	
00 0000370 01 074 0000000	909		ПА	,1
	   07 072 0000000	910		ПФ	,7
00 0000371 07 041 0000372	911		ИН	ЗДХЧДХ,7
	   01 074 0400000	912		ПА	ПОЛПАМ,1
				913	
00 0000372 15 074 3777741	914	ЗДХЧДХ	ПА	0-ЧМБ,13	;СЧ-К ПО БЛОКАМ И МКСХ
	   01 077 044 0002	915		ПИ	2,1
00 0000373 14 074 3777401	916	ЗДХ	ПА	0-ЧУ,12		;СЧЕТЧИК УСЛОВИЙ
	   06 074 0000000	917		ПА	0,6		;НАЧ.УСЛОВИЕ
   0000374			918	ЗМДХ
00 0000374 13 074 3777761	919		ПА	0-ЧК,11		;СЧЕТЧИК КОЛОНОК
	   04 074 0000020	920		ПА	020,4		;НАЧ.КОЛОНКА 2-Й ПОЛОВИНЫ
КАС2011 Файл SP : Лист 17 Дата 18.3.89 (0:2)


Тг   Адрес Код:		Строка	Текст

00 0000375 07 072 0000000	921		ПФ	,7
	   07 040 0000211	922		ИР	ЗКД,7
00 0000376 04 074 0000000	923		ПА	0,4		;НАЧ.КОЛОНКА 1-Й ПОЛОВИНЫ
	   00 072 0000000
   0000377			924	ЗКДХ
00 0000377 12 074 3777401	925		ПА	0-ЧС,10		;СЧЕТЧИК СТРОК
	   05 074 0000000	926		ПА	0,5		;НОМЕР НАЧ.СТРОКИ
   0000400			927	ЗСДХ
				928	
				929	; ***********************************************
				930	; *		ЗАПИСЬ В МИКРОСХЕМЕ		*
				931	; ***********************************************
				932	
00 0000400 07 010 0000445	933		СЧ	Е58,7	
	   06 077 044 0011	934		ПИ	9,6
00 0000401 04 075 0000011	935		СА	9,4		;И11:=НОМЕР КОЛОНКИ + УСЛОВИЕ
	   05 077 047 0011	936		ИМ	9,5		;И11:=НОМЕР КОЛОНКИ + УСЛОВИЕ - НОМЕР СТРОКИ
00 0000402 07 072 0000000	937		ПФ	0,7
	   11 040 0000373	938		ИР	ЗДХ,9		;ВЫПОЛНЕНО УСЛОВИЕ ЗАПИСИ ОБРАТНОГО КОДА
00 0000403 07 010 0000444	939		СЧ	ВСЕЕД,7
	   00 072 0000000
   0000404			940	ЗХД
00 0000404 01 000 0000000	941		ЗЧ	0,1
	   01 075 0000040	942		СА	040,1		;НОВАЯ СТРОКА ИЛИ КОЛОНКА
00 0000405 05 075 0000001	943		СА	1,5		;НОМЕР СТРОКИ + 1
	   07 072 0000000	944		ПФ	,7
00 0000406 12 033 0000400	945		КЦ	ЗСДХ,10		;КЦ ЗП ПО КОЛОНКАМ
	   04 075 0000001	946		СА	1,4		;НОВ. КОЛОНКА
00 0000407 07 072 0000000	947		ПФ	,7
	   13 033 0000377	948		КЦ	ЗКДХ,11		;КЦ ЗП ПО КОЛОНКАМ
00 0000410 06 075 0000001	949		СА	1,6		;НОВОЕ УСЛОВИЕ
	   02 077 044 0001	950		ПИ	1,2
00 0000411 07 072 0000000	951		ПФ	,7
	   14 033 0000374	952		КЦ	ЗМДХ,12		;КЦ ЗП ПО УСЛОВИЯМ
00 0000412 00 077 001 0000	953		ВТ			;ВЫТОЛКНЕМ В ОП
	   00 072 0000000
   0000413			954	ЧТДХ
				955	
00 0000413 02 077 044 0001	956		ПИ	1,2		;НАЧ. АДРЕС ПРОВЕРКИ
	   06 074 0000000	957		ПА	0,6		;НАЧ.УСЛОВИЕ
00 0000414 14 074 3777401	958		ПА	0-ЧУ,12		;СЧ-К УСЛОВИЙ
	   00 072 0000000
   0000415			959	ЧМДХ
00 0000415 13 074 3777761	960		ПА	0-ЧК,11		;СЧ-К КОЛОНОК
	   00 072 0000000
   0000416			961	ЧКДХ
00 0000416 12 074 3777401	962		ПА	0-ЧС,10		;СЧЕТЧИК СТРОК
	   00 072 0000000
   0000417			963	ЧСДХ
				964	
				965	; ***********************************************
				966	; *		ЧТЕНИЕ В МИКРОСХЕМЕ		*
				967	; ***********************************************
				968	
00 0000417 01 010 0000000	969		СЧ	0,1
	   01 075 0000040	970		СА	040,1		;НОВАЯ СТР. ИЛИ КОЛ.
00 0000420 07 072 0000000	971		ПФ	,7
	   12 033 0000417	972		КЦ	ЧСДХ,10		;КЦ ЧТ ПО СТРОКАМ
00 0000421 02 077 044 0001	973		ПИ	1,2
	   07 072 0000000	974		ПФ	,7
00 0000422 13 033 0000416	975		КЦ	ЧКДХ,11		;КЦ ЧТ ПО КОЛОНКАМ
	   07 072 0000000	976		ПФ	,7
КАС2011 Файл SP : Лист 18 Дата 18.3.89 (0:3)


Тг   Адрес Код:		Строка	Текст

00 0000423 14 033 0000415	977		КЦ	ЧМДХ,12		;КЦ ЧТ ПО УСЛОВИЯМ
	   02 075 0000001	978		СА	1,2		;НОВЫЙ БЛОК ИЛИ МКСХ
00 0000424 02 077 044 0001	979		ПИ	1,2
	   07 072 0000000	980		ПФ	,7
00 0000425 15 033 0000372	981		КЦ	ЗДХЧДХ,13	;КЦ ЗП/ЧТ ПО УСЛОВИЯМ
	   07 030 0000427	982		ПБ	ПЕРЕПТ,7	;ПЕРЕПИСЬ ТЕСТА
				983	
   0000426			984	ДИАГНОЗ
				985	
				986	; *******************************************************
				987	; *							*
				988	; *	БЛОК ДИАГНОСТИКИ В СЛУЧАЕ ОДИНОЧНОЙ ОШИБКИ	*
				989	; *		  (РЕЖИМ БЕЗ ИСПРАВЛЕНИЯ)		*
				990	; *							*
				991	; * ПРИ ВХОДЕ:						*
				992	; *  И1 - АДРЕС СЧИТЫВАНИЯ				*
				993	; *  СМ - КОД НЕСРАВНЕНИЯ				*
				994	; *							*
				995	; * ИСПОЛЬЗУЕМЫЕ РЕГИСТРЫ:				*
				996	; *******************************************************
				997	
00 0000426 00 077 007 1000	998		ОСТ	01000		;НЕ РЕАЛИЗОВАНО
				999	
	   00 072 0000000
   0000427			1000	ПЕРЕПТ
				1001	
				1002	; *******************************************************
				1003	; *							*
				1004	; *  ПЕРЕПИСЬ ТЕСТА В ДРУГУЮ ПОЛОВИНУ СИСТЕМНОЙ ПАМЯТИ	*
				1005	; *							*
				1006	; * ИСПОЛЬЗУЕМЫЕ РЕГИСТРЫ:				*
				1007	; *  И1 - АДРЕС ЧТЕНИЯ					*
				1008	; *  И2 - АДРЕС ЗАПИСИ					*
				1009	; * ПЕРЕПИСЬ ВЫПОЛНЯЕТСЯ В ГРУППОВОМ РЕЖИМЕ		*
				1010	; *******************************************************
				1011	
00 0000427 01 074 0000000	1012		ПА	0,1		;И1:=АДРЕС ЧТЕНИЯ - 1
	   02 074 0400000	1013		ПА	ПОЛПАМ,2	;И2:=АДРЕС ЗАПИСИ - 1
00 0000430 07 072 0000000	1014		ПФ	0,7
	   07 040 0000432	1015		ИР	ПЕРЕП,7		;И7 = 0 - ТЕСТ В ПЕРВОЙ ПОЛОВИНЕ
00 0000431 01 074 0400000	1016		ПА	ПОЛПАМ,1	;И1:=АДРЕС ЧТЕНИЯ - 1
	   02 074 0000000	1017		ПА	0,2		;И2:=АДРЕС ЗАПИСИ - 1
   0000432			1018	ПЕРЕП
00 0000432 00 072 0000000	1019		ПФ	0		;ЧТОБЫ УГ БЫЛА ПРАВОЙ
	   00 076 0000446	1020		УГ	КСУМТ-ТСП+1	;ЛГ=1,ИС10:=ДЛИНА ТЕСТА
00 0000433 01 170 0000001	1021		СТК	1,1
	   02 177 0000001	1022		ЗТК	1,2;
00 0000434 00 077 001 0000	1023		ВТ			;ВЫТОЛКНЕМ В ОП
	   00 072 0000000
   0000435			1024	БАЗА
				1025	
				1026	; * ПЕРЕУСТАНОВКА БАЗЫ ТЕСТА И ПЕРЕХОД НА ИСПОЛНЕНИЕ
				1027	
00 0000435 07 072 0000000	1028		ПФ	,7
	   07 040 0000437	1029		ИР	НБАЗ,7		;И7=0 - ТЕСТ В ПЕРВОЙ ПОЛОВИНЕ
00 0000436 07 074 0000000	1030		ПА	,7		;НОВАЯ БАЗА = 0
	   00 030 0000440	1031		ПБ	ВЫХТ
   0000437			1032	НБАЗ
00 0000437 07 074 0400000	1033		ПА	ПОЛПАМ,7	;ТЕСТ ВО 2-Й ПОЛОВИНЕ
	   07 030 0000043	1034		ПБ	КСУМ,7		;НА ИСПОЛНЕНИЕ
   0000440			1035	ВЫХТ
00 0000440 10 075 0000001	1036		СА	1,8		;СЧ-К ПРОХОДОВ + 1
КАС2011 Файл SP : Лист 19 Дата 18.3.89 (0:3)


Тг   Адрес Код:		Строка	Текст

	   00 077 042 0010	1037		ВИ	8
00 0000441 00 112 0000002	1038		СРЛ	ЧПВТ
	   00 050 0000040	1039		УР	СТП		;ТЕСТ ВЫПОЛНЕН
00 0000442 00 030 0000043	1040		ПБ	КСУМ		;ПОВТОР 
				1041	
				1042	; *******************************************************
				1043	; *			КОНСТАНТЫ			*
				1044	; *******************************************************
				1045	
	   00 072 0000000
   0000443			1046	ПК					;КОДЫ ПРОВЕРКИ
00 0000443 000 000 000 000	1047		.КОД	0			;'ВСЕ 0'
	   000 000 000 000
00 0000444 377 377 377 377	1048		.КОД	-1			;'ВСЕ 1'
	   377 377 377 377
00 0000445 002 000 000 000	1049		.КОД	1<57			;'1 В 58Р.'
	   000 000 000 000
00 0000446 000 000 000 000	1050	КСУМТ	.КОД	0			;КОНТРОЛЬНАЯ СУММА ТЕСТА
	   000 000 000 000
				1051	
				1052	; *******************************************************
				1053	; *		    РАБОЧИЕ ЯЧЕЙКИ ТЕСТА		*
				1054	; *******************************************************
				1055	
00 0000447 0 0 0 0 0 0 0 0	1056	РАЯ	.ПАМ	1
				1057	
				1058	; *******************************************************
				1059	; *		    ЭКВИВАЛЕНТНОСТИ			*
				1060	; *******************************************************
				1061	
	  =00000400000		1062	ПОЛПАМ	.ЭКВ	0400000			;НАЧ.АДРЕС 2-Й ПОЛОВИНЫ СИСТЕМНОЙ ОП
	  =00000777777		1063	КОНСП	.ЭКВ	0777777			;КОНЕЧНЫЙ АДРЕС СИСТЕМНОЙ ОП	
	  =00000000003		1064	ЧБ	.ЭКВ	3			;ЧИСЛО БЛОКОВ
	  =00000000007		1065	ЧМ	.ЭКВ	7			;ЧИСЛО МИКРОСХЕМ
	  =00000000017		1066	ЧК	.ЭКВ	017			;ЧИСЛО КОЛОНОК
	  =00000000377		1067	ЧС	.ЭКВ	0377			;ЧИСЛО СТРОК
	  =00000000377		1068	ЧУ	.ЭКВ	0377			;ЧИСЛО УСЛОВИЙ
	  =00000000037		1069	ЧМБ	.ЭКВ	037			;ЧИСЛО БЛОКОВ И МКСХ
	  =00000000445		1070	Е58	.ЭКВ	ПК+2			;'ЕДИНИЦА В 58Р.'
	  =00000000444		1071	ВСЕЕД	.ЭКВ	ПК+1;			;'ВСЕ 1'
	  =00000000443		1072	НОЛЬ	.ЭКВ	ПК			;'ВСЕ 0'
	  =00000000002		1073	ЧПВТ	.ЭКВ	2
				1074	
				1075		.КНЦ				;ТЕСТА СИСТЕМНОЙ ПАМЯТИ

Начало трансляции	00:00:45.
Конец  трансляции	00:03:10.
Транслировано строк	1075
