000021 Identification Division.
000030 Program-Id.  Hello.
000040 Environment Division.
000041 Configuration Section.
000042 Source-Computer.  IBM-PC.
000043 Object-Computer.  IBM-PC.
000053 Data Division.
000054 Procedure Division.
000073 Hello-Start.
000083     Display "Hello World".
000084     Stop Run.
