void prn_rule()
{
    char ch;
    clrscr();
    printf("      Нехитрые правила игры (рекомендую немного поиграть, а потом читать).\n");
    printf("   Первое, вашим подданным нужно кушать . На каждого человека - крестьянина или\n");
    printf("гвардейца - нужно в год 3 тонны зерна (стандартная норма) . Если дадите меньше,\n");
    printf("то может быть 3 варианта последствий: 1) дадите от 70%% до 99%% . Вас немного по-\n");
    printf("журят и напомнят, что народ нужно кормить . 2) дадите от 40%% до 69%% . С вероят-\n");
    printf("ностью, обратно пропорциональной выделенной норме, может произойти революция, и\n");
    printf("Вас свергнут. А может и не произойти. 3) дадите < 40%% . Гарантированно произой-\n");
    printf("дет революция, и Вас свергнут.\n");
    printf("   Так что перед тем, как купить огромную армию крестьян или солдат, посмотрите\n");
    printf("- а сможете ли Вы ее прокормить.\n");
    printf("   Второе, солдатам нужно ежегодно платить жалование. По 10 руб. за год каждому\n");
    printf("солдату. Плюс еще 10 р. начальнику стражи, который всегда на службе , даже если\n");
    printf("под его началом - ни одного гвардейца. Если в казне не хватает денег на выплату\n");
    printf("жалованья, то Ваша верная гвардия может просто-напросто дезертировать...\n");
    printf("   Третье, крестьянам для работы нужна земля. Если земли больше , чем крестьян,\n");
    printf("то крестьяне обрабатывают ровно столько земли , сколько их самих. Если крестьян\n");
    printf("больше, чем земли, то они обрабатывают всю землю, а 'лишние', те, которым земли\n");
    printf("не хватило, могут сбежать от Вас. Сбегает обычно часть 'лишних' крестьян.\n");
    printf("   Учтите, что урожай может быть получен только с обрабатываемых земель. Каждый\n");
    printf("гектар пашни требует для посева 1 тонну зерна. Дадите меньше, чем обрабатывает-\n");
    printf("ся земли, следовательно, засеете не всю возможную площадь, и часть обрабатывае-\n");
    printf("мой земли простоит год впустую. Дадите больше, чем обрабатывается земли - прос-\n");
    printf("то потратите впустую зерно, так как посеется все равно только необходимое коли-\n");
    printf("чество зерна, а остальное, выделенное для посева, пропадет впустую. Так что мой\n");
    printf("Вам совет - выделяйте на посев именно столько зерна, сколько нужно.");
    ch = getch();
    if (ch == 0)
        ch = getch();
    clrscr();
    printf("   Описывать работу с биржей и всякую дипломатию не имеет смысла - там все эле-\n");
    printf("ментарно. Два слова можно сказать о караванах.\n");
    printf("   Караван  -  достаточно редкая возможность быстро разбогатеть, если Вы готовы\n");
    printf("рискнуть. Вложенные в караван деньги приносят прибыль x6. Но не радуйтесь рань-\n");
    printf("ше времени  -  не все так просто.. Ваш караван могут запросто ограбить бандиты,\n");
    printf("отняв у Вас изрядный кусок прибыли. А могут и не просто ограбить , а разграбить\n");
    printf("полностью... И тогда плакали Ваши денежки.\n");
    printf("   Не жадничайте, давайте на храм митрополиту - ведь это богоугодное дело. Гля-\n");
    printf("дишь, и действительно новый храм отгрохают... \n");
    printf("   Да, и народу на Новый год выделяйте иногда - пусть повеселится...\n");
    printf("   Пара слов насчет войны. Разведка сообщает не точную информацию о численности\n");
    printf("противника, а приблизительную, с ошибкой -25%% - +25%%. Учитывайте это...\n");
    printf("   Война может возникнуть в двух случаях: 1) у Вас мало солдат. Чем малочислен-\n");
    printf("нее Ваша гвардия, тем чаще будут нападать нахальные соседи. 2) Вы оскорбили ка-\n");
    printf("кого-либо соседа отказом жениться на его дочке . Оскорбленный сосед обязательно\n");
    printf("покатит на Вас бочку (то бишь пойдет войной). Хотя, с другой стороны, согласив-\n");
    printf("шись на брак, Вы потратите кучу денег на свадебный пир, а там еще , может быть,\n");
    printf("и на день рождения сына, и на похороны королевы... Решайте сами, что Вам выгод-\n");
    printf("ней...\n");
    printf("\n");
    printf("\n");
    printf("                                         Written by Ponpa Dmitriy, 41PDM. 1998.");
    ch = getch();
    if (ch == 0)
        ch = getch();
}
