# include       "trek.h"

/*
**      global variable definitions
*/

struct device   Device[NDEV] =
{
	"маршевый двигатель",   "Скотти",       "",
	"ближний локатор",      "Скотти",       "",
	"дальний локатор",       "Скотти",       "",
	"фазеры",               "Сулу",         "ы",
	"торпедная установка",  "Сулу",         "а",
	"импульсный двигатель", "Скотти",       "",
	"защита",               "Сулу",         "а",
	"компьютер",            "Спок",         "",
	"аппаратура связи",     "Ухура",        "а",
	"жизнеобеспечение",     "Скотти",       "о",
	"навигационная система","Чехов",        "а",
	"устройство закрытия",  "Скотти",       "о",
	"транспортер",          "Скотти",       "",
	"космобот",             "Скотти",       "",
	"*ERR 14*",             "Nobody",       "",
	"*ERR 15*",             "Nobody",       ""
};

char    *Systemname[NINHAB] =
{
	"ERROR",
	"Талос IV",
	"Ригель III",
	"Денеб VII",
	"Канопус V",
	"Икар I",
	"Прометей II",
	"Омега VII",
	"Элиза I",
	"Скалос IV",
	"Процион IV",
	"Архнид I",
	"Арго VIII",
	"Триада III",
	"Эхо IV",
	"Нимрод III",
	"Немисис IV",
	"Центавр I",
	"Хронос III",
	"Спектрос V",
	"Бета III",
	"Гамма Триангули VI",
	"Пирис III",
	"Триархус",
	"Маркус XII",
	"Каланд",
	"Ардана",
	"Стратос",
	"Эдем",
	"Аррикис",
	"Эпсилон Эридана IV",
	"Экзо III"
};
