       >>SOURCE FREE
program-id. helloat.
procedure division.
    display "Hello, world! " line 5 column 5 end-display
    call "C$SLEEP" using 1 end-call
    stop run.
