000050* Code Snippet Only, Not A Complete Program.
000051 Configuration Section.
000060 Special-Names.
000070     Cursor Is Cursor-Position.
000080 Source-Computer.  IBM-PC.
000090 Object-Computer.  IBM-PC.
000100 Data Division.
000110 Working-Storage Section.
000120 01  Cursor-Position.
000130     03  Cursor-Row    Pic 9(2) Value 1.
000140     03  Cursor-Column Pic 9(2) Value 1.
