/*
 * Таблица кодировки ввода/вывода для терминала
 * Wyse-75, модифицированного фирмой Utec под русские
 * буквы с фантастической кодировкой.
 * Кодировка на вводе соответствует переводу ЙЦУКЕН - QUERTY
 * то есть изображает русскую клавиатуру на клавиатуре QUERTY.
 */
struct tablecod {
		  char ct_out[64];
		  char ct_in[96]; } tablecod =
{
   {    0257, 0346, 0254, 0367, 0354, 0364, 0341, 0365,
	0333, 0342, 0361, 0362, 0353, 0366, 0371, 0352,
	0347, 0372, 0350, 0343, 0356, 0345, 0273, 0344,
	0355, 0363, 0360, 0351, 0334, 0357, 0370, 0247,
	0277, 0306, 0274, 0327, 0314, 0324, 0301, 0325,
	0373, 0302, 0321, 0322, 0313, 0326, 0331, 0312,
	0307, 0332, 0310, 0303, 0316, 0305, 0272, 0304,
	0315, 0323, 0320, 0311, 0374, 0317, 0330, 040 },
  {
	' ', '!', 'Э', '?', '$', '%', '&',   'э',    /* 040 - 047 */
	'(', ')', '*', '+', 'б', '-', '.',   'ю',    /* 050 - 057 */
	'0', '1', '2', '3', '4', '5', '6',   '7',    /* 060 - 067 */
	'8', '9', 'Ж', 'ж', 'Б', '=', '>',   'Ю',    /* 070 - 077 */
	'/', 'Ф', 'И', 'С', 'В', 'У', 'А',   'П',    /* 100 - 107 */
	'Р', 'Ш', 'О', 'Л', 'Д', 'Ь', 'Т',   'Щ',    /* 110 - 117 */
	'З', 'Й', 'К', 'Ы', 'Е', 'Г', 'М',   'Ц',    /* 120 - 127 */
	'Ч', 'Н', 'Я', 'х', ',', ']', '^',   '_',    /* 130 - 137 */
	'`', 'ф', 'и', 'с', 'в', 'у', 'а',   'п',    /* 140 - 147 */
	'р', 'ш', 'о', 'л', 'д', 'ь', 'т',   'щ',    /* 150 - 157 */
	'з', 'й', 'к', 'ы', 'е', 'г', 'м',   'ц',    /* 160 - 167 */
	'ч', 'н', 'я', 'Х', '|', 'ъ', '~',   ' '     /* 170 - 177 */
  }
};


main()
{
exit(write(1,&tablecod,(sizeof tablecod)) != (sizeof tablecod));
}

